{"Explorations in Management": {"title": "Explorations in Management", "number": "15.000", "description": "Broad introduction to the various aspects of management including analytics, accounting and finance, operations, marketing, entrepreneurship and leadership, organizations, economics, systems dynamics, and negotiation and communication. Introduces the field of management through a variety of experiences, including management games (simulations), cases, and discussions led by industry experts. Also reviews the three undergraduate majors offered by Sloan as well as careers in management."}, "Economic Analysis for Business Decisions": {"title": "Economic Analysis for Business Decisions", "number": "15.0111", "description": "Introduces principles of microeconomics as a framework for making more informed managerial decisions. Discusses the supply and demand paradigm with applications to digital marketplaces, innovation, sources of market power, and strategic pricing. Provides an introduction to game theory to study competition and cooperation both within and between firms. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details."}, "Applied Macro- and International Economics": {"title": "Applied Macro- and International Economics", "number": "15.012", "description": "Uses case studies to investigate the macroeconomic environment in which firms operate. Subject develops the basic tools of macro and international economics: monetary and fiscal policy, growth theory and exchange rates. Discusses recent emerging market and financial crises, examining their causes, how best to address them, and how to prevent them from recurring in the future. Evaluates different strategies of economic development, including an understanding of growth and development and the role of debt and foreign aid."}, "Industrial Economics for Strategic Decisions": {"title": "Industrial Economics for Strategic Decisions", "number": "15.013", "description": "Applies principles of industrial economics most relevant for corporate strategy to analysis of particular industries. Topics include market structure and its determinants; rational strategic behavior in small numbers situations; strategies for price and nonprice competition; dynamic pricing, output, and advertising decisions; entry and entry deterrence; competition with network externalities; investments under uncertainty; R&D and patent licensing; and the growth and evolution of industries."}, "Applied Macro- and International Economics II": {"title": "Applied Macro- and International Economics II", "number": "15.014", "description": "Establishes understanding of the development processes of societies and economies. Studies several dimensions of sustainability (environmental, social, political, institutional, economy, organizational, relational, and personal) and the balance among them. Explores the basics of governmental intervention, focusing on areas such as the judicial system, environment, social security, and health. Builds skills to determine what type of policy is most appropriate. Considers implications of new technologies on the financial sector: internationalization of currencies, mobile payment systems, and cryptocurrencies. Discusses the institutional framework to ensure choices are sustainable across all dimensions and applications."}, "Macro and International Economics": {"title": "Macro and International Economics", "number": "15.015", "description": "Focuses on the policy and economic environment of firms. Subject divided in two parts: study of the closed economy and how monetary and fiscal policy interacts with employment, GNP, inflation, and interest rates; and study of the open economy with discussion of recent financial and currency crises in developed and emerging markets. Restricted to Sloan Fellows."}, "Engineering, Economics and Regulation for Energy Access in Developing Countries": {"title": "Engineering, Economics and Regulation for Energy Access in Developing Countries", "number": "15.017[J]", "description": "Examines the technical, economic, political and social trade-offs inherent in designing energy solutions that can ensure universal access to electricity - as well as modern technologies for heating and cooking - in developing countries. Presents the characteristic features of the power sectors in these countries and how they need specific technical, financial and regulatory approaches. Focuses on the identification and design of viable business models that can attract the large volume of private investment needed to achieve universal energy access. Covers adequate power sector regulation and computer-aided electrification planning techniques in detail. Students make use of these models and discuss practical case examples."}, "Economics of Energy, Innovation, and Sustainability": {"title": "Economics of Energy, Innovation, and Sustainability", "number": "15.0201[J]", "description": "Covers energy and environmental market organization and regulation. Explores economic challenges and solutions to transforming energy markets to be more efficient, accessible, affordable, and sustainable. Applies core economic concepts - consumer choice, firm profit maximization, and strategic behavior - to understand when energy and environmental markets work well and when they fail. They also conduct data-driven economic analysis on the trade-offs of real and proposed policy interventions. Topics include renewable generation sources for electricity, energy access in emerging markets, efficiency programs and fuel efficiency standards, transitioning transportation to alternative fuels, measuring damages and adaptation to climate change, and the effect of energy and environmental policy on innovation. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details."}, "Real Estate Economics": {"title": "Real Estate Economics", "number": "15.021[J]", "description": "Develops understanding of the fundamental economic factors that shape the market for real property, as well as the influence of capital markets in asset pricing. Analyzes of housing as well as commercial real estate. Covers demographic analysis, regional growth, construction cycles, urban land markets, and location theory. Exercises and modeling techniques for measuring and predicting property demand, supply, vacancy, and prices."}, "Global Climate Change: Economics, Science, and Policy": {"title": "Global Climate Change: Economics, Science, and Policy", "number": "15.026[J]", "description": "Introduces scientific, economic, and ecological issues underlying the threat of global climate change, and the institutions engaged in negotiating an international response. Develops an integrated approach to analysis of climate change processes, and assessment of proposed policy measures, drawing on research and model development within the MIT Joint Program on the Science and Policy of Global Change. Graduate students are expected to explore the topic in greater depth through reading and individual research. 12.340 recommended."}, "Applied Economics for Managers": {"title": "Applied Economics for Managers", "number": "15.722", "description": "Develops facility with concepts, language, and analytical tools of economics. Primary focus is on microeconomics. Emphasizes integration of theory, data, and judgment in the analysis of corporate decisions and public policy, and in the assessment of changing US and international business environments. Restricted to Executive MBA students."}, "Game Theory for Strategic Advantage": {"title": "Game Theory for Strategic Advantage", "number": "15.0251", "description": "Develops and applies principles of game theory relevant to managers' strategic decisions. Topics include how to reason about strategies and opponents; strategic commitment and negotiations; reputation and seemingly irrational actions; bidding in auctions; and the design of auctions, contests and markets. Applications to a variety of business decisions that arise in different industries, both within and outside the firm. Meets with 15.025 when offered concurrently. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details."}, "Opportunities in Developing Economies": {"title": "Opportunities in Developing Economies", "number": "15.027", "description": "Investigates the role of the private sector in developing economies, highlighting how solving market failures can improve overall welfare. Covers constraints faced by firms in developing economies: contract enforcement, corruption, political risk, human rights, IP and infrastructure. Uses case studies to discuss successful firms and innovative solutions to these constraints, including public-private partnerships, the role of technology, the role of finance and impact investing."}, "Engineering, Economics and Regulation of the Electric Power Sector": {"title": "Engineering, Economics and Regulation of the Electric Power Sector", "number": "15.032[J]", "description": "Provides an in-depth and interdisciplinary look at electric power systems, focusing on regulation as the link among engineering, economic, legal, and environmental viewpoints. Topics include electricity markets, incentive regulation of network utilities, retail competition, tariff design, distributed generation, rural electrification, multinational electricity markets, environmental impacts, and the future of utilities and strategic sustainability issues under both traditional and competitive regulatory frameworks. Background in policy, microeconomics, or engineering desirable. Students taking graduate version complete additional assignments."}, "Econometrics for Managers: Correlation & Causality in a Big Data World": {"title": "Econometrics for Managers: Correlation & Causality in a Big Data World", "number": "15.034", "description": "Enables students to evaluate the quality of evidence supported by data, and to implement an empirical toolkit that provides credible answers to questions in finance, marketing, human resources, strategy, and general business planning. Reviews big-data tools designed to discover useful correlations. Introduces econometrics as a framework to go beyond correlations to causality, including an in-depth understanding of regression modelling including instrumental-variables estimation.  Students apply these tools in classroom exercises, problem sets, and projects. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details."}, "Econometrics for Managers: Correlation and Causality in a Big Data World": {"title": "Econometrics for Managers: Correlation and Causality in a Big Data World", "number": "15.0341", "description": "Enables students to evaluate the quality of evidence supported by data, and to implement an empirical toolkit that provides credible answers to questions in finance, marketing, human resources, strategy, and general business planning. Reviews big-data tools designed to discover useful correlations. Introduces econometrics as a framework to go beyond correlations to causality, including an in-depth understanding of regression modelling including instrumental-variables estimation.  Students apply these tools in classroom exercises, problem sets, and projects. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details."}, "Energy Economics and Policy": {"title": "Energy Economics and Policy", "number": "15.037[J]", "description": "Analyzes business and public policy issues in energy markets and in the environmental markets to which they are closely tied. Examines the economic determinants of industry structure and evolution of competition among firms in these industries. Investigates successful and unsuccessful strategies for entering new markets and competing in existing markets. Industries studied include oil, natural gas, coal, electricity, and transportation. Topics include climate change and environmental policy, the role of speculation in energy markets, the political economy of energy policies, and market power and antitrust. Two team-based simulation games, representing the world oil market and a deregulated electricity market, act to cement the concepts covered in lecture. Students taking graduate version complete additional assignments. Limited to 60."}, "Optimization Methods in Business Analytics": {"title": "Optimization Methods in Business Analytics", "number": "15.053", "description": "Introduces optimization methods with a focus on modeling, solution techniques, and analysis. Covers linear programming, network optimization, integer programming, nonlinear programming, and heuristics. Applications to logistics, manufacturing, statistics, machine learning, transportation, game theory, marketing, project management, and finance. Includes a project in which student teams select and solve an optimization problem (possibly a large-scale problem) of practical interest."}, "The Airline Industry": {"title": "The Airline Industry", "number": "15.054[J]", "description": "Overview of the global airline industry, focusing on recent industry performance, current issues and challenges for the future. Fundamentals of airline industry structure, airline economics, operations planning, safety, labor relations, airports and air traffic control, marketing, and competitive strategies, with an emphasis on the interrelationships among major industry stakeholders. Recent research findings of the MIT Global Airline Industry Program are showcased, including the impacts of congestion and delays, evolution of information technologies, changing human resource management practices, and competitive effects of new entrant airlines. Taught by faculty participants of the Global Airline Industry Program."}, "Data, Models, and Decisions": {"title": "Data, Models, and Decisions", "number": "15.730", "description": "Introduces students to fundamental tools in using data to make informed management decisions. Emphasizes the executive perspective: how to leverage best-practice quantitative methods  to manage and drive the business. Exercises and cases complemented by perspectives and applications in finance, operations management, healthcare, the Internet, and other functions and industries. Restricted to Executive MBA students."}, "Data Mining: Finding the Models and Predictions that Create Value": {"title": "Data Mining: Finding the Models and Predictions that Create Value", "number": "15.0621", "description": "Introduction to data mining, data science, and machine learning, methods that assist in recognizing patterns, developing models and predictive analytics, and making intelligent use of massive amounts of data collected via the internet, e-commerce, electronic banking, pointof-sale devices, bar-code readers, medical databases, and other sources. Topics include logistic regression, association rules, treestructured classification and regression, cluster analysis, discriminant analysis, and neural network methods. Presents examples of successful applications in credit ratings, fraud detection, marketing, customer relationship management, investments, and synthetic clinical trials. Introduces data-mining software focusing on R. Term project required. Meets with 15.062 when offered concurrently. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details."}, "System Optimization and Analysis for Operations": {"title": "System Optimization and Analysis for Operations", "number": "15.066[J]", "description": "Introduction to mathematical modeling, optimization, and simulation, as applied to manufacturing and operations. Specific methods include linear programming, network flow problems, integer and nonlinear programming, discrete-event simulation, heuristics and computer applications for manufacturing processes, operations and systems. Restricted to Leaders for Global Operations students."}, "Discrete Probability and Stochastic Processes": {"title": "Discrete Probability and Stochastic Processes", "number": "15.070[J]", "description": "Provides an introduction to tools used for probabilistic reasoning in the context of discrete systems and processes. Tools such as the probabilistic method, first and second moment method, martingales, concentration and correlation inequalities, theory of random graphs, weak convergence, random walks and Brownian motion, branching processes, Markov chains, Markov random fields, correlation decay method, isoperimetry, coupling, influences and other basic tools of modern research in probability will be presented. Algorithmic aspects and connections to statistics and machine learning will be emphasized."}, "The Analytics Edge": {"title": "The Analytics Edge", "number": "15.727", "description": "Introduces modern analytics methods (data mining and optimization), starting with real-world problems where analytics have made a material difference. Modern data mining methods include clustering, classification, logistic regression, CART, random forest methods, and association rules. Modern optimization methods include robust, adaptive and dynamic optimization. Applications include health care, hospital operations, finance, energy, security, internet, and demand modeling. Uses R programming language for data mining and ROME for robust optimization. Restricted to Exeuctive MBA students."}, "Applied Probability and Stochastic Models": {"title": "Applied Probability and Stochastic Models", "number": "15.073[J]", "description": "A vigorous use of probabilistic models to approximate real-life situations in Finance, Operations Management, Economics, and Operations Research. Emphasis on how to develop a suitable probabilistic model in a given setting and, merging probability with statistics, and on how to validate a proposed model against empirical evidence. Extensive treatment of Monte Carlo simulation for modeling random processes when analytic solutions are unattainable."}, "Predictive Data Analytics and Statistical Modeling": {"title": "Predictive Data Analytics and Statistical Modeling", "number": "15.0741", "description": "Provides a brief review of statistics and regression drawn from advanced topics, such as bootstrap resampling, variable selection, data and regression diagnostics, visualization, and Bayesian and robust methods. Covers data-mining and machine learning, including classification, logistic regression, and clustering. Culminates with time series analysis and forecasting, design of experiments, analysis of variance, and process control. Uses statistical computing systems based on application add-ins and stand-alone packages. Case studies involve finance, management science, consulting, risk management, and engineering systems. Term project required."}, "Statistical Thinking and Data Analysis": {"title": "Statistical Thinking and Data Analysis", "number": "15.075[J]", "description": "Introduces a rigorous treatment of statistical data analysis while helping students develop a strong intuition for the strengths and limitations of various methods. Topics include statistical sampling and uncertainty, estimation, hypothesis testing, linear regression, classification, analysis of variation, and elements of data mining. Involves empirical use of hypothesis testing and other statistical methodologies in several domains, including the assessment of A-B experiments on the web and the identification of genes correlated with diseases."}, "Statistical Learning and Data Mining": {"title": "Statistical Learning and Data Mining", "number": "15.077[J]", "description": "Advanced introduction to theory and application of statistics, data-mining, and machine learning, concentrating on techniques used in management science, marketing, finance, consulting, engineering systems, and bioinformatics. Topics include the bootstrap theory of estimation, testing, nonparametric statistics, analysis of variance, categorical data analysis, regression analysis, MCMC, EM, Gibbs sampling, and Bayesian methods. Focuses on data mining, supervised learning, and multivariate analysis. Topics selected from logistic regression; principal components and dimension reduction; discrimination and classification analysis, trees (CART), partial least squares, nearest neighbors, regularized methods, support vector machines, boosting and bagging, clustering, independent component analysis, and nonparametric regression. Uses statistics software packages, e.g., R and MATLAB. Some background in statistics required. Includes term project."}, "Introduction to Applied Probability": {"title": "Introduction to Applied Probability", "number": "15.0791", "description": "Presents probability from the perspective of applied mathematics, with strong emphasis on an intuitive overview of key theorems and continuing demonstrations of their usefulness. Covers the laws of probability and numerous important discrete and continuous random variables, both individually and in combination. Introduces simulation.  Draws applications from economics, finance, engineering, marketing, public policy, operations management, and operations research. Meets with 15.079 when offered concurrently. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details."}, "Introduction to Mathematical Programming": {"title": "Introduction to Mathematical Programming", "number": "15.081[J]", "description": "Introduction to linear optimization and its extensions emphasizing both methodology and the underlying mathematical structures and geometrical ideas. Covers classical theory of linear programming as well as some recent advances in the field. Topics: simplex method; duality theory; sensitivity analysis; network flow problems; decomposition; integer programming; interior point algorithms for linear programming; and introduction to combinatorial optimization and NP-completeness."}, "Integer Programming and Combinatorial Optimization": {"title": "Integer Programming and Combinatorial Optimization", "number": "15.083", "description": "In-depth treatment of the modern theory of integer programming and combinatorial optimization, emphasizing geometry, duality, and algorithms. Topics include formulating problems in integer variables, enhancement of formulations, ideal formulations, integer programming duality, linear and semidefinite relaxations, lattices and their applications, the geometry of integer programming, primal methods, cutting plane methods, connections with algebraic geometry, computational complexity, approximation algorithms, heuristic and enumerative algorithms, mixed integer programming and solutions of large-scale problems."}, "Nonlinear Optimization": {"title": "Nonlinear Optimization", "number": "15.084[J]", "description": "Unified analytical and computational approach to nonlinear optimization problems. Unconstrained optimization methods include gradient, conjugate direction, Newton, sub-gradient and first-order methods. Constrained optimization methods include feasible directions, projection, interior point methods, and Lagrange multiplier methods. Convex analysis, Lagrangian relaxation, nondifferentiable optimization, and applications in integer programming. Comprehensive treatment of optimality conditions and Lagrange multipliers. Geometric approach to duality theory. Applications drawn from control, communications, power systems, and resource allocation problems."}, "Fundamentals of Probability": {"title": "Fundamentals of Probability", "number": "15.085[J]", "description": "Introduction to probability theory. Probability spaces and measures. Discrete and continuous random variables. Conditioning and independence. Multivariate normal distribution. Abstract integration, expectation, and related convergence results. Moment generating and  characteristic functions. Bernoulli and Poisson process. Finite-state  Markov chains. Convergence notions and their relations. Limit theorems. Familiarity with elementary notions in probability and real analysis is desirable."}, "Engineering Statistics and Data Science": {"title": "Engineering Statistics and Data Science", "number": "15.087", "description": "Develops ideas for making principled decisions and recommendations based on data, providing an introduction to statistical inference and statistical learning. Covers data displays and summary statistics for quantitative and qualitative data, the law of large numbers for means and empirical distributions, the normal distribution and the central limit theorem, confidence intervals, statistical hypothesis tests for the population mean and differences between population means, simple and multiple regression with quantitative data, model selection, the bias-variance tradeoff, logistic regression for binary outcomes, CART, random forests, gradient boosting, and deep learning. The statistical programming language R is used for in-class demonstrations and for out-of-class assignments. Preference to first-year Leaders for Global Operations students. No required textbook."}, "Analytics Capstone": {"title": "Analytics Capstone", "number": "15.089", "description": "Practical application of business analytics problems within a real company. Teams of 1-2 students, matched with company projects, visit companies to define project and scope. In class, students refine and improve on projects and devise methods for solving problems for their select companies. Mentors are assigned to each team. The culmination of the program is summer, on-site, practical training. Restricted to Master of Business Analytics students."}, "Optimization Methods": {"title": "Optimization Methods", "number": "15.093[J]", "description": "Introduces the principal algorithms for linear, network, discrete, robust, nonlinear, and dynamic optimization. Emphasizes methodology and the underlying mathematical structures. Topics include the simplex method, network flow methods, branch and bound and cutting plane methods for discrete optimization, optimality conditions for nonlinear optimization, interior point methods for convex optimization, Newton's method, heuristic methods, and dynamic programming and optimal control methods. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details."}, "Robust Modeling, Optimization, and Computation": {"title": "Robust Modeling, Optimization, and Computation", "number": "15.094[J]", "description": "Introduces modern robust optimization, including theory, applications, and computation. Presents formulations and their connection to probability, information and risk theory for conic optimization (linear, second-order, and semidefinite cones) and integer optimization. Application domains include analysis and optimization of stochastic networks, optimal mechanism design, network information theory, transportation, pattern classification, structural and engineering design, and financial engineering. Students formulate and solve a problem aligned with their interests in a final project."}, "Machine Learning Under a Modern Optimization Lens": {"title": "Machine Learning Under a Modern Optimization Lens", "number": "15.095", "description": "Develops algorithms for central problems in machine learning from a modern optimization perspective. Topics include sparse, convex, robust and median regression; an algorithmic framework for regression; optimal classification and regression trees, and their relationship with neural networks; how to transform predictive algorithms to prescriptive algorithms; optimal prescriptive trees; and robust classification.  Also covers design of experiments, missing data imputations, mixture of Gaussian models, exact bootstrap, and sparse matrix estimation, including principal component analysis, factor analysis, inverse co-variance matrix estimation, and matrix completion."}, "Prediction: Machine Learning and Statistics": {"title": "Prediction: Machine Learning and Statistics", "number": "15.096", "description": "Gives a practical background and theoretical foundation to machine learning algorithms and Bayesian analysis. Includes an overview of the top ten algorithms in data mining. Covers frameworks for knowledge discovery, a unified view of support vector machines, AdaBoost and regression based on regularized risk minimization; generalization bounds from statistical learning theory based on covering numbers, VC dimension, and the margin theory; as well as basic Bayesian analysis and notes on the history of machine learning and statistics."}, "Evaluating a Biomedical Business Concept": {"title": "Evaluating a Biomedical Business Concept", "number": "15.124[J]", "description": "Involves critical analysis of new biomedical business ideas. Inventors or principals of early stage companies present their ideas and provide background material including scientific papers and patents. Student teams interact with the companies, potential customers, other stakeholders and experts to develop a series of analyses concerning the critical issues. Company and student presentations supplemented by topic-specific lectures and presentations by biomedical entrepreneurs. Enrollment limited."}, "Revolutionary Ventures: How to Invent and Deploy Transformative Technologies": {"title": "Revolutionary Ventures: How to Invent and Deploy Transformative Technologies", "number": "15.128[J]", "description": "Seminar on envisioning and building ideas and organizations to accelerate engineering revolutions. Focuses on emerging technology domains, such as neurotechnology, imaging, cryotechnology, gerontechnology, and bio-and-nano fabrication. Draws on historical examples as well as live case studies of existing or emerging organizations, including labs, institutes, startups, and companies. Goals range from accelerating basic science to developing transformative products or therapeutics. Each class is devoted to a specific area, often with invited speakers, exploring issues from the deeply technical through the strategic. Individually or in small groups, students prototype new ventures aimed at inventing and deploying revolutionary technologies."}, "Medicine for Managers and Entrepreneurs Proseminar": {"title": "Medicine for Managers and Entrepreneurs Proseminar", "number": "15.132[J]", "description": "Provides students with basic business-oriented clinical and technological knowledge related to health, healthcare and medicine through engagements with clinical and industry experts. Each session focuses on a specific field of medicine. Speakers include a basic science and/or clinical expert and a CEO or other senior executive involved in cutting-edge innovation in each area."}, "Principles and Practice of Drug Development": {"title": "Principles and Practice of Drug Development", "number": "15.136[J]", "description": "Description and critical assessment of the major issues and stages of developing a pharmaceutical or biopharmaceutical. Drug discovery, preclinical development, clinical investigation, manufacturing and regulatory issues considered for small and large molecules. Economic and financial considerations of the drug development process. Multidisciplinary perspective from faculty in clinical; life; and management sciences; as well as industry guests."}, "Case Studies and Strategies in Drug Discovery and Development": {"title": "Case Studies and Strategies in Drug Discovery and Development", "number": "15.137[J]", "description": "Aims to develop appreciation for the stages of drug discovery and development, from target identification, to the submission of preclinical and clinical data to regulatory authorities for marketing approval. Following introductory lectures on the process of drug development, students working in small teams analyze how one of four new drugs or drug candidates traversed the discovery/development landscape. For each case, an outside expert from the sponsoring drug company or pivotal clinical trial principal investigator provides guidance and critiques the teams' presentations to the class."}, "Economics of Health Care Industries": {"title": "Economics of Health Care Industries", "number": "15.141[J]", "description": "Considers health economics issues from a business perspective, including differences between health care and other industries, the role of health insurance, regulatory issues and incentives for innovation, data analytics to measure value, strategic issues in pricing and marketing, use of e-commerce and information technology, personalized/stratified medicines, and formation and management of various alliances. Explores US and global health institutions. Visiting speakers from academia, government, NGOs, and industry."}, "Central Banks, Monetary Policy and Global Financial Markets": {"title": "Central Banks, Monetary Policy and Global Financial Markets", "number": "15.216", "description": "Explores the role of central banks and monetary policy in the global economy and the effects of their policies on countries, companies and global financial markets.  Reviews the decision-making process and policy implementation, and provides conceptual tools for analyzing and predicting central bank decisions and assessing their likely impact.  Covers monetary policy, bank regulation and crisis management, drawing on the experience of the Federal Reserve, the ECB and central banks in emerging market economies."}, "Global Economic Challenges and Opportunities": {"title": "Global Economic Challenges and Opportunities", "number": "15.218", "description": "Analyzes the causes, effects and policy responses to recent major global economic issues. Studies financial crises, beginning with historical examples and building up to develop the tools to assess current vulnerabilities in countries around the world. Focuses on current economic debates in the headlines?so topics vary each year. Possible topics include globalization, currency wars, monetary and fiscal policy, unsustainable debt, aging populations, inequality and poverty, oil and commodity markets, international institutions, and financial contagion. Some background or coursework in international economics recommended."}, "Global Energy: Politics, Markets, and Policy": {"title": "Global Energy: Politics, Markets, and Policy", "number": "15.2191[J]", "description": "Focuses on the ways economics and politics influence the fate of energy technologies, business models, and policies around the world. Extends fundamental concepts in the social sciences to case studies and simulations that illustrate how corporate, government, and individual decisions shape energy and environmental outcomes. In a final project, students apply the concepts in order to assess the prospects for an energy innovation to scale and advance sustainability goals in a particular regional market. Recommended prerequisite: 14.01. Meets with 15.219 when offered concurrently. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details. Preference to juniors, seniors, and Energy Minors."}, "New Models for Global Business": {"title": "New Models for Global Business", "number": "15.220", "description": "Explores international dimensions of strategic management, and equips students to design strategies and structures that work effectively in an increasingly complex world economy. Focuses on a range of industries, from technology-based firms with global roots to emerging market multinationals. Topics include managing and leveraging big data, social and peer-to-peer networks, technology, and talent across national borders to develop capabilities and enhance competitive advantage. Includes a final group project in which students apply class concepts to evaluate strategic options for a startup or established global company of their choice. No final exam."}, "Global Strategy and Organization": {"title": "Global Strategy and Organization", "number": "15.221", "description": "Focuses on the international dimensions of strategy and organization, and provides a framework for formulating strategies in an increasingly complex world economy, and for making those strategies work effectively. Topics include the globalization of industries, the continuing role of country factors in competition, organization of multinational enterprises, building global networks, and the changing managerial tasks under conditions of globalization. Restricted to Sloan Fellows in Innovation and Global Leadership."}, "Global Markets, National Policies and the Competitive Advantages of Firms": {"title": "Global Markets, National Policies and the Competitive Advantages of Firms", "number": "15.223", "description": "Examines opportunities and risks firms face in today's global market. Provides conceptual tools for analyzing how governments and social institutions influence economic competition among firms embedded in different national settings. Public policies and institutions that shape competitive outcomes are examined through cases and analytical readings on different companies and industries operating in both developed and emerging markets. Restricted to Sloan Fellows in Innovation and Global Leadership."}, "Economy and Business in Modern China and India: China Lab and India Lab": {"title": "Economy and Business in Modern China and India: China Lab and India Lab", "number": "15.225", "description": "Provides an integrated approach to analyze the economies of China and India  through action learning. The classroom portion covers macro issues of China and India, project-related issues and personal and learning reflections. The onsite portion involves working with a host company in China or in India. Students work in teams to  tackle a real world business problem with an entrepreneurial Chinese or Indian company and produce a final deliverable for the host company. Students are required to take a mid semester trip during SIP and Spring Break to China or India to work onsite with the host company. Past lab projects have included creating a business plan for fundraising, developing a new market strategy, and crafting financial models; the projects have included both for-profit and NGO projects. Limited to graduate students who participate in China Lab or India Lab."}, "Effective Business Models in Frontier Markets": {"title": "Effective Business Models in Frontier Markets", "number": "15.232", "description": "Examines how new approaches to operations, revenue, marketing, finance, and strategy enable improved social outcomes in resource-limited settings across Africa, Latin America, and Asia. Draws on system dynamics, design thinking, and strategic analysis. Explores success and failure in attempts to innovate and scale in product and service delivery. Analysis of novel business models draws on case studies, videos, industry reports, research, and guest speakers. Students present their assessments of innovative base-of-the-pyramid enterprises that aim to do more with less. Students who have not taken at least three management or business classes must apply to the instructor for permission to enroll before the first day of class."}, "Global Health Lab": {"title": "Global Health Lab", "number": "15.233", "description": "Pairs faculty-mentored student teams with enterprises on the front lines of health care delivery in sub-Saharan Africa and South Asia. Custom-designed projects in strategy, business model innovation, operations, marketing, and technology designed to tackle specific barriers identified by each partnering organization. Interactive cases, practical exercises, and conversations with experts, all designed to support project work before, during, and after an intensive two-week onsite collaboration with entrepreneurs, leaders, staff, and stakeholders. Assignments include a portfolio of host deliverables, a foundational toolkit designed to support each project, and a distillation of learning from the field. Enrolled students must be available to work on site in Africa or South Asia for the entire weeks of SIP and Spring Break. Preference to students who have taken 15.232. Admission by application and interview in the prior November and December. Graduate students only."}, "Israel Lab: Startup Nation's Entrepreneurship and Innovation Ecosystem": {"title": "Israel Lab: Startup Nation's Entrepreneurship and Innovation Ecosystem", "number": "15.248", "description": "Practical study of Israel's innovation and entrepreneurial ecosystem. On-campus component provides context about the country and its social and geopolitical issues; also introduces entrepreneurship lessons and team dynamics. During IAP, student teams work at the Israeli host organizations on complex problems in critical areas, such as analytics, life sciences, robotics, FinTech, and cybersecurity, with an emphasis on early stage ventures and their growth. Limited to graduate students and Sloan undergraduates, application required for Sloan undergraduates."}, "Choice Points: Thinking about Life and Leadership through Literature": {"title": "Choice Points: Thinking about Life and Leadership through Literature", "number": "15.268", "description": "Explores decision making and leadership. Analyzes the dilemmas and decisions characters face in a selection of plays, stories, and films. Provokes reflection on what constitutes effective and moral reasoning in critical moments of both life and leadership.  Restricted to Sloan Fellows."}, "Leadership Stories:  Literature, Ethics, and Authority": {"title": "Leadership Stories:  Literature, Ethics, and Authority", "number": "15.269", "description": "Explores how we use story to articulate ethical norms.  The syllabus consists of short fiction, novels, plays, feature films and some non-fiction. Major topics include leadership and authority, professionalism, the nature of ethical standards, social enterprise, and questions of gender, cultural and individual identity, and work/life balance. Materials vary from year to year, but past readings have included work by Robert Bolt, Michael Frayn, Timothy Mo, Wole Soyinka, H.D. Thoreau, and others; films have included"}, "Ethical Practice:  Leading Through Professionalism, Social Responsibility, and System Design": {"title": "Ethical Practice:  Leading Through Professionalism, Social Responsibility, and System Design", "number": "15.270", "description": "Introduction to ethics in business, with a focus on business management. Students explore theoretical concepts in business ethics, and cases representing the challenges they will likely face as managers. Opportunity to work with guest faculty as well as business and other professional practitioners. Individual sessions take the form of moderated discussion, with occasional short lectures from instructor."}, "Communicating with Data": {"title": "Communicating with Data", "number": "15.286", "description": "Focuses on the strategic and tactical use of data to move others to take (the correct) action. Sharpens communication skills via practice and real-world examples. Students spend significant time writing, speaking and designing visuals for a professional audience. Intended for students who expect to communicate quantitative information with non-experts inside and outside of their organizations, as well as students seeking to improve communication skills in general. Recommended prerequisite: 15.280 or 15.284."}, "Management Communication for Undergraduates": {"title": "Management Communication for Undergraduates", "number": "15.279", "description": "Develops writing, speaking, teamwork, interpersonal, social media, and cross-cultural communication skills necessary for management professionals. Assignments include creating persuasive memos, writing in response to cases, and giving presentations. Major project involves the production of a team report and presentation on a topic of interest to a professional audience."}, "Communication for Leaders": {"title": "Communication for Leaders", "number": "15.280", "description": "Students develop and polish communication strategies and methods through discussion, examples, and practice. Emphasizes writing and speaking skills necessary for effective leaders. Includes several oral and written assignments which are integrated with other subjects, and with career development activities, when possible. Schedule and curriculum coordinated with Organizational Processes.  Mandatory one hour recitation in small groups. Restricted to first-year Sloan graduate students."}, "Advanced Leadership Communication": {"title": "Advanced Leadership Communication", "number": "15.281", "description": "Introduces interactive oral and interpersonal communication skills critical to leaders, including strategies for presenting to a hostile audience, running effective and productive meetings, active listening, and contributing to group decision-making. Includes team-run classes on chosen communication topics, and an individual analysis of leadership qualities and characteristics. Students deliver an oral presentation and an executive summary, both aimed at a business audience."}, "EnActing Leadership: Shakespeare and Performance": {"title": "EnActing Leadership: Shakespeare and Performance", "number": "15.282", "description": "Uses Shakespeare to challenge students' views of leadership and provide them with a deeper understanding of their performance as a leader. While performing shortened versions of Shakespeare's plays, students consider the serious questions they raise about the nature of leadership, power, and ambition, and explore their own leadership presence. Uses acting to strengthen speaking ability and personal presence."}, "Social Media Management: Persuasion in Networked Culture": {"title": "Social Media Management: Persuasion in Networked Culture", "number": "15.283", "description": "Explores how organizations and leaders can maximize the business value of social media platforms. Provides a framework and best practices for social media management, enhances understanding of strategic communication within the social media context, and improves social media communication skills. Assignments include case analysis, weekly content creation, and a final group project on social media strategy and content."}, "Strategic Leadership Communication": {"title": "Strategic Leadership Communication", "number": "15.284", "description": "Introduces the essentials of how individuals and organizations develop and implement effective communication strategies, focusing on persuasion, audience analysis, communicator credibility, message construction, and delivery. Includes oral presentations and writing assignments with feedback to help students improve their communication effectiveness. Provides instruction to create communication strategies, develop and present clearly organized and powerful presentations, expand personal oral delivery and writing styles, and enhance presentations through effective visual aids. Restricted to Sloan Fellows."}, "Doctoral Seminar: Communication Skills for Academics": {"title": "Doctoral Seminar: Communication Skills for Academics", "number": "15.289", "description": "Focuses on the communication skills needed for a career in academia. Topics include writing for academic journals, preparing and delivering conference papers and job talks, creating your professional presence on social media, peer reviewing for journals and conferences, and teaching. Participants are expected to work on a written project and deliver an oral presentation based on their current research. Limited to 20; priority to Sloan doctoral students who have completed their first year."}, "People, Teams, and Organizations Laboratory": {"title": "People, Teams, and Organizations Laboratory", "number": "15.301", "description": "Surveys individual and social psychology and organization theory interpreted in the context of the managerial environment. Laboratory involves projects of an applied nature in behavioral science. Emphasizes use of behavioral science research methods to test hypotheses concerning decision-making, group behavior, and organizational behavior. Instruction and practice in communication includes report writing, team projects, and oral and visual presentation. 12 units may be applied to the General Institute Laboratory Requirement. Shares lectures with 15.310."}, "Being Effective: Power and Influence": {"title": "Being Effective: Power and Influence", "number": "15.304", "description": "Discusses how to map power and interest patterns in organizations, how to understand your own interests and objectives, and how to operate effectively in organizational environments. Provides frameworks as well as a range of practical tools to address these goals. Utilizes a wide range of material drawn from the business and public worlds."}, "Leadership and Management": {"title": "Leadership and Management", "number": "15.305", "description": "Explores leadership from the military perspective taught by professors of military science from the Army, Navy and Air Force. Survey of basic principles for successfully managing and leading people, particularly in public service and the military. Develops skills in topics such as oral and written communication techniques, planning, team building, motivation, ethics, decision-making, and managing change. Relies heavily on interactive experiential classes with case studies, student presentations, role plays, and discussion. Also appropriate for non-management science majors."}, "People, Teams, and Organizations": {"title": "People, Teams, and Organizations", "number": "15.310", "description": "Surveys social psychology and organization theory as interpreted in the context of the managerial environment. Covers a number of diverse topics, including motivation and reward systems, social influence, groups and teams, leadership, power, organizational design and culture, and networks and communication patterns. Similar in content to 15.311; shares lectures with 15.301. Preference to non-Course 15 students."}, "Organizational Processes": {"title": "Organizational Processes", "number": "15.717", "description": "Designed to enhance students' ability to take effective action in complex organizational settings by providing the analytic tools needed to analyze, manage, and lead the organizations of the future. Emphasizes the importance of the organizational context in influencing which individual styles and skills are effective. Employs a wide variety of learning tools, from experiential learning to the more conventional discussion of written cases. Centers on three complementary perspectives on organizations: the strategic design, political, and cultural \"lenses\" on organizations. Restricted to Executive MBA students."}, "Organizational Processes for Business Analytics": {"title": "Organizational Processes for Business Analytics", "number": "15.312", "description": "Develops appreciation for organizational dynamics and competence in navigating social networks, working in a team, demystifying rewards and incentives, leveraging the crowd, understanding change initiatives, and making sound decisions. Provides instruction and practice in written and oral communication through presentations, and interpersonal and group exercises."}, "Building and Leading Effective Teams": {"title": "Building and Leading Effective Teams", "number": "15.316", "description": "An intensive one-week introduction to leadership, teams, and learning communities. Introduction of concepts and use of a variety of experiential exercises to develop individual and team skills and develop supportive relationships within the Fellows class. Restricted to first-year Leaders for Global Operations students."}, "Leadership and Organizational Change": {"title": "Leadership and Organizational Change", "number": "15.317", "description": "Course spans the entire two-year Leaders for Global Operations (LGO) program, with a focus on leadership that blends theory and practice. During their first summer in the program, students reflect on exemplary leaders' stories in cases, the arts, journalism, philosophy, and social science, and evaluate their own previous leadership experience. During the succeeding four semesters, they apply the lessons they have learned in class to their off-campus internship and other activities at Sloan, and intensively review that experience as they reach the end of the program. Classes take the form of moderated discussion, with the expectation that students will participate fully in each session; students also submit short, written deliverables throughout the program."}, "Discovering Your Leadership Signature": {"title": "Discovering Your Leadership Signature", "number": "15.739", "description": "Helps students understand their unique way of leading, i.e., leadership signature. Provides tools for students to determine what kind of leader they are and how to tell their leadership story. Examines leadership identity, drawing on theory from leadership literature, family systems, developmental psychology, personality psychology, and organizational change. Also builds on the four capabilities (4-CAP) model. Includes case studies, reflection, video analysis, and storytelling. Restricted to Executive MBA and Sloan Fellows students."}, "Strategic Organizational Design": {"title": "Strategic Organizational Design", "number": "15.320", "description": "Focuses on effective organizational design in both traditional and innovative organizations, with special emphasis on innovative organizational forms that can provide strategic advantage. Topics include when to use functional, divisional, or matrix organizations; how IT creates new organizational possibilities; examples of innovative organizational possibilities, such as democratic decision-making, crowd-based organizations, and other forms of collective intelligence. Team projects include inventing new possibilities for real organizations."}, "Improvisational Leadership: In-the-Moment Leadership Skills": {"title": "Improvisational Leadership: In-the-Moment Leadership Skills", "number": "15.321", "description": "Designed to provide a practical understanding of the skills of improvisation and their application to leadership. Examines the essential elements of successful leadership, including creativity, emotional intelligence, adaptability, and the capacity to develop effective influence strategies and build strong teams. Cultivates students' ability to respond to the unexpected with confidence and agility. Each class offers a highly experiential learning laboratory where students practice a wide variety of improvised business scenarios, interactive exercises, and simulations."}, "Practical leadership": {"title": "Practical leadership", "number": "15.324", "description": "Strengthens leadership capacities through reflection, practice and feedback. Students use readings, role plays, experiential exercises, self-reflection, and reviews of their own videos, as well as focused coaching and feedback, to optimize their own leadership capabilities. Focuses on individual leadership growth. Culminates with submission of a written summary of students' reflections and experiences around leadership from throughout the term."}, "Seminar in Leadership I": {"title": "Seminar in Leadership I", "number": "15.325", "description": "Provides students opportunities to meet senior executives of private and public institutions, and discuss key management issues from the perspective of top management. Students prepare detailed briefings identifying and analyzing important management issues facing these organizations. Restricted to MIT Sloan Fellows."}, "Seminar in Organizational Studies": {"title": "Seminar in Organizational Studies", "number": "15.329", "description": "Provides students opportunities to meet senior executives of private and public institutions, and discuss key management issues from the perspective of top management. Students prepare detailed briefings identifying and analyzing important management issues facing these organizations. Restricted to MIT Sloan Fellows."}, "Developing Leadership Capabilities": {"title": "Developing Leadership Capabilities", "number": "15.339", "description": "Focuses on the key leadership capabilities needed in today's increasingly decentralized organizations: sense-making, relating, visioning, and inventing. Through conceptual discussions, small group exercises, and self-reflection in a workshop setting, helps students understand leadership capabilities, evaluate their leadership strengths and weaknesses, articulate their values and aspirations, and practice developing leadership skills in interaction with class members."}, "Individuals, Groups, and Organizations": {"title": "Individuals, Groups, and Organizations", "number": "15.341", "description": "Covers classic and contemporary theories and research related to individuals, groups, and organizations.  Designed primarily for doctoral students in the Sloan School of Management who wish to familiarize themselves with research by psychologists, sociologists, and management scholars in the area commonly known as micro organizational behavior. Topics may include motivation, decision making, negotiation, power, influence, group dynamics, and leadership."}, "Organizations and Environments": {"title": "Organizations and Environments", "number": "15.342", "description": "Provides an introduction to research in \"organizations and environments,\" an interdisciplinary domain of inquiry drawing primarily from sociology, and secondarily from economics, psychology, and political science. Seeks to understand organizational processes and outcomes in the surrounding economic, cultural, and institutional context in which they are situated. Also provides an introduction to the main groups that together form the Behavioral Policy Sciences (BPS) area of MIT/Sloan, including economic sociology, organization studies, work and employment, strategic management, global management, and technology, innovation, and entrepreneurship. Consists of four modules taught by faculty from each of the four BPS groups, as well as integrative sessions taught by the main instructor. Preference to first-year doctoral students in BPS."}, "Managing Technological Innovation and Entrepreneurship": {"title": "Managing Technological Innovation and Entrepreneurship", "number": "15.350", "description": "Focuses on the challenges inherent in attempting to take advantage of both incremental innovation and more radical or breakthrough changes in products, processes and services. Highlights the importance of innovation to both new ventures and to large established firms and explores the organizational, economic and strategic problems that must be tackled to ensure innovation is a long term source of competitive advantage. Discussions and class presentations cover non- technical as well as technology-based innovation. Restricted to MIT Sloan Fellows in Innovation and Global Leadership."}, "Introduction to Making": {"title": "Introduction to Making", "number": "15.351[J]", "description": "Provides basic skills and knowledge with a set of core maker technologies that form a broad foundation for creating prototypes. Fosters an understanding of how to make the abstract concrete. Includes a large experiential component that builds skills in the various elements of making. Limited to 50 via lottery; application required."}, "Product and Service Development in the Internet Age": {"title": "Product and Service Development in the Internet Age", "number": "15.356", "description": "Explains both the theory behind novel innovation development methods, and how they can be profitably used in practice. Covers lead user searches, internet-based crowdsourcing, design by customers using innovation toolkits, and more. Includes visits from industry experts who present cases that illustrate the art required to implement each method."}, "Economics of Ideas, Innovation and Entrepreneurship": {"title": "Economics of Ideas, Innovation and Entrepreneurship", "number": "15.357", "description": "Advanced subject in the economics of technological change. Covers the micro-foundations of the knowledge production function (including the role of creativity and the impact of Science), the impact of institutions and strategic interaction on the commercialization of new technology, and the diffusion and welfare impact of ideas and technology. Includes a mixture and explicit comparisons of both theoretical and empirical research. Students should have adequate preparation in microeconomic theory and econometrics. Primarily for PhD students."}, "Software and Internet Entrepreneurship": {"title": "Software and Internet Entrepreneurship", "number": "15.358", "description": "Considers key strategic concepts, especially the distinction between being a product versus a services company, as well as a product versus a platform strategy. Reviews how software became a business (from early developments in services to the emergence of standardized products), and the transition to software as a service, and cloud computing. Studies critical techniques for managing sales and marketing, as well as product development and project management for software products. Examines how the business differs for various platforms - including new and traditional enterprise software, social media, internet video, and mobile competitors - as well as for entrepreneurs competing in these markets. Student teams help teach some weekly sessions and analyze emerging companies and sectors in team projects."}, "Innovation Engineering: Moving Ideas to Impact": {"title": "Innovation Engineering: Moving Ideas to Impact", "number": "15.359[J]", "description": "Designed for students to gain the perspective of a Chief Technology Officer of a start-up, large corporation, or a not-for-profit. Details the innovation process, from an idea's inception through impact in the economy, regardless of organizational setting. Explores how solutions are developed to become ready for broader market deployment. Includes testing and development of the problem-solution fit, probing of solutions for robustness, and testing of both technical and operational scaling of proposed solutions. Examines the human aspects of innovation, specifically issues of team building and readiness. Considers the broader system for innovation, including the role of key stakeholders in shaping its success in order to arrive at an impactful solution. Addresses intellectual property, the effect of regulations and social and cultural differences across varied global markets, and the personal skillset necessary to align and manage these issues."}, "Introduction to Technological Entrepreneurship": {"title": "Introduction to Technological Entrepreneurship", "number": "15.360", "description": "Provides an overview of entrepreneurial theory and practice for founding, developing and growing new enterprises, primarily but not exclusively focused on companies with a technological base. Weekly lectures and dinner discussion sessions by academic and practitioner faculty engaged in the MIT Entrepreneurship Program, supplemented by leaders of related MIT entrepreneurship activities, e.g., Trust Center for MIT Entrepreneurship, Technology Licensing Office, Deshpande Center, and Venture Mentoring Service, as well as successful entrepreneurs and venture capitalists. Includes student Open Mic presentations and discussion of new business ideas. Enrollment in  ES.580, Silicon Valley Study Tour, for the following spring term required. No listeners; restricted to students in Sloan Entrepreneurship and Innovation (E&I) MBA track."}, "Executing Strategy for Results": {"title": "Executing Strategy for Results", "number": "15.711", "description": "Condensed version of 15.361 that introduces a comprehensive framework to understand how leaders can execute strategy more effectively. Presents case studies of companies that excel at execution, and a series of practical tools that can be applied immediately to boost performance. Intended for owner-operators and managers in complex organizations (more than 200 employees, multiple functions or units), particularly those competing in volatile markets. Restricted to Executive MBA and Sloan Fellows students."}, "Strategic Decision Making in the Life Sciences": {"title": "Strategic Decision Making in the Life Sciences", "number": "15.363[J]", "description": "Surveys key strategic decisions faced by managers, investors and scientists at each stage in the value chain of the life science industry. Aims to develop students' ability to understand and effectively assess these strategic challenges. Focuses on the biotech sector, with additional examples from the pharmaceutical and medical device sectors. Includes case studies, analytical models, and detailed quantitative analysis. Intended for students interested in building a life science company or working in the sector as a manager, consultant, analyst, or investor. Provides analytical background to the industry for biological and biomedical scientists, engineers and physicians with an interest in understanding the commercial dynamics of the life sciences or the commercial potential of their research."}, "Regional Entrepreneurship Acceleration Leaders (REAL)": {"title": "Regional Entrepreneurship Acceleration Leaders (REAL)", "number": "15.3641", "description": "Aimed at students seeking an action-oriented understanding of innovation ecosystems, such as Silicon Valley, Greater Boston, Singapore, Lagos, and other sites across the globe. Provides a framework for analyzing these critical innovation economies. Outlines the design and delivery of policies and programs (e.g., hackathons, accelerators, prizes, tax policy, immigration policy) intended to accelerate innovation-driven entrepreneurship. Takes a stakeholder perspective to examine the role of large corporations, governments, universities, entrepreneurs, and risk capital providers in innovation-driven entrepreneurship. Focuses especially on ecosystem-based opportunities for corporate innovation and entrepreneurship. Meets with 15.364 when offered concurrently. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details."}, "Energy Ventures": {"title": "Energy Ventures", "number": "15.366", "description": "Project-based approach to innovation and venture creation in the energy sector. Explores how innovation and entrepreneurial concepts apply (or do not apply) to the significant opportunities in the industry. Working in teams, students create new ventures specifically for the energy sector. Lectures guide teams through key elements of their projects. Concurrent enrollment in 15.933 recommended."}, "Healthcare Ventures": {"title": "Healthcare Ventures", "number": "15.367[J]", "description": "Addresses healthcare entrepreneurship with an emphasis on startups bridging care re-design, digital health, medical devices, and high-tech. Includes prominent speakers and experts from key domains across medicine, pharma, med devices, regulatory, insurance, software, design thinking, entrepreneurship, and investing. Provides practical experiences in venture validation/creation through team-based work around themes. Illustrates best practices in identifying and validating health venture opportunities amid challenges of navigating healthcare complexity, team dynamics, and venture capital raising process. Intended for students from engineering, medicine, public health, and MBA programs. Video conference facilities provided to facilitate remote participation by Executive MBA and traveling students."}, "Disciplined Entrepreneurship Lab": {"title": "Disciplined Entrepreneurship Lab", "number": "15.368", "description": "Project-based course offering the opportunity to experience startup life in a low stakes environment while contributing strategic value to early-stage ventures. Students secure a startup project of their choice or work with a startup pre-selected by the action learning team. Startups represent a range of industries and, while concentrated in the Boston area, may also come from other parts of the US. Students cannot drop course once project commences."}, "Innovation Teams": {"title": "Innovation Teams", "number": "15.371[J]", "description": "Introduces skills and capabilities for systematic technical and functional exploration, opportunity discovery, market understanding, value economics, innovation scale-up, intellectual property, elements of technology commercialization at scale, and communicating/working for impact inside and outside home disciplines. Students work in multidisciplinary teams formed around MIT research breakthroughs, with extensive in-class coaching from faculty and guidance from lab members and select mentors. Demonstrates a structured approach to innovating in which everything is a variable and the product, technology, and opportunities for new ventures can be seen as an act of synthesis. Teams gather evidence that permits a fact-based iteration across multiple application domains, markets, functionalities, technologies, and products, leading to a recommendation that maps a space of opportunity and includes actionable next steps to evolve the market and technology. Applications, resumes, and a brief statement of interest are required prior to registration."}, "Experimental Innovation Lab": {"title": "Experimental Innovation Lab", "number": "15.372", "description": "Develops the skills needed to run randomized experiments (from design through analysis) in business settings in order to help firms innovate and shape their strategy. Provides foundational knowledge related to the basic structure of a good experiment, analysis methods, randomization, and reasons why even well-planned experiments may fail.  Working in small teams, students design, run, and present the results of randomized trials with partner companies. Application required."}, "Venture Engineering": {"title": "Venture Engineering", "number": "15.373[J]", "description": "Provides an integrated approach to the development and growth of new innovative ventures. Intended for students who seek to leverage their engineering and science background through innovation-driven entrepreneurship. Emphasizes the concept that innovation-driven entrepreneurs must make a set of interdependent choices under conditions of high uncertainty, and demonstrates that venture engineering involves reducing uncertainty through a structured process of experimental learning and staged commitments. Provides deep understanding of the core technical, customer, and strategic choices and challenges facing start-up innovators, and a synthetic framework for the development and implementation of ventures in dynamic environments."}, "Innovation-Driven Advantage": {"title": "Innovation-Driven Advantage", "number": "15.374", "description": "Challenges students to understand what it means for an organization to manage innovation. Subject has four parts: the sources of innovation (from the research lab, to local innovation ecosystems, to open innovation); motivating technical or and/creative professionals (incentives, structure, and culture); organizing the innovation process (from the study of product development processes to R&D portfolios to building an experimental capacity). The final segment emphasizes the connection between the management of innovation and competitive strategy. Restricted to MIT Sloan Fellows."}, "Development Ventures": {"title": "Development Ventures", "number": "15.375[J]", "description": "Seminar on founding, financing, and building entrepreneurial ventures in developing nations. Challenges students to craft enduring and economically viable solutions to the problems faced by these countries.  Cases illustrate examples of both successful and failed businesses, and the difficulties in deploying and diffusing products and services through entrepreneurial action.  Explores a range of established and emerging business models, as well as new business opportunities enabled by innovations emerging from MIT labs and beyond.  Students develop a business plan executive summary suitable for submission in the MIT $100K Entrepreneurship Competition's Accelerate Contest or MIT IDEAS."}, "Media Ventures": {"title": "Media Ventures", "number": "15.376[J]", "description": "Seminar surveys internal and external entrepreneurship, based on Media Lab technologies, to increase understanding of how digital innovations grow into societal change. Cases illustrate examples of both successful and failed businesses, as well as difficulties in deploying and diffusing products. Explores a range of business models and opportunities enabled by emerging Media Lab innovations. Students craft a business analysis for one of the featured technology innovations. Past analyses have become the basis for research publications, and new ventures.  Particular focus on big data, mobile, and the use of personal data."}, "Building an Entrepreneurial Venture: Advanced Tools and Techniques": {"title": "Building an Entrepreneurial Venture: Advanced Tools and Techniques", "number": "15.3781", "description": "Intensive, project-based subject intended for startup teams already working on building a new, high-impact venture. Applies advanced entrepreneurial techniques to build and iterate a venture in a time-compressed manner. Includes weekly coaching sessions with instructors and peers, as well as highly interactive and customized sessions that provide practical, in-depth coverage on key topics in entrepreneurship. Topics include venture creation, primary market research, product development, market adoption, team and culture, and scaling processes with constrained resources. Meets with 15.378 when offered concurrently. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details. Application required; consult instructor. No listeners."}, "Innovating for Impact": {"title": "Innovating for Impact", "number": "15.385", "description": "Provides a structured approach to innovation and entrepreneurship that creates business value while solving social and environmental problems. Covers physical domains of sustainability, e.g., waste, water, food, energy, and mobility, as well as social and human capital domains, such as health and education. Students work in teams to advance a new business concept by formulating the public problem, customer value proposition, business model design, impact measurement methodology, and funding strategy. Tools are applicable to the startup context or to new lines of business in existing enterprises."}, "Managing in Adversity": {"title": "Managing in Adversity", "number": "15.386", "description": "Develops the skills required for a CEO to deal with complex problems under highly adverse conditions. Cases and guest CEO speakers present real-life, high-adversity situations that students then deal with through role play. Focuses on how to quickly define issues, determine and evaluate options, and take critical and precipitous actions to address the situation. No listeners."}, "Entrepreneurial Sales": {"title": "Entrepreneurial Sales", "number": "15.387", "description": "Instruction provided in basics of technology sales - making a sales call, designing sales compensation plans, and hiring, managing, and firing sales representatives. Also discusses negotiating large sales transactions, managing international sales organizations, integrating sales teams in acquisitions, and selecting the best go to market model for a company. Considers what comprises a 'startup sales toolkit.'"}, "Global Entrepreneurship Lab": {"title": "Global Entrepreneurship Lab", "number": "15.389", "description": "Practical study of the climate for innovation and determinants of entrepreneurial success. Teams of students work with top management in one company to gain experience in running and building a new enterprise. Focuses primarily on start-ups operating in emerging markets. Restricted to graduate students."}, "New Enterprises": {"title": "New Enterprises", "number": "15.3901", "description": "Covers the process of identifying and quantifying market opportunities, then conceptualizing, planning, and starting a new, technology-based enterprise. Topics include opportunity assessment, the value proposition, the entrepreneur, legal issues, entrepreneurial ethics, the business plan, the founding team, seeking customers, and raising funds. Students develop detailed business plans for a start-up. Intended for students who want to start their own business, further develop an existing business, be a member of a management team in a new enterprise, or better understand the entrepreneur and the entrepreneurial process. Meets with 15.390 when offered concurrently. Students taking graduate version complete additional assignments."}, "Scaling Entrepreneurial Ventures": {"title": "Scaling Entrepreneurial Ventures", "number": "15.392", "description": "Surveys the personal, institutional and operational challenges involved in scaling an entrepreneurial venture. Discusses both effective and ineffective solutions. Addresses topics such as leadership, culture, operations, governance, and human resources. Includes case studies, site visits, movies, simulations and guest speakers. Application required."}, "The Nuts and Bolts of New Ventures": {"title": "The Nuts and Bolts of New Ventures", "number": "15.393", "description": "Designed to foster an understanding of how to start a new venture (for-profit and social/development). Details the process from an idea's inception to the development of a successful new venture to deliver products and services enabled by the idea. Explores customer identification, the business/economic models, financial projections, legal and operational issues, and financing alternatives and sources. All sessions taught by persons who have actually launched or have been involved in successful ventures."}, "Entrepreneurial Founding and Teams": {"title": "Entrepreneurial Founding and Teams", "number": "15.3941", "description": "Explores key organizational and strategic decisions in founding and building a new venture. Through a series of cases, readings, and activities, students examine the trade-offs and consequences of early founder decisions: whom to include in the founding team, how to allocate equity among co-founders, how to determine founder roles, how to hire and motivate early-employees, and whether to involve external investors. Aims to equip students with tools and frameworks to help them understand the implications of early decisions, and to build enduring resources that enable the venture to execute even if the original plan changes substantially. Meets with 15.394 when offered concurrently. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details."}, "Entrepreneurship Without Borders": {"title": "Entrepreneurship Without Borders", "number": "15.395", "description": "Examines opportunities and problems for entrepreneurs globally, including Europe, Latin America, and Asia. Covers linkages between the business environment, the institutional framework, and new venture creation. Special focus on blockchain technology.  In addition to discussing a range of global entrepreneurial situations, student groups pick one particular cluster on which to focus and to understand what further development would entail. Classroom interactions based primarily on case studies."}, "Corporations at the Crossroads: The CEO Perspective": {"title": "Corporations at the Crossroads: The CEO Perspective", "number": "15.398", "description": "Focuses on the role of the CEO and the need, as leader, to successfully navigate crossroads (often created by new technologies). Provides a unique opportunity for students to interact with some of the world's leading CEOs who are invited to participate in each class. The CEOs offer advice and answer questions related to topics such as the responsibilities of the CEO, corporate strategy, career learnings, and advice."}, "Entrepreneurship Lab": {"title": "Entrepreneurship Lab", "number": "15.3991", "description": "Project-based subject, in which teams of students from MIT and Harvard work with startups on problems of strategic importance to the venture. Popular sectors include software, hardware, robotics, clean technology, and life sciences. Meets with 15.399 when offered concurrently. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details. In addition to the regular MIT registration process, students should register at the subject website one month before start of term to facilitate formation of student teams and matching of teams with startup companies."}, "Managerial Finance": {"title": "Managerial Finance", "number": "15.401", "description": "Introduction to finance from the perspective of businesspeople and finance professionals.  Designed to build effective decision-making skills based on sound financial knowledge, focusing on areas such as day-to-day operational issues, launching a startup, or negotiating option bonuses.  Provides a firm grounding in the modern financial analysis underlying any decision, through three core themes: determining the value of a decision, deciding how to finance a project, and managing its risk.  Students also hone their ability to negotiate skillfully and speak intelligently about finance.  Meets with 15.417 when offered concurrently. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details."}, "Corporate Finance": {"title": "Corporate Finance", "number": "15.471[J]", "description": "Provides an introduction to the basic theoretical and empirical contributions in corporate finance. Exposes students to the key methodological tools in modern corporate finance. Covers capital structure, corporate governance, agency problems, incomplete financial contracting, the market for corporate control, product market corporate finance interactions, corporate reorganization and bankruptcy, banking, and other selected topics. Primarily for doctoral students in finance, economics, and accounting."}, "Introduction to the Practice of Finance": {"title": "Introduction to the Practice of Finance", "number": "15.403", "description": "Explores various elements of the finance industry, from private equity to public policy, FinTech to social impact, investment banking to investment management, corporate finance to venture capital. Students engage with industry professionals about the challenges they face and how their part of the industry is changing. They also network with peers to discover the challenges and rewards associated with various careers, and explore how coursework connects with industry practice. Restricted to first year MBA students in the Finance Track."}, "Financial Management": {"title": "Financial Management", "number": "15.724", "description": "Provides a rigorous introduction to corporate finance and capital markets, with an emphasis on applications vital to corporate managers. Exposes students to the major financial decisions made by leaders within a firm and to the ways the firm interacts with investors, with a focus on valuation. Topics include project and company valuation, measuring risk and return, stock pricing, corporate financing policy, the cost of capital, and risk management. Presents a broad overview of both theory and practice. Restricted to Executive MBA students."}, "Finance Theory": {"title": "Finance Theory", "number": "15.415", "description": "Core theory of capital markets and corporate finance. Topics include functions and operations of capital markets, analysis of consumption-investment decisions of investors, valuation theory, financial securities, risk analysis, portfolio theory, pricing models of risky assets, theory of efficient markets, as well as investment, financing and risk management decisions of firms. Provides a theoretical foundation of finance and its applications. Restricted to students in the Master of Finance Program."}, "Laboratory in Investments": {"title": "Laboratory in Investments", "number": "15.417", "description": "Provides a firm grounding in modern financial analysis: determining the value of a decision, deciding how to finance a project, and assessing its risk. Lab component introduces modern quantitative finance practices and methods used by investment managers. Through team projects, students develop and test asset-pricing models and investment strategies using real-world market data. Provides instruction in writing and speaking from a financial perspective."}, "Laboratory in Corporate Finance": {"title": "Laboratory in Corporate Finance", "number": "15.418", "description": "Provides instruction in the tools and techniques of corporate financial management, from the perspective of the CFO. Covers capital budgeting, investment decisions and valuation; working capital management, security issues; dividend policy; optimal capital structure; and real options analysis. Lab component puts theory into practice through hands-on projects - students either conduct an event study and analyze its impact on firm capital market value, or conduct a merger model between two firms of the their choosing. Emphasizes use of research databases to test hypotheses. Provides instruction in writing and speaking from a financial perspective. Meets with 15.402 when offered concurrently."}, "Real Estate Capital Markets": {"title": "Real Estate Capital Markets", "number": "15.427[J]", "description": "Introduces real estate capital markets for institutional investors. Topics include real estate investment trusts (REIT), commercial mortgage-backed securities (CMBS), and private equity. Concepts and techniques for investment analysis include portfolio theory and equilibrium asset pricing. Additional topics may include price indexing and derivatives.  Focuses primarily on aggregates of many properties: portfolios, firms, markets, industries.  Relates macro-level capital markets topics to micro-level bricks-and-mortar of real estate development projects in a direct and concrete manner."}, "Tools for Analysis:  Design for Real Estate and Infrastructure Development": {"title": "Tools for Analysis:  Design for Real Estate and Infrastructure Development", "number": "15.428[J]", "description": "Introduction to analytical tools to support design and decision-making in real estate, infrastructure development, and investment. Particular focus on identifying and valuing sources of flexibility using \"real options,\" Monte-Carlo simulation, and other techniques from the field of engineering systems. Integrates economic and engineering perspectives, and is suitable for students with various backgrounds. Provides useful preparation for thesis work in the area."}, "Securitization of Mortgages and Other Assets": {"title": "Securitization of Mortgages and Other Assets", "number": "15.429[J]", "description": "Investigates the economics and finance of securitization. Considers the basic mechanics of structuring deals for various asset-backed securities. Investigates the pricing of pooled assets, using Monte Carlo and other option pricing techniques, as well as various trading strategies used in these markets."}, "Entrepreneurial Finance and Venture Capital": {"title": "Entrepreneurial Finance and Venture Capital", "number": "15.4311", "description": "Examines the elements of entrepreneurial finance, focusing on technology-based start-up ventures, and the early stages of company development. Addresses key questions which challenge all entrepreneurs: how much money can and should be raised; when should it be raised and from whom; what is a reasonable valuation of a company; and how funding, employment contracts and exit decisions should be structured. Aims to prepare students for these decisions, both as entrepreneurs and venture capitalists. In-depth analysis of the structure of the private equity industry. Meets with 15.431 when offered concurrently. Expectations and evaluation criteria for graduate students will differ from those of undergraduates; consult syllabus or instructor for specific details."}, "Financial Markets": {"title": "Financial Markets", "number": "15.4331", "description": "Provides students with a solid understanding of key financial markets and the empirical skills and tools used to support decision making. Employs an in-depth, empirically-driven exploration of markets, including equity, fixed income, and derivatives.  Students apply real-world financial data to test and understand financial models, focusing on key risk factors and risk management concerns in these markets, along with the quantitative tools used to analyze risk. Discusses major institutions and players involved in each market, the evolution of the markets, and issues such as liquidity. Meets with 15.433 when offered concurrently. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details. Preference to Course 15 students."}, "Advanced Corporate Finance": {"title": "Advanced Corporate Finance", "number": "15.473[J]", "description": "This course builds on 15.471 and considers further topics that are at the frontier of corporate finance research. Topics covered include: structural estimation of corporate finance models, financial intermediation, corporate taxation, aggregate effects of financing frictions, corporate finance with irrational managers or irrational investors and entrepreneurial finance (young firm dynamics, venture capital and private equity). Primarily for doctoral students in finance, economics, and accounting."}, "Cases in Corporate Finance: Bridging Theory and Practice": {"title": "Cases in Corporate Finance: Bridging Theory and Practice", "number": "15.436", "description": "Focuses on components of decision-making in corporate finance, featuring cases that cover a broad range of advanced topics in corporate engineering, complex financings, and valuation.  Cases and class discussions strike a balance between technical tools and finance theories that factor into important decisions on the one hand, and the higher-level strategic perspective of investment bankers, CEOs, boards of directors and large investors on the other. Case examples include IPOs, convertible debt, rights offerings, tender offers, leveraged buyouts, share recapitalizations, project finance, off-balance sheet SPVs, and bankruptcy. Students work in study groups to complete regular homework assignments and prepare for class discussion. Recommended prerequisite: 15.434."}, "Options and Futures Markets": {"title": "Options and Futures Markets", "number": "15.4371", "description": "Develops economic intuition and technical skills, which increase understanding of how to use derivatives for investment and risk management purposes, and how to hedge and price them. Topics include determinants of forward and futures prices, hedging and synthetic asset creation with futures, uses of options in investment strategies, relation between puts and calls, option valuation using binomial trees and Monte Carlo simulation, implied binomial trees, advanced hedging techniques, exotic options, and applications to corporate securities and other financial instruments. Meets with 15.437 when offered concurrently. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details."}, "Fixed Income Securities and Derivatives": {"title": "Fixed Income Securities and Derivatives", "number": "15.438", "description": "Develops an overall familiarity with fixed income markets and instruments, and a sophisticated understanding of tools - for valuation, and for quantifying, hedging, and speculating on risk. Topics include duration; convexity; modern approaches to modeling the yield curve; interest rate forwards, futures, swaps and options; credit risk and credit derivatives; mortgages; securitization; and public policy and regulation.  15.437 strongly recommended."}, "Investment Management": {"title": "Investment Management", "number": "15.439", "description": "Focuses on implementing successful investment strategies - blending academic finance with the practice of investment management employed by the world's most sophisticated (quantitative) investors. Covers the dynamics of behavioral finance and their effects on markets; investment strategies in current use, and how to build and test your own quantitative strategies; portfolio construction and trading, considering transaction costs, risk management, and efficient trade execution; and current trends and regulatory changes. Includes guest lecturers. Requires an understanding of basic statistical and financial concepts."}, "International Corporate Finance": {"title": "International Corporate Finance", "number": "15.444", "description": "Addresses issues relating to valuation, risk management, financing and contractual design for firms operating in international markets, providing exposure to emerging markets. Students analyze how risk and cash flows should be evaluated in environments with varying levels of risk, such as currency fluctuation, sovereign default, weak property rights, etc. Discusses how certain types of risk can be eliminated or managed through the appropriate design of financial contracts, and how institutional differences across countries shape the structure and efficacy of private equity contracts. Other topics include firm policy and international tax regimes, microfinance, and valuing social return. Concludes with a discussion on the impact of global financial crises on firm financial policy."}, "Mergers, Acquisitions and Private Equity": {"title": "Mergers, Acquisitions and Private Equity", "number": "15.445", "description": "Uses case studies to explore the financial aspects of a wide range of corporate mergers and buyout transactions: classic stock and cash mergers; minority squeeze-outs; company sale process and auction design; hostile takeover law and strategy; the structuring, financing and valuation of leveraged buyouts; the structure, history and returns of private equity buyout funds; publicly traded private equity firms; and more. Includes guest lectures on the practices and tools used in private equity and M&A. Students participate in group work, both in and out of class, including a full-term project involving the mock sale of a company. Meets with 15.4451 when offered concurrently. Expectations and evaluation criteria for graduate students will differ from those of undergraduates; consult syllabus or instructor for specific details."}, "Mergers, Acquisitions, and Private Equity": {"title": "Mergers, Acquisitions, and Private Equity", "number": "15.4451", "description": "Uses case studies to explore the financial aspects of a wide range of corporate mergers and buyout transactions: classic stock and cash mergers; minority squeeze-outs; company sale process and auction design; hostile takeover law and strategy; the structuring, financing and valuation of leveraged buyouts; the structure, history and returns of private equity buyout funds; publicly traded private equity firms; and more. Includes guest lectures on the practices and tools used in private equity and M&A. Students participate in group work, both in and out of class, including a full-term project involving the mock sale of a company. Meets with 15.445 when offered concurrently. Expectations and evaluation criteria for graduate students will differ from those of undergraduates; consult syllabus or instructor for specific details."}, "International Capital Markets": {"title": "International Capital Markets", "number": "15.447", "description": "Provides a strategic framework for current and future finance leaders - with domestic or multinational startups, established companies, investment banks or asset management firms - for investing and operating in international capital markets.  Includes currency markets; measuring and managing exchange rate exposure; exchange rate determination and forecasting; international financial instruments and institutions; international trading strategies; and the dynamics of global financial crises.  Incorporates real-world events into interactive discussions."}, "Analytics of Finance": {"title": "Analytics of Finance", "number": "15.450", "description": "Increased data availability and complexity creates the need for finance professionals who can work with data and can separate insights from noise. Introduces a set of modern analytical tools that specifically target finance applications. Exposure to statistical inference; financial time series; event study analysis; basic machine learning techniques for forecasting and working with big data. Aims to build operational models, take them to the data, and use real world data to build models for financial and macro forecasting, quantitative trading, and dynamic risk management. Looks behind the curtain of some fintech innovations, such as Kensho's \"financial answer machine'' and big-data lending platforms. (Note: 15.457 is a more advanced version of 15.450. Students with solid background in statistics and proficient in programming are encouraged to take 15.457.)"}, "Proseminar in Capital Markets/Investment Management": {"title": "Proseminar in Capital Markets/Investment Management", "number": "15.451", "description": "Provides a unique opportunity to tackle original research problems in capital market analysis and investment management that have been posed by leading experts from the financial community. Students are assigned to teams, and each team is assigned one such problem. Teams present their solutions at a seminar which is attended by representatives of the sponsoring organization and open to the entire MIT community. Not open to students from other institutions."}, "Proseminar in Corporate Finance/Investment Banking": {"title": "Proseminar in Corporate Finance/Investment Banking", "number": "15.452", "description": "Action learning experience provides an opportunity to bring theory into practice by tackling problems provided by executives in corporate finance or investment banking. Students work in multi-disciplinary teams (combining MFin, MBA, and Sloan Fellows) to analyze and problem-solve, culminating in reports which the teams present in a group setting for evaluation and feedback. Tests and hones skills at capturing the core of a real-world finance problem and developing a creative and insightful solution that is sensitive to the full context. Students build key communication skills, presenting difficult concepts clearly, concisely, and persuasively. Not open to students from other institutions."}, "Finance Research Practicum": {"title": "Finance Research Practicum", "number": "15.453", "description": "Bridges theory and practice, providing students with an immersive research and analysis experience during IAP followed by a classroom segment in the first half of spring term. Students work with leading industry practitioners and a diverse cross-section of students on collaborative teams, focusing on topical, real-world finance research questions posed by the practitioners. Teams then deliver a nuanced analysis and report findings, gaining insight and coaching from the experts. Practitioners represent a range of financial institutions, including investment management, hedge funds, private equity, venture capital, risk, and consulting. Examples of project topics include equity and fixed income research, trading, risk analysis, venture capital valuation, private equity due diligence, and fundamental industry analysis. Application required; restricted to MIT students."}, "Advanced Mathematical Methods for Financial Engineering": {"title": "Advanced Mathematical Methods for Financial Engineering", "number": "15.455", "description": "Covers advanced mathematical topics essential for financial engineering and quantitative finance: linear algebra, optimization, probability, stochastic processes, statistics, and basic programming in R. Covers topics at a more advanced level and at a faster pace than 15.454. Restricted to students in the Master of Finance Program."}, "Financial Engineering": {"title": "Financial Engineering", "number": "15.456", "description": "Exposes students to the cutting edge of financial engineering.  Includes a deep immersion into 'how things work,' where students develop and test sophisticated computational models and solve highly complex financial problems.  Covers stochastic modeling, dynamic optimization, stochastic calculus and Monte Carlo simulation through topics such as dynamic asset pricing and investment management, market equilibrium and portfolio choice with frictions and constraints, and risk management.  Assumes solid undergraduate-level background in calculus, probability, statistics, and programming and includes a substantial coding component.  Students are encouraged but not required to use R for coursework."}, "Advanced Analytics of Finance": {"title": "Advanced Analytics of Finance", "number": "15.457", "description": "Introduces a set of modern analytical tools that specifically target finance applications. Provides exposure to statistical inference, financial time series, event study analysis, and basic machine learning techniques for forecasting and working with big data. Aims to build operational models, take them to the data, and use real world data to build models for financial and macro forecasting, quantitative trading, and dynamic risk management. In-depth exploration of fintech innovations, such as Kensho's \"financial answer machine'' and big-data lending platforms. 15.457 is a more advanced version of 15.450. Students with solid background in statistics and proficiency in programming are encouraged to register for 15.457."}, "Financial Data Science and Computing I": {"title": "Financial Data Science and Computing I", "number": "15.458", "description": "First in a two-course sequence that covers methods of managing and extracting information from financial data. Topics include the basics of statistical inference and hypothesis testing, regression models, and time series modeling applied to financial data. Studies major sources of financial data, raw data cleaning, data visualization and communication. Emphasizes computer implementations (in R) throughout."}, "Financial Data Science and Computing II": {"title": "Financial Data Science and Computing II", "number": "15.459", "description": "Building on 15.458, provides an overview of data technologies, financial data architecture and design, data management tools, web scraping, and how to work with \"Big Data\" and textual data. Students use R, SQL, Bloomberg, Access, Excel, and other tools to develop data-driven analysis and applications."}, "Functional and Strategic Finance": {"title": "Functional and Strategic Finance", "number": "15.466", "description": "Ideal for students pursuing careers in financial-services, banking, the public-sector (central banks, ministries of finance) and academics. Applies finance science and financial engineering tools and theory to the design and management of global financial institutions, markets, and the financial system to better understand the dynamics of institutional change and financial product/service design. Focuses on foundational analytical tools students will rely upon throughout their careers - derivative pricing and risk measurement; portfolio analysis and risk accounting; and performance measurement to analyze and implement concepts and new product ideas. Examines the needs of government as user, producer and overseer of the financial system, and how tools are applied to measure and manage risks in financial crises (e.g., 1973-1975 vs. 2007-2009). A high comfort level working through rigorous mathematical analyses is recommended. Preference to MBA and MFin students."}, "Asset Management, Lifecycle Investing, and Retirement Finance": {"title": "Asset Management, Lifecycle Investing, and Retirement Finance", "number": "15.467", "description": "Built for students focused on financial services careers - professional asset management, financial product design, trading, sales, consulting, or regulatory oversight of the financial industry. Applies finance science and financial engineering tools and theory to asset management, lifecycle investing, and retirement finance. Focuses on foundational analytical tools students will rely upon throughout their careers - derivative pricing and risk measurement, portfolio analysis and risk accounting, and performance measurement to analyze and implement concepts and new product ideas. Students should be familiar with basic portfolio-selection theory, CAPM, options, futures, swaps and other derivative securities. Preference to MBA and MFin students."}, "Asset Pricing": {"title": "Asset Pricing", "number": "15.470[J]", "description": "Provides a foundation in the neoclassical theory of finance that underlies more advanced study. Covers arbitrage asset pricing, optimal consumption-portfolio choices, neo-classic theory of corporate finance, static equilibrium models of asset pricing, asymmetric information, and dynamic modeling. Prepares students for further study of asset pricing theories, corporate finance and econometric work in finance. Primarily for doctoral students in finance, economics, and accounting."}, "Advanced Asset Pricing": {"title": "Advanced Asset Pricing", "number": "15.472[J]", "description": "Focuses on solution, evaluation, and estimation of theories of asset prices and financial markets and their macro- and micro-economic foundations. Discusses theory and econometric methods, the state of the literature, and recent developments. Covers topics such as cross-sectional and time-series models, consumption-based models, financial institutions, household finance, housing, behavioral finance, and financial crises. Students complete a term paper and presentation. Primarily for doctoral students in finance, economics, and accounting."}, "Current Topics in Finance": {"title": "Current Topics in Finance", "number": "15.474[J]", "description": "Covers a series of advanced topics in finance. Topics are selected at the discretion of the instructors, in line with their current research. Provides a rapid overview of the literature, an in-depth presentation of selected contributions, and a list of potential research topics. Primarily for doctoral students in accounting, economics, and finance."}, "Current Research in Financial Economics": {"title": "Current Research in Financial Economics", "number": "15.475[J]", "description": "Advanced seminar intended for PhD students in finance. Covers advanced topics ? methodological, theoretical, and empirical ? and focuses on training students to produce advanced research in finance. Critically reviews the contributions, method of analysis, and presentation of evidence of existing research through reading, presentation, and observation, with the goal of highlighting potential dissertation projects. Topics and papers vary by term, following the latest research in academia. Restricted to doctoral students."}, "Science and Business of Biotechnology": {"title": "Science and Business of Biotechnology", "number": "15.480[J]", "description": "Covers the new types of drugs and other therapeutics in current practice and under development, the financing and business structures of early-stage biotechnology companies, and the evaluation of their risk/reward profiles. Includes a series of live case studies with industry leaders of both established and emerging biotechnology companies as guest speakers, focusing on the underlying science and engineering as well as core financing and business issues. Students must possess a basic background in cellular and molecular biology."}, "Financial Market Dynamics and Human Behavior": {"title": "Financial Market Dynamics and Human Behavior", "number": "15.481[J]", "description": "Gives students a complete understanding of financial markets. Draws on the latest research in psychology, evolutionary biology, and artificial intelligence, as well as in financial economics, to provide new perspectives and insights into the role that human behavior plays in the business environment and the dynamics of financial markets and institutions. Incorporates practical applications from financial markets, the hedge fund industry, private equity, government regulation, and political economy. Students use ideas from this new perspective to formulate original hypotheses regarding real-world challenges involving investment and business strategies, risk management, financial crises, and corporate ethics."}, "Healthcare Finance": {"title": "Healthcare Finance", "number": "15.482", "description": "Financial tools and techniques may one day help unlock solutions to some of humanity's most significant healthcare challenges. Covers the role of finance in the healthcare industry; specifically, the application of novel financing methods and business structures to facilitate drug discovery, clinical development, and greater patient access to high-cost therapies. Topics include basic financial analysis for the life-sciences professional; risks and returns in the biotech and pharmaceutical industries; the mechanics of biotech startup financing; capital budgeting for pharmaceutical companies; and applications of financial engineering in modern healthcare investment strategies and institutions. Develops a systemic framework for problem-solving when daunting business issues stand in the way of progress in healthcare."}, "Consumer Finance: Markets, Product Design, and FinTech": {"title": "Consumer Finance: Markets, Product Design, and FinTech", "number": "15.483", "description": "Provides a solid understanding of consumer decision-making and how new products and services are developed, especially given the rapid pace of innovation and regulatory change, to help students succeed in consumer finance today. Covers rational and behavioral aspects of consumer financial decision making; current household financial products and competitive landscape in credit, investment, and advising markets; consumer financial product innovations and regulatory issues; securitization, and the development of financial products derived from consumer debt (e.g., mortgages, credit card receivables, and student loans).  A combination of case studies, guest speakers and group discussion provide real-world insight and interactivity, while special review sessions help hone technical skills."}, "Algorithmic Trading and Quantitative Investment Strategies": {"title": "Algorithmic Trading and Quantitative Investment Strategies", "number": "15.4871", "description": "Covers practical aspects of analytics in finance from the perspective of a quantitative investment manager. Develops understanding of stochastic processes, option pricing, investment strategies, backtest simulation, data and computational architecture, portfolio construction, trading implementation, and risk management within the context of specific quantitative trading strategies. Follows natural sequence of research, development, testing, and implementation. Emphasizes financial applications, but also covers mathematical and statistical techniques in some depth, along with their computational implementation in software and the use of real-world market data."}, "Practice of Finance: Advanced Corporate Risk Management": {"title": "Practice of Finance: Advanced Corporate Risk Management", "number": "15.491", "description": "Focuses on how corporations make use of the insights and tools of risk management. Taught from the perspective of potential end-users of derivatives (not the dealer), such as manufacturing corporations, utilities, and software firms. Topics include how companies manage risk, instruments for hedging, liability management and organization, and governance and control. 15.437 recommended."}, "Practice of Finance: Perspectives on Investment Management": {"title": "Practice of Finance: Perspectives on Investment Management", "number": "15.493", "description": "Provides an overview of the investment management industry and an introduction to business fundamentals and valuation. Students read company analyst reports, write papers analyzing various companies, and complete an in-depth company analysis as a final paper. Includes presentations by outside speakers in the investment management industry. Class attendance is mandatory."}, "Practice of Finance: Data Technologies for Quantitative Finance": {"title": "Practice of Finance: Data Technologies for Quantitative Finance", "number": "15.496", "description": "Introduces students to financial market data and to data architecture and design, with applications to asset pricing, quantitative investment strategies, algorithmic trading, portfolio management, and risk management. Studies how data relationships are structured and how to use modern tools and technologies to manipulate, manage, and analyze large-scale financial data sets. Uses real-world data, applications, and cases to illustrate principles and provide practical experience."}, "FinTech Ventures": {"title": "FinTech Ventures", "number": "15.497", "description": "Designed for entrepreneurial types interested in the FinTech space, this course presents a unique opportunity to work through the nuts and bolts of developing, investing in or acquiring a FinTech startup. Bring your idea and/or team, or find both at class and develop your plan for the final \"Demo Day\" in front of a group of investors. In each class a new speaker (entrepreneurs, legal experts, venture capitalists) is welcomed who addresses relevant topics, while students present progress reports and receive advice and feedback. Students with an interest in being part of a FinTech startup, regardless of background (legal, financial, computer science, operations, etc.) should apply, individually or as part of a team. JD students from Harvard Law School and technical students from MIT are encouraged to apply. Enrollment by application only."}, "Practice of Finance: Project Finance": {"title": "Practice of Finance: Project Finance", "number": "15.498", "description": "Project financings are highly structured tools that enable major infrastructure investments, from renewable energy projects to highways to oil field developments. Teams of students design cash flow payouts to achieve the objectives of different parties to a deal. Students will address the needs of creditors and guarantors, while achieving the equity investors' targeted return. Introduces students to the legal, tax and institutional details involved."}, "Practice of Finance: Social Impact Investing": {"title": "Practice of Finance: Social Impact Investing", "number": "15.499", "description": "Provides an introduction to social impact investing - an investment approach intentionally seeking to create both financial return and positive social impact that is actively measured. Aims to provide a solid analytical framework for evaluating the spectrum of social impact investments. Students will gain experience in structuring different types of investments, and critically compare and contrast these investments with traditional mainstream investments, with a view to understanding structural constraints."}, "Corporate Financial Accounting": {"title": "Corporate Financial Accounting", "number": "15.501", "description": "Preparation and analysis of financial statements. Focuses on why financial statements take the form they do, and how they can be used in evaluating corporate performance and solvency and in valuation of corporate securities. Introduces concepts from finance and economics (e.g., cash flow discounting and valuation) and explains their relation to, and use in, accounting. Students taking the graduate version complete additional assignments. Permission of Sloan Educational Services required for all cross-registrants."}, "Financial Accounting": {"title": "Financial Accounting", "number": "15.720", "description": "Examines the basic concepts of corporate financial accounting and reporting, and the role of accounting information in investment decisions, corporate and managerial performance assessment, and the valuation of firms. Develops skills for performing an economics-based analysis of accounting information from the viewpoint of the users of accounting information (especially senior managers), rather than the preparer (the accountant). Restricted to Executive MBA students."}, "Taxes and Business Strategy": {"title": "Taxes and Business Strategy", "number": "15.5181", "description": "Provides conceptual framework for thinking about taxation and decision-making. Topics include taxation of various investments and types of compensation; retirement planning; considerations for choosing organizational form when starting a business; methods of merging, acquiring, divesting business entities; international tax plan strategies; high wealth planning and estate tax. Applies current debates on tax policy options and recent tax law changes to class discussions. Intended to show how taxes affect the structure of deals, how to understand how firms strategically respond to taxes, and how to structure business and finance in a tax-advantaged manner. Meets with 15.518 when offered concurrently. Expectations and evaluation criteria for graduate students will differ from those of undergraduates; consult syllabus or instructor for specific details."}, "Security Design and Corporate Financing": {"title": "Security Design and Corporate Financing", "number": "15.522", "description": "Examines how corporations choose securities and markets to finance themselves. These are decisions which the firm must make after it has determined its financial policies including capital structure and dividend policy. Subject discusses recent trends in corporate financing including globalization, secularization, and transformation. Explores new securities and institutional factors, particularly tax and accounting factors that affect their design."}, "Business Analysis Using Financial Statements": {"title": "Business Analysis Using Financial Statements", "number": "15.535", "description": "Primary learning objective is the strategic, financial, and accounting analysis of a company's profitability and riskiness by means of financial statement data. A second, and related, learning objective is the valuation of a company using financial statement data. Concepts are applied to a number of decision making contexts, including securities analysis, credit analysis, merger analysis, and company performance assessment."}, "Information Technology Essentials": {"title": "Information Technology Essentials", "number": "15.561", "description": "Examines technology concepts and trends underlying current and future uses of information technology (IT) in business. Emphasis on networks and distributed computing, including the web. Other topics include hardware and operating systems, software development tools and processes, relational databases, security and cryptography, enterprise applications, and electronic commerce. Exposure to web, database, and graphical user interface (GUI) tools. Primarily for Sloan master's students with limited IT background."}, "IT Essentials II: Advanced Technologies for Digital Business in the Knowledge Economy": {"title": "IT Essentials II: Advanced Technologies for Digital Business in the Knowledge Economy", "number": "15.564", "description": "Technologies and concepts for next generation knowledge management and web e-business, including semantic web and web services. Business applications for use in the next two to seven years, including: e-commerce, marketing, finance, trust/security, health/biomedical, mobile. Strategic impacts and entrepreneurial opportunities. Core skills for identifying and evaluating technologies and their business potential, and for managing innovative IT-dependent projects. Overall emphasis on business process automation and e-services."}, "Digital Evolution: Managing Web 3.0": {"title": "Digital Evolution: Managing Web 3.0", "number": "15.565[J]", "description": "Examines the evolution from Web 2.0, with its emphasis on interactivity through online collaboration and sharing among users (primarily through social networking sites, wikis and communication tools), to Web 3.0, which focuses on high proactivity, transforming the Web into a database, and the leveraging of artificial intelligence technologies, such as the Semantic Web. Introduces Management 3.0 and the range of new Web technologies, applications, and business opportunities and challenges that it supports. Addresses topics such as big data, cloud computing, and cybersecurity. Includes case studies, industry and academic speakers, discussion of basic principles, and a team project."}, "The Economics of Information: Strategy, Structure and Pricing": {"title": "The Economics of Information: Strategy, Structure and Pricing", "number": "15.567", "description": "Analysis of the underlying economics of information with business implications. Studies effects of digitization and technology on business strategy and organizational structure. Examines pricing, bundling, and versioning of digital goods, including music, video, software, and communication services. Considers the economic and managerial implications of data-driven decision-making, search, platform competition, targeted advertising, personalization, privacy, network externalities, and artificial intelligence. Readings on fundamental economic principles provide context for industry speakers and case discussions."}, "Leadership Lab: Leading Sustainable Systems": {"title": "Leadership Lab: Leading Sustainable Systems", "number": "15.569", "description": "Addresses key sustainability challenges faced by business and society. Explores alternative ways to view organizations that draw attention to cross-boundary interdependencies and help leaders at all levels develop their capacity to collaborate for systemic change. Develops skills to help students surface and reflect on mental models and practices that keep organizations stuck in unproductive system dynamics. Weaves together theory, experiential practices, guest speakers, and action learning projects that enable teams of students to work with organizations on systemic change initiatives."}, "Digital Marketing and Social Media Analytics": {"title": "Digital Marketing and Social Media Analytics", "number": "15.570", "description": "Provides a detailed, applied perspective on the theory and practice of digital marketing and social media analytics in the age of big data. Covers concepts such as the difference between earned and paid media, predictive modeling for ad targeting and customer relationship management, measuring and managing product virality, viral product design, native advertising, and engaging the multichannel experience. Stresses the theory and practice of randomized experimentation, AB testing and the importance of causal inference for marketing strategy. Combines lectures, case studies, and guest speakers with relevant industry experience that speak directly to the topics at hand."}, "Enterprise Transformations in the Digital Economy": {"title": "Enterprise Transformations in the Digital Economy", "number": "15.571", "description": "Designed to help students understand how the digital economy forces companies to rethink their business strategies - and architect their processes, products, and information. Explores how firms use technology to create new value propositions and new organizational designs. Includes case studies about large enterprises using IT to transform how they do business; guest executives from those enterprises respond to student discussions. Student teams present to company executives the results of their debates on the options available for applying technology in ways that cut costs, enhance products, and engage customers."}, "Analytics Lab: Action Learning Seminar on Analytics, Machine Learning, and the Digital Economy": {"title": "Analytics Lab: Action Learning Seminar on Analytics, Machine Learning, and the Digital Economy", "number": "15.572", "description": "Student teams design and deliver a project based on the use of analytics, machine learning, large data sets, or other digital innovations to create or transform a business or other organization. Teams may be paired up with an organization or propose their own ideas and sites for the project.  Culminates with presentation of results to an audience that includes IT experts, entrepreneurs, and executives."}, "Economics of Information and Information Technology": {"title": "Economics of Information and Information Technology", "number": "15.575", "description": "Builds upon relevant economic theories and methodologies to analyze the changes in organizations and markets enabled by digital technologies. Examines information economics, labor economics, industrial organization and price theory, growth theory, intangible asset valuation, incomplete contracts theory, and design of empirical studies. Extensive reading and discussion of research literature explores the application of these theories to business issues with relevant guest speakers. Students will complete a final research paper and presentation. Primarily for doctoral students."}, "Research Seminar in Information Technology and Organizations: Social Perspectives": {"title": "Research Seminar in Information Technology and Organizations: Social Perspectives", "number": "15.576", "description": "Examines the assumptions, concepts, theories, and methodologies that inform research into the social aspects of technology. Extensive reading and discussion of research literature aimed at exploring the multiple social phenomena surrounding the development, implementation, use and implications of information technology in organizations. Primarily for doctoral students."}, "Workshop in Digitization": {"title": "Workshop in Digitization", "number": "15.599", "description": "Presentations by faculty, doctoral students, and guest speakers of ongoing research relating to current issues in digitization, technology and the changing economics of work, as well as discussions of key research papers in the field. Specific topics determined by the interest of participants and by new and important directions in digitization, information technology and information economics. Background readings, regular assignments and active participation by students expected. Preference to doctoral students."}, "Essential Law for Business": {"title": "Essential Law for Business", "number": "15.615", "description": "Provides a broad-gauged introduction to business law, including how law shapes business opportunities and risks. Imparts skills necessary for dealing effectively with law-sensitive aspects of company restructurings and mergers and acquisitions; contracts, complex deals, and financial instruments and facilities; innovation in business models, products, and services; and encounters with regulators. Also discusses individual and organizational accountability to private parties and public authorities, and key legal issues in career transitions."}, "Basic Business Law, Tilted Towards Key Emerging Issues": {"title": "Basic Business Law, Tilted Towards Key Emerging Issues", "number": "15.616", "description": "Broad-gauged introduction to business law designed to prepare managers to exercise judgment and leadership when confronting key law-sensitive issues of importance to their organizations and their own careers. Topics include contracts, liability, employment, changing jobs, intellectual property, business disputes, bankruptcy and reorganization, acquisitions, regulatory compliance, and corporate crime. The distinctive feature of 15.616 is an additional focus on newly-emerging, law-sensitive issues of key significance to business. Those topics vary from year to year; some recent examples include doing business in the BRIC nations, and the legal framework of social media."}, "Deals, Finance, and the Law": {"title": "Deals, Finance, and the Law", "number": "15.728", "description": "Addresses the challenges managers face in connection with two overlapping responsibilities: negotiating and managing complex deals, and arranging financing. Examines mergers and acquisitions and early-stage investments in young companies; commercial finance, financial instruments, and structured products; and how these relationships and structures play out in the context of financial distress. Emphasizes the opportunities and risks the different parties involved confront. Focuses primarily on the US, but also considers how key legal issues are analyzed in a transnational context. Restricted to Executive MBA and Sloan Fellows students."}, "Entrepreneurship, Innovation, Startups and the Law": {"title": "Entrepreneurship, Innovation, Startups and the Law", "number": "15.6181", "description": "The legal framework of entrepreneurship and innovation. Key law-sensitive junctures in launching and growing a startup: assembling a team, organizing a business entity, ownership and compensation, early financing, managing contracts and employees, business distress and winding down, and selling a company. Cutting-edge technologies and intellectual property rights. Designed for those who may start or work in such ventures; or are engaged in research with potential for commercial or social impact; or are otherwise attempting to advance an innovation from idea to impact. Meets with 15.6181 when offered concurrently. Expectations and evaluation criteria differ for students taking graduate version."}, "Patent Law Fundamentals": {"title": "Patent Law Fundamentals", "number": "15.620", "description": "Intensive introduction to the basic provisions of US patent law, emphasizing the requirements for patentability and the process of applying for a patent. Topics include requirements of utility, novelty, and non-obviousness; eligible subject matter; applying for a patent, including patent searches and the language of patent claims; infringement, defenses, and remedies; comparison of patents with other forms of intellectual property (copyrights, trade secrets, and trademarks). Reading materials include key sections of the US patent statute (Title 35, US Code) and related judicial decisions."}, "Law, Technology, and Public Policy": {"title": "Law, Technology, and Public Policy", "number": "15.655[J]", "description": "Examines the relationship between law and technological change, and the ways in which law, economics, and technological change shape public policy. Addresses how law can be used to influence and guide technological change; responses of the legal system to environmental, safety, social and ethical problems created by new or existing technology; how law and markets interact to limit or encourage technological development; and how law can affect distribution of wealth and social justice. Covers climate change; genetic engineering; telecommunications; industrial automation; the effect of health, safety, and environmental regulation on technological innovation; the impacts of intellectual property law on innovation and equity; pharmaceuticals; nanotechnology; cost/benefit analysis as a decision tool; public participation in governmental decisions affecting science and technology; corporate influence on technology; and law and economics as competing paradigms to encourage sustainability. Permission of instructor required for freshmen and sophomores."}, "Technology, Globalization, and Sustainable Development": {"title": "Technology, Globalization, and Sustainable Development", "number": "15.657[J]", "description": "Investigates sustainable development, taking a broad view to include not only a healthy economic base, but also a sound environment, stable employment, adequate purchasing power, distributional equity, national self-reliance, and maintenance of cultural integrity. Explores national, multinational, and international political and legal mechanisms to further sustainable development through transformation of the industrial state.   Addresses the importance of technological innovation and the financial crisis of 2008."}, "Strategic Human Resource Management": {"title": "Strategic Human Resource Management", "number": "15.660", "description": "Design and execution of human resource management strategies. Two central themes: How to think systematically and strategically about aspects of managing the organization's human assets, and what really needs to be done to implement these policies and to achieve competitive advantage. Adopts the perspective of a general manager and addresses human resource topics (including reward systems, performance management, high-performance human resource systems, training and development, recruitment, retention, equal employment opportunity laws, work-force diversity, and union-management relationships) from a strategic perspective."}, "Building Successful Careers and Organizations": {"title": "Building Successful Careers and Organizations", "number": "15.661", "description": "Designed to help students learn more about their strengths, and how they can utilize these strengths to manage their career. Draws on the latest research and practices, experiential exercises, and cases studies, and includes guest speakers. Covers the most important aspects of talent (and career) management."}, "Managing Sustainable Businesses for People and Profits": {"title": "Managing Sustainable Businesses for People and Profits", "number": "15.662[J]", "description": "Examines opportunities and challenges involved in building and growing businesses that achieve high financial performance and provide good jobs and  careers to employees. Students engage participants in the MITx online course title Shaping the Future of Work to learn about the expectations and employment experiences of workers across the world. Through readings, cases, simulations and class visits from industry leaders, explores the underlying principles and business practices that help to secure that alignment between business health and societal well-being."}, "Environmental Law, Policy, and Economics: Pollution Prevention and Control": {"title": "Environmental Law, Policy, and Economics: Pollution Prevention and Control", "number": "15.663[J]", "description": "Reviews and analyzes federal and state regulation of air and water pollution, hazardous waste, green-house gas emissions, and the production and use of toxic chemicals. Analyzes pollution as an economic problem and the failure of markets. Explores the role of science and economics in legal decisions. Emphasizes use of legal mechanisms and alternative approaches (such as economic incentives and voluntary approaches) to control pollution and encourage chemical accident and pollution prevention. Focuses on the major federal legislation, the underlying administrative system, and the common law in analyzing environmental policy, economic consequences, and the role of the courts. Discusses classical pollutants and toxic industrial chemicals, green-house gas emissions, community right-to-know, and environmental justice. Develops basic legal skills: how to read/understand cases, regulations, and statutes. Students taking graduate version are expected to explore the subject in greater depth."}, "Power and Negotiation": {"title": "Power and Negotiation", "number": "15.665", "description": "Provides understanding of the theory and processes of negotiation as practiced in a variety of settings. Designed for relevance to the broad spectrum of bargaining problems faced by the manager and professional. Allows students an opportunity to develop negotiation skills experientially and to understand negotiation in useful analytical frameworks. Emphasizes simulations, exercises, role playing, and cases."}, "Negotiation and Conflict Management": {"title": "Negotiation and Conflict Management", "number": "15.667", "description": "Applies negotiation theory strategies and styles to problems managers and professionals commonly encounter in the workplace. Emphasizes sources of power in negotiation, self-assessment of personal negotiating strengths/weaknesses, and practice in negotiations via role-plays and simulations of common workplace conflicts. Covers conflict management as a direct party and as a manager helping others resolve their conflicts through mediation, investigation, arbitration, and helping the system itself to change as a result of a dispute. Special cases include bullying, harassment, dealing with difficult people, cross-cultural negotiations, and collective actions."}, "People and Organizations": {"title": "People and Organizations", "number": "15.668", "description": "Examines the historical evolution and current human and organizational contexts in which scientists, engineers and other professionals work. Outlines major challenges facing the management profession. Uses interactive exercises, simulations and problems to develop critical skills in negotiations, teamwork, and leadership. Focuses on practical application of these skills in a professional context. Introduces concepts and tools to analyze work and leadership experiences in internships, school activities, and fieldwork. Preference to Management minors and other undergraduates not majoring in Management Science."}, "Strategies for People Analytics": {"title": "Strategies for People Analytics", "number": "15.669", "description": "Focuses on the strategies used to successfully design and implement people analytics in one's organization. Draws on the latest company practices, research projects, and case studies - all with the goal of helping students deepen their understanding of how people analytics can be applied in the real world. Covers the most important aspects of human resource management and people analytics. Demonstrates how to apply those basic tools and principles when hiring, evaluating and rewarding performance, managing careers, and implementing organizational change."}, "U-Lab: Transforming Self, Business and Society": {"title": "U-Lab: Transforming Self, Business and Society", "number": "15.671", "description": "Experiential opportunity to practice new leadership skills, such as deep listening, being present (mindfulness), and generative dialogue. In weekly coaching circles, each student has one full session to present their current leadership edge and receive feedback from peer coaches. Includes an additional action learning project."}, "Negotiation Analysis": {"title": "Negotiation Analysis", "number": "15.6731", "description": "Presents analytical frameworks and strategies to handle a variety of negotiation situations. Includes simulations, games, videos, lectures, discussion, and multiple opportunities to practice and hone negotiation, communication, and influence skills with extensive personalized feedback. Intended for students with a broad spectrum of backgrounds and experience levels. Six-unit version includes additional class time and outside work. Expectations and evaluation criteria differ for students taking graduate version. Limited to 80 via lottery; consult class website for information and deadlines."}, "Leading Creative Teams": {"title": "Leading Creative Teams", "number": "15.674[J]", "description": "Prepares students to lead teams charged with developing creative solutions in engineering and technical environments. Grounded in research but practical in focus, equips students with leadership competencies such as building self-awareness, motivating and developing others, creative problem solving, influencing without authority, managing conflict, and communicating effectively. Teamwork skills include how to convene, launch, and develop various types of teams, including project teams. Learning methods emphasize personalized and professional skill development."}, "Negotiation Seminar": {"title": "Negotiation Seminar", "number": "15.675", "description": "Provides understanding of the theory and processes of negotiation as practiced in a variety of settings. Designed for relevance to the broad spectrum of bargaining problems faced by the manager and professional. Allows students an opportunity to develop negotiation skills experientially and to understand negotiation in useful analytical frameworks. Emphasizes simulations, exercises, role playing, and cases.  Restricted to Sloan Fellows."}, "Work, Employment, and Industrial Relations Theory": {"title": "Work, Employment, and Industrial Relations Theory", "number": "15.676", "description": "Historical evolution and assessment of different theories and disciplinary perspectives used in research on work, employment, and industrial relations. Introduces doctoral students to the field and explores where their research interests fit within the broader field. First part compares the normative assumptions, theories, and methodologies used by economists, historians, sociologists, psychologists, political scientists, and legal scholars from the latter nineteenth century to the present. Final portion explores strategies for advancing research on topics of current interest to participants."}, "Machine Learning: Algorithms, Applications, and Computation": {"title": "Machine Learning: Algorithms, Applications, and Computation", "number": "15.680", "description": "Develops key algorithms for machine learning with emphasis on data, applications, and computation. Includes regression,  classification, support vector machines, unsupervised learning, algorithms for missing data, principal component analysis, sparse recovery, factor analysis, robustness, deep learning, and reinforcement learning. Restricted to Master of Business Analytics and LGO students."}, "Leadership and Integrative Management": {"title": "Leadership and Integrative Management", "number": "15.700", "description": "Investigates the different perspectives a general manager must take, how to integrate those perspectives, and the role of leadership in setting and realizing goals. Students work intensively in teams and with multiple faculty, using a deep dive into the challenges faced by a major global firm operating in complex global markets. Restricted to Executive MBA students."}, "Innovation-Driven Entrepreneurial Advantage": {"title": "Innovation-Driven Entrepreneurial Advantage", "number": "15.701", "description": "Exposes students to the content, context, and contacts that enable entrepreneurs to design and launch successful stand-alone ventures, ventures inside established corporations, and ventures in partnership with established corporations based on new innovations. Students examine the critical entrepreneurial and innovation challenges facing entrepreneurs inside new and established firms, and develop frameworks that allow them to identify, evaluate, iterate, and integrate their ideas effectively. Case-based discussions complemented by visits to key actors in MIT labs, as well as live case studies with successful entrepreneurs. Specially designed team projects provide practical experience in entrepreneurial strategy, innovation management, and the workings of the MIT entrepreneurial ecosystem. Restricted to Executive MBA students."}, "Leading in a Global Context: Macroeconomics and Global Markets": {"title": "Leading in a Global Context: Macroeconomics and Global Markets", "number": "15.702", "description": "Intensive module on the global economy, combining the key perspectives of macroeconomics and global economic strategy. Focuses on the policy and economic environment of firms, as well as on the development of a more international market in products, services, and capital, and how this affects trade and industries. Presents insights into national economic strategies for development, and into the evolving rules and institutions governing the international economic order. Develops an actionable appreciation for managers of the international dimensions of economic policy and strategy in an increasingly complex world economy. Restricted to Executive MBA students."}, "Leading with Impact": {"title": "Leading with Impact", "number": "15.703", "description": "Student teams work with the leadership of local not-for-profits to solve a pressing problem faced by that organization. The problems will vary with the organization in question, as will the skills and capabilities students draw on to appropriately address them. Culminates with group reflection on what it means to be a principled innovative leader who improves the world."}, "Organizations Lab": {"title": "Organizations Lab", "number": "15.705", "description": "Preparation for an organizational change project. Emphasis on applying tools of organizational, operational, and systems analysis in order to effect change. Includes a focus on the challenges and opportunities presented by issues of leadership and organizational behavior. Each student leads a change project in his or her own organization, focusing on fixing a broken or ineffective process. Examples of possible initiatives include a strategic reorientation, organizational restructuring, introduction of a new technology, a worker participation program, etc. Restricted to Executive MBA students."}, "Global Strategy": {"title": "Global Strategy", "number": "15.707", "description": "Provides students with the evidence, concepts and models for understanding company performance in a global world and the issues facing executives in the early 21st century. Prepares students to manage effectively in todays interconnected world by understanding this changing environment, principles of global strategy, and the relation between global strategy and organization.  Focuses on the specificities of strategy and organization of the multinational company. Restricted to Executive MBA students."}, "Global Organizations Lab": {"title": "Global Organizations Lab", "number": "15.708", "description": "Helps students discover and develop new and effective ways of managing and working together across national borders; also helps accelerate development of the context awareness and integrative management skills needed to lead in a globalized world. Involves intensive team engagement with a firm where students integrate their understanding of the relevant global and national economic and institutional contexts, industry dynamics, the firm's strategic position and capabilities, and its management organization and processes to provide the management sponsor with insight and effective recommendations. Includes a week-long site visit for research. Restricted to Executive MBA students."}, "Key Decisions for Corporate Boards": {"title": "Key Decisions for Corporate Boards", "number": "15.709", "description": "Designed to help students understand the fundamental rules and practices of corporate boards in three key areas: the audit committee, the compensation committee, and corporate takeovers. Includes discussion related to case studies, with short lectures at the start and end of each session to highlight the differences and similarities in practices by boards in the US and abroad. Restricted to MIT Executive MBA and Sloan Fellows students."}, "Negotiation and Influence": {"title": "Negotiation and Influence", "number": "15.712", "description": "Provides understanding of the theory and processes of negotiation as practiced in a variety of settings. Designed for relevance to the broad spectrum of bargaining problems faced by the manager and professional. Allows students an opportunity to develop negotiation skills experientially and to understand negotiation in useful analytical frameworks. Emphasizes simulations, exercises, role playing, and cases. Restricted to Executive MBA students."}, "Principles of Fundamental Analysis": {"title": "Principles of Fundamental Analysis", "number": "15.713", "description": "Defines the role of general managers in the capital markets system and highlights their interactions with such players as equity research analysts, investment bankers, and consultants as they seek to create value by increasing the company's intrinsic value. Covers basic and more advanced topics in finance and financial reporting from a high-level, practical standpoint. Restricted to MIT Executive MBA and Sloan Fellows students."}, "Competitive Strategy": {"title": "Competitive Strategy", "number": "15.9001", "description": "Explores a wide range of strategic problems, focusing particularly on the sources of competitive advantage and the interaction between industry structure and organizational capabilities. Introduces a wide variety of modern strategy frameworks and methodologies. Builds upon and integrates material from core topics, such as economics and organizational processes. Meets with 15.900 when offered concurrently. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details."}, "Entrepreneurial Strategy": {"title": "Entrepreneurial Strategy", "number": "15.911", "description": "Provides a deep understanding of the core strategic choices facing start-up innovators, as well as a synthetic framework for the development and implementation of entrepreneurial strategy in dynamic environments. Identifies the key choices entrepreneurs make to take advantage of opportunity and the logic of particular strategic commitments that allow entrepreneurs to establish competitive advantage."}, "Leading Organizations": {"title": "Leading Organizations", "number": "15.716", "description": "Promotes awareness of and strategies to meet the key challenges leaders face today (and tomorrow). Acquaints students with some of the psychological and sociological dynamics that regularly operate in organizational settings - the less visible but quite powerful \"forces\" that shape the way employees and managers respond (or don't respond) to a changing world. Restricted to Executive MBA students."}, "Entrepreneurial Finance": {"title": "Entrepreneurial Finance", "number": "15.719", "description": "Addresses key questions that are central to the funding and growth of high-tech start-up firms, such as how to value entrepreneurial firms using different valuation methods, and how to negotiate investor term sheets and convertible notes. Discusses the trade-off between different exit options for start-up firms. Aims to prepare students for these decisions from the perspective of entrepreneurs and venture capitalists. Restricted to MIT Executive MBA and Sloan Fellows students."}, "Advanced Applied Macroeconomics and International Institutions": {"title": "Advanced Applied Macroeconomics and International Institutions", "number": "15.723", "description": "Topics draw on current macroeconomic issues and events, such as modern monetary and fiscal policy; financial crisis, contagion, and currency crisis; real exchange rates, purchasing power parity, and long run sustainability; sustainable development; targeting and the new monetary policy regime; and Europe and the Euro: optimal currency areas. Restricted to Executive MBA students."}, "Marketing Strategy for General Managers": {"title": "Marketing Strategy for General Managers", "number": "15.725", "description": "Helps students consider the entire marketing mix in light of the strategy of the firm. Reviews customer-based sources of competitive advantage and discusses how to identify, measure, and leverage them. Introduces a method for comparing alternative selling formats (e.g., brick and mortar vs. electronic), aiming to find the most efficient ways to sell different products to different customers. Discusses the myriad ways in which the firm can grow its sources of competitive advantage. Provides practical experience in using tools to identify, evaluate, and develop marketing strategies; design efficient products and selling formats; and plan the use and development of the firm's portfolio of resources. Restricted to Executive MBA and Sloan Fellows students."}, "Pricing": {"title": "Pricing", "number": "15.726", "description": "Focuses on practical pricing tactics. Presents a framework for the steps firms should take when thinking about pricing a new product or improving the pricing performance of an old product. Tools covered include monadic pricing surveys, empirical price elasticity calculations, and conjoint. Restricted to Executive MBA students."}, "Risk Management": {"title": "Risk Management", "number": "15.731", "description": "Provides several core analytical and management concepts, helping students identify, model, think about, analyze, and manage risk. Topics vary; examples include risk measures, the drivers-event-outcomes framework, low-probability high-impact risk events, hedging risk with financial options, real options, risk management in the supply chain, project risk management, modern portfolio management, systemic risk. Restricted to Executive MBA and Sloan Fellows students."}, "Marketing Management": {"title": "Marketing Management", "number": "15.732", "description": "Studies the application of a reasoned framework to the selection of target markets and the optimization of marketing decisions. Subject is divided into two parts: a tactical portion that reviews how firms optimize profits in their chosen markets, and a strategic portion that focuses on identifying target markets. Tactical topics include pricing, promotion, channel and product issues. Restricted to Executive MBA students."}, "Introduction to Operations Management": {"title": "Introduction to Operations Management", "number": "15.778", "description": "Integrated approach to the analysis, design and management of supply networks for products and services. Provides a framework for analysis, design and operation of supply chains (SCs) that relies on fundamental concepts, such as the management of inventory, and operations and logistics planning. Discusses the value of (timely) information and of the need for collaboration and coordination between SC players. Also presents conceptual frameworks that focus on the emergence of a wide range of enabling services that are critical to the survival and growth of this class of system. Includes study and discussion of concepts, examples, and case studies from a wide range of industries. Guest speakers present personal experiences on various aspects of the service industry and supply chains. Restricted to MIT Sloan Fellows in Innovation and Global Leadership."}, "Product Design": {"title": "Product Design", "number": "15.735", "description": "Presents the modern methods of product development using a systematic innovation approach. Topics include opportunity identification, design thinking, product strategy, identifying customer needs, creativity, concept development, product architecture, industrial design, and green design practice. Restricted to Executive MBA and Sloan Fellows students."}, "Introduction to System Dynamics": {"title": "Introduction to System Dynamics", "number": "15.736", "description": "Introduces system dynamics modeling for the analysis of business policy and strategy. Provides the skills to visualize an organization in terms of the structures and policies that create dynamics and regulate performance. Uses causal mapping, simulation models, case studies, and management flight simulators to help develop principles of policy design for successful management of complex strategies. Considers the use of systems thinking to promote effective organizational learning. Restricted to Executive MBA students."}, "Advanced System Dynamics": {"title": "Advanced System Dynamics", "number": "15.737", "description": "Workshops focus on two models: the dynamics of service quality within a firm; and industry dynamics (particularly investment cycles and bubbles), including the energy and housing markets. Emphasis on formulation, analysis, use, and decision-making. Develops modeling skills. Restricted to Executive MBA and Sloan Fellows students."}, "Topics in Corporate Finance": {"title": "Topics in Corporate Finance", "number": "15.738", "description": "Case studies and lectures introduce financial tools needed to make value-enhancing business decisions. Topics drawn from issues such as advanced valuation analysis, capital structure decisions, debt restructuring, bankruptcy, incentive problems, real options, and valuation of international projects. Restricted to Executive MBA and Sloan Fellows students."}, "Strategic Communication for Executives": {"title": "Strategic Communication for Executives", "number": "15.740", "description": "Develops communication skills crucial to successful management.  Focuses on identifying a range of communication styles, and recognizing how to use them; dealing successfully with challenging or hostile audiences; understanding cross-cultural and global communication issues and differences; and leading and communicating in a crisis situation. Restricted to Executive MBA and Sloan Fellows students."}, "Supply Chain Planning": {"title": "Supply Chain Planning", "number": "15.762[J]", "description": "Focuses on effective supply chain strategies for companies that operate globally, with emphasis on how to plan and integrate supply chain components into a coordinated system.  Students are exposed to concepts and models important in supply chain planning with emphasis on key tradeoffs and phenomena. Introduces and utilizes key tactics such as risk pooling and inventory placement, integrated planning and collaboration, and information sharing. Lectures, computer exercises, and case discussions introduce various models and methods for supply chain analysis and optimization. Recommended for Operations Management concentrators. First half-term subject."}, "Manufacturing System and Supply Chain Design": {"title": "Manufacturing System and Supply Chain Design", "number": "15.763[J]", "description": "Focuses on decision making for system design, as it arises in manufacturing systems and supply chains. Students exposed to frameworks and models for structuring the key issues and trade-offs. Presents and discusses new opportunities, issues and concepts introduced by the internet and e-commerce. Introduces various models, methods and software tools for logistics network design, capacity planning and flexibility, make-buy, and integration with product development. Industry applications and cases illustrate concepts and challenges.  Recommended for Operations Management concentrators. Second half-term subject."}, "The Theory of Operations Management": {"title": "The Theory of Operations Management", "number": "15.764[J]", "description": "Provides mathematical foundations underlying the theory of operations management. Covers both classic and state-of-the-art results in various application domains, including inventory management, supply chain management and logistics, behavioral operations, healthcare management, service industries, pricing and revenue management, and auctions. Studies a wide range of mathematical and analytical techniques, such as dynamic programming, stochastic orders, principal-agent models and contract design, behavioral and experimental economics, algorithms and approximations, data-driven and learning models, and mechanism design. Also provides practical experience in how to apply the theoretical models to solve OM problems in business settings. Specific topics vary from year to year."}, "Global Supply Chain Management": {"title": "Global Supply Chain Management", "number": "15.765[J]", "description": "Focuses on the planning, processes, and activities of supply chain management for companies involved in international commerce. Students examine the end-to-end processes and operational challenges in managing global supply chains, such as the basics of global trade, international transportation, duty, taxes, trade finance and hedging, currency issues, outsourcing, cultural differences, risks and security, and green supply chains issues. Highly interactive format features student-led discussions, staged debates, and a mock trial. Includes assignments on case studies and sourcing analysis, as well as projects and a final exam."}, "Healthcare Lab: Introduction to Healthcare Delivery in the United States": {"title": "Healthcare Lab: Introduction to Healthcare Delivery in the United States", "number": "15.777", "description": "Focuses on the current business challenges and opportunities to deliver high quality and reasonably priced health services.   Provides students the opportunity to interact with speakers and many senior executives from the health industry.  Topics include healthcare reform, systematic scheduling, retail clinics, telehealth, entrepreneurship, community health, etc.  Discussions include practical examples from the ongoing healthcare-related work of Sloan faculty and projects with local hospitals. Provides a broad perspective on various career paths, such as consulting, entrepreneurship, hospital management, and IT innovation. Student teams work directly with a health organization on an applied project, which includes onsite work during SIP week.  Students who choose our international projects or projects out of the Boston area will do their onsite project (register for 15.777) during IAP with permission of the instructor and organization; consult instructors for information. Meets with 15.767 when offered concurrently."}, "Management of Services: Concepts, Design, and Delivery": {"title": "Management of Services: Concepts, Design, and Delivery", "number": "15.768", "description": "Explores the use of operations tools and perspectives in the service sector, including both for-profit and not-for-profit organizations.  Builds on conceptual frameworks and cases from a wide range of service operations, selected from health care, hospitality, internet services, supply chain, transportation, retailing, food service, entertainment, financial services, humanitarian services, government services, and others."}, "Operations Strategy": {"title": "Operations Strategy", "number": "15.769", "description": "Provides unifying framework for analyzing strategic issues in manufacturing and service operations. Covers decisions in technology, facilities, vertical integration, human resources and other strategic areas. Explores means of competition, such as cost, quality, speed, innovativeness, and how operations companies address growth. Presents students with an approach to make operations decisions in the era of outsourcing and globalization."}, "Logistics Systems": {"title": "Logistics Systems", "number": "15.770[J]", "description": "Provides an introduction to supply chain management from both analytical and practical perspectives. Taking a unified approach, students develop a framework for making intelligent decisions within the supply chain. Covers key logistics functions, such as demand planning, procurement, inventory theory and control, transportation planning and execution, reverse logistics, and flexible contracting. Explores concepts such as postponement, portfolio management, and dual sourcing. Emphasizes skills necessary to recognize and manage risk, analyze various tradeoffs, and model logistics systems."}, "D-Lab: Supply Chains": {"title": "D-Lab: Supply Chains", "number": "15.772[J]", "description": "Introduces concepts of supply chain design and planning with a focus on supply chains for products destined to improve quality of life in developing countries. Topics include demand estimation, process analysis and improvement, facility location and capacity planning, inventory management, and supply chain coordination. Also covers issues specific to emerging markets, such as sustainable supply chains, choice of distribution channels, and how to account for the value-adding role of a supply chain. Students conduct D-Lab-based projects on supply chain design or improvement."}, "The Analytics of Operations Management": {"title": "The Analytics of Operations Management", "number": "15.774", "description": "Introduces core concepts and methods in data-driven modeling that inform and optimize decisions under uncertainty. Teaches modeling and computational skills (R and Julia). Covers topics such as time series forecasting, choice modeling, queuing theory, network models, dynamic programming, mixed-integer programming, stochastic optimization, matching algorithms, multi-armed bandits. Draws on real-world applications from retail, healthcare, logistics, supply chain, social and online networks, sports analytics, social applications, and online learning."}, "Analytics Proseminar": {"title": "Analytics Proseminar", "number": "15.775", "description": "Provides opportunities to meet senior executives serving in top analytics and data science functions within a variety of organizations across industries. Discusses key business analytics issues from the perspective of top management. Students prepare detailed briefings identifying and exploring important analytics issues facing these organizations. May include a field trip to a domestic location."}, "Technology, Design and Entrepreneurship: Operating in Emerging Communities": {"title": "Technology, Design and Entrepreneurship: Operating in Emerging Communities", "number": "15.781", "description": "Designed for students working on solutions for resource-constrained communities. Examines downstream issues surrounding the adoption, distribution, and scaling (via business, non-profit, or public policy channels) of new solutions in an international development context. Focuses on implementing solutions as well as understanding the impact of interventions proposed. Restricted to Tata Fellows."}, "Stochastic Models in Business Analytics": {"title": "Stochastic Models in Business Analytics", "number": "15.780", "description": "Introduces core concepts in data-driven stochastic modeling that inform and optimize business decisions under uncertainty. Covers stochastic models and frameworks, such as queuing theory, time series forecasting, network models, dynamic programming, and stochastic optimization. Draws on real-world applications, with several examples from retail, healthcare, logistics, supply chain, social and online networks, and sports analytics."}, "Product Design and Development": {"title": "Product Design and Development", "number": "15.783[J]", "description": "Covers modern tools and methods for product design and development. Includes a cornerstone project in which teams conceive, design and prototype a physical product and/or service. Covers design thinking, product planning, identifying customer needs, concept generation, product architecture, industrial design, concept design, green design methods, and product management. Sloan students register via Sloan course bidding. Engineering students accepted via lottery based on WebSIS pre-registration."}, "Operations Laboratory": {"title": "Operations Laboratory", "number": "15.784", "description": "Provides an interactive learning experience in implementing operations improvement and an opportunity to work on challenging operations problems across industries in the Boston-area, across the United States, and abroad. Teams of 3-5 students use their training and experience to help improve operations in organizations that range from small and medium businesses to multi-national corporations. Teams conduct term-long projects via remote interactions with companies, and travel to work on-site at the client company during the Sloan Innovation Period. Boston-area projects involve periodic visits throughout the term."}, "Digital Product Management": {"title": "Digital Product Management", "number": "15.785", "description": "Introduction to product management with an emphasis on its role within technology-driven enterprises. Topics include opportunity discovery, product-technology roadmapping, product development processes, go-to-market strategies, product launch, lifecycle management, and the central role of the product manager in each activity. Exercises and assignments utilize common digital tools, such as storyboarding, wireframe mock-ups, and A/B testing. Intended for students seeking a role in a product management team or to contribute to product management in a new enterprise."}, "Research Project in Operations": {"title": "Research Project in Operations", "number": "15.794", "description": "Designed for Leaders for Global Operations (LGO) students in conjunction with on-site projects at LGO partner companies. Student teams work on faculty-supervised thesis research projects that deal with a specific aspect of operations. Students required to summarize their work in the context of understanding organization, leadership, teamwork, and task management in conjunction with 15.317."}, "Behavioral Decision Theories and Applications": {"title": "Behavioral Decision Theories and Applications", "number": "15.795", "description": "Introduces fundamental behavioral theories of human decision making and demonstrates how they impact the design of management strategies and policies. Topics include prospect theory, reference-dependence preferences, loss aversion, ambiguity aversion, regret, inter-temporal preferences, social preferences, cognitive hierarchy, bounded rationality, and adaptive learning. Studies these concepts in a wide range of applications, including pricing, supply chain management, social welfare, marketing, contract design, sustainability, and e-commerce. Discusses experimental methodologies to identify and measure various preferences and phenomena, as well as mathematical models to capture them in decision making. Content updated from year to year to include state-of-the-art research."}, "Workshop in Operations Management": {"title": "Workshop in Operations Management", "number": "15.799", "description": "Presentations by faculty, doctoral students, and guest speakers of ongoing research relating to current issues in operations management, including reports of research projects (proposed or in progress) and informal discussions of recent literature dealing with subjects of special interest to participants. Primarily for doctoral students."}, "Marketing Innovation": {"title": "Marketing Innovation", "number": "15.8141", "description": "Develops the skills necessary to market innovations, including new products, services, concepts, and customer experiences. Covers how to select the right market, target that market effectively, position a product or service for maximum success, and combine analytics, frameworks, and research for maximum potential. Emphasizes both marketing theory and practice: proven solutions to marketing problems, case sessions to illustrate the application of these techniques in various industries, and practice sessions to apply these techniques to real problems. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details."}, "Marketing Analytics": {"title": "Marketing Analytics", "number": "15.819", "description": "Hands-on course, using quantitative data to inform, make, and automate marketing decisions, including growth marketing, product design, pricing and promotions, advertising, and customer retention. Topics include creating metrics, randomized experiments, models for targeting, and analyzing launches. Features lectures, industry examples and guests, and data analysis assignments supported by in-class labs. Draws inspiration from the internet industry, but applications span many industries."}, "Listening to the Customer": {"title": "Listening to the Customer", "number": "15.821", "description": "Introduction to soft consumer research methods, useful for getting quick customer input into decisions on product design and development, strategic positioning, advertising, and branding. Covers interview techniques, observational methods, voice of the customer, focus groups, and analyses suitable for qualitative data. Introduces new information-gathering methods in development at MIT."}, "Strategic Market Measurement": {"title": "Strategic Market Measurement", "number": "15.822", "description": "Project subject teaches students how to create, carry out, interpret, and analyze a market research questionnaire. Emphasis on discovering market structure and segmentation, but students can pursue other project applications. Includes a user-oriented treatment of multivariate analysis (factor analysis, multidimensional scaling, conjoint and cluster analysis)."}, "Product Management": {"title": "Product Management", "number": "15.828", "description": "Practical introduction to the process of product management. Provides opportunities for experiential learning through projects with companies and organizations. Exposes students to state-of-the-art frameworks and tools that bring to market elegant and efficient solutions to strong customer needs. Covers the major phases of product management: opportunity identification (customer insights, interviews and surveys, ideation and brainstorming), design (product strategy and conjoint analysis), testing (concept testing, prototyping and A/B testing), and launch (choice of media and channel)."}, "Enterprise Management Lab": {"title": "Enterprise Management Lab", "number": "15.830", "description": "Lays the foundation for the Enterprise Management (EM) Track by developing students' ability to apply integrated management perspectives and practices through action-learning. Small teams of students deliver quality deliverables by working on projects for large organizations and emergent innovators that integrate marketing, operations, and/or strategy. Students engage with faculty mentors and guest faculty speakers from marketing, strategy, and operations. Promotes a holistic cross-functional approach to addressing business issues. Significant class time allocated to team collaboration on projects. Students must register for both the fall term and IAP. Restricted to MBA students in EM Track."}, "Business-to-Business Marketing": {"title": "Business-to-Business Marketing", "number": "15.833", "description": "Applies marketing concepts, analyses and tools used in business-to-business (B2B) marketing. Develops an understanding of customer value management and value quantification as a strategy for delivering superior value to targeted business segments while maintaining equitable returns. Focuses on B2B pricing, brand building, web and technology facilitation of the supply chain, and customer relationship management. Underscores sales force management within the context of go-to-market strategy; however, does not address selling per se. Discusses ethical issues and various B2B contexts, such as products and services, for- and non-profits, and domestic and global markets. Emphasizes applications in technology and healthcare domains. Includes value-based pricing project, case studies, applied exercises, and readings."}, "Marketing Strategy": {"title": "Marketing Strategy", "number": "15.834", "description": "Aims to equip students to formulate the marketing component of overall corporate strategy. Several tools and frameworks concerned with the leverage and development of competitive advantages are introduced through cases, lectures, and guest speakers. Applications include innovative business models, two-sided markets, social media marketing, brand development, electronic retailing, as well as sports and entertainment marketing."}, "Workshop in Marketing": {"title": "Workshop in Marketing", "number": "15.839", "description": "Presentations by faculty, doctoral students, and guest speakers of ongoing research relating to current issues in marketing. Topics: reports of research projects (proposed or in progress) and informal discussions of recent literature dealing with subjects of special interest to participants. Restricted to doctoral students."}, "Branding": {"title": "Branding", "number": "15.846", "description": "Provides a foundation for building, managing, and defending brands at various stages in the brand life cycle. Introduces the fundamentals of brand architecture and management relevant for B2C and B2B Marketing. Examples from a variety of industries cover topics that include brand co-creation, diffusion, imitation, and authenticity. Explores theory and practice using cases and academic research. Also looks at the development of leadership branding."}, "Consumer Behavior": {"title": "Consumer Behavior", "number": "15.847", "description": "Examines models of consumer behavior and methods for its analysis and prediction. Focuses on theories developed in marketing, psychology, and other behavioral sciences, and their role in understanding consumer preferences and decision making. Reviews theories in the context of a variety of industry applications. Students apply theories to their own market research projects."}, "System Dynamics II": {"title": "System Dynamics II", "number": "15.872", "description": "Emphasizes tools and methods needed to apply systems thinking and simulation modeling successfully in diverse real-world settings, including supply chains, forecasting, project management, process improvement, service operations, and platform-based businesses, among others. Uses simulation models, management flight simulators, and case studies to deepen the conceptual and modeling skills introduced in 15.871. Through models and case studies of successful applications students develop proficiency in how to use qualitative and quantitative data to formulate and test models, and how to work effectively with senior executives to implement change successfully. Meets with 15.8741 second half of term when offered concurrently. Expectations and evaluation criteria differ for students taking half-term graduate version; consult syllabus or instructor for specific details."}, "People and the Planet:  Environmental Governance and Science": {"title": "People and the Planet:  Environmental Governance and Science", "number": "15.874[J]", "description": "Introduces governance and science aspects of complex environmental problems and approaches to solutions. Introduces quantitative analyses and methodological tools to analyze environmental issues that have human and natural components. Demonstrates concepts through a series of in-depth case studies of environmental governance and science problems. Students develop writing, quantitative modeling, and analytical skills in assessing environmental systems problems and developing solutions. Through experiential activities, such as modeling and policy exercises, students engage with the challenges and possibilities of governance in complex, interacting systems, including biogeophysical processes and societal and stakeholder interactions."}, "System Dynamics for Business Policy": {"title": "System Dynamics for Business Policy", "number": "15.8741", "description": "Introduction to systems thinking and system dynamics modeling applied to strategy, organizational change, and policy design. Students use simulation models, management flight simulators, and case studies to develop conceptual and modeling skills for the design and management of high-performance organizations in a dynamic world. Case studies cover successful applications of system dynamics in growth strategy, management of technology, operations, supply chains, product development, and other areas. When offered concurrently, meets with 15.871 first half of term and with 15.872 second half of term. Expectations and evaluation criteria differ for students taking the half-term graduate subjects; consult syllabus or instructor for specific details."}, "Applications of System Dynamics": {"title": "Applications of System Dynamics", "number": "15.875", "description": "Explores how system dynamics can help organizations achieve important goals. Student teams pair with clients to tackle a pressing issue framed by the client and its partners. In interactive classroom sessions, and via client engagement, students learn modeling and consulting skills they need to be effective. Focuses on gaining practical insight from system dynamics and its application across a wide range of organizations and challenges."}, "Capstone Seminar in Sustainability": {"title": "Capstone Seminar in Sustainability", "number": "15.878", "description": "Provides an opportunity for students to synthesize their coursework and experiences in sustainability. Explores the institutions and global goals that are driving toward sustainability, and how these interact with the industries that students plan to enter after graduation. In this context, students reflect on their strengths and aspirations, and formulate a strategy to maximize their impact and career success. Guest practitioners provide insight and inspiration throughout the course, drawing on their experience across sectors."}, "Research Seminar in System Dynamics": {"title": "Research Seminar in System Dynamics", "number": "15.879", "description": "Doctoral level seminar in system dynamics modeling, with a focus on social, economic and technical systems. Covers classic works in dynamic modeling from various disciplines and current research problems and papers. Participants critique the theories and models, often including replication, testing, and improvement of various models, and lead class discussion. Topics vary from year to year."}, "Advanced Strategic Management": {"title": "Advanced Strategic Management", "number": "15.904", "description": "Builds on 15.900 and 15.902 to explore key concepts that have shaped the field of strategic management and strategy consulting over the past several decades. Uses lectures, readings, case studies, and videos to review the evolution of strategy teaching, research, and practice; the role of randomness in strategic outcomes; the difference between strategic thinking versus planning; and enduring principles related to competitive advantage. Key themes include the role of platform strategies and services, as well as capabilities, pull mechanisms, economies of scope, and flexibility, with examples from a variety of industries. Develops an understanding of what has made some firms successful in the past as well as what managers can do to compete in an uncertain future."}, "Managing the Modern Organization: Organizational Economics and Corporate Strategy": {"title": "Managing the Modern Organization: Organizational Economics and Corporate Strategy", "number": "15.903", "description": "Focuses on how managers build and manage complex organizations to achieve strategic goals. Develops theoretical frameworks that build on 15.010 and 15.311. Applies these frameworks to corporate strategy (i.e., the design and management of the multi-business firm) and extended enterprises (i.e., the design and management of multi-firm structures such as supply chains, alliances, joint ventures, and networks)."}, "Innovation Strategy": {"title": "Innovation Strategy", "number": "15.910", "description": "Establishes a solid foundation for students interested in formulating and executing a strategy for developing new-to-the-world products in a technology-intensive business. Clarifies the interactions among competition, patterns of technological and market change, and the development of internal firm capabilities. Topics include \"crossing the chasm\" with new technologies, appropriating the returns from innovation, platform strategy, and the role of intellectual property and government regulations.  Key conceptual frameworks are linked to applications in a variety of industry and case settings."}, "Strategic Management of Innovation and Entrepreneurship": {"title": "Strategic Management of Innovation and Entrepreneurship", "number": "15.912", "description": "Provides a series of strategic frameworks for managing high-technology businesses with a particular focus on innovation and entrepreneurship, especially as it builds upon patterns of technological and market change, prior research on product development and new ventures, and the structure and development of organizational capabilities. Includes case analyses and simulations, as well as independent readings drawn from research in technological innovation, entrepreneurial management, and organizational theory."}, "Strategies for Sustainable Business": {"title": "Strategies for Sustainable Business", "number": "15.913", "description": "Develops a pragmatic, action-oriented approach to sustainability: the alignment between healthy businesses, healthy environments, healthy societies, and an economy that meets human needs.  In-class simulations and role-playing provide a robust foundation for understanding sustainability challenges.  Cases analyze innovative strategies for sustainable businesses and organizations.  Class discussions explore how sustainability is changing existing business models and market structures, how to develop sustainable management practices, and how firms can implement those practices successfully."}, "Competitive Dynamics and Strategy: Winning in Technology Markets": {"title": "Competitive Dynamics and Strategy: Winning in Technology Markets", "number": "15.914", "description": "Focuses on competitive strategy in technology-driven markets. Students acquire a portfolio of models of the signature dynamics in these markets and use the models in projects with participating companies to analyze technology markets, formulate competitive strategies, and illuminate the challenges of execution. Addresses issues critical for both established incumbents and new market entrants. Restricted to graduate students."}, "Laboratory for Sustainable Business": {"title": "Laboratory for Sustainable Business", "number": "15.915", "description": "Develops a pragmatic, action-oriented approach to sustainability: the alignment between healthy businesses, healthy environments, healthy societies, and an economy that meets human needs. In-class simulations and role-playing provide a robust foundation for understanding sustainability challenges. Cases analyze innovative strategies for sustainable businesses and organizations. Class discussions explore how sustainability is changing existing business models and market structures, how to develop sustainable management practices, and how firms can implement those practices successfully. Students apply the concepts, theories, and tools of the course by working with a host organization on a real management project during the semester."}, "The Sociology of Strategy": {"title": "The Sociology of Strategy", "number": "15.928", "description": "Doctoral seminar in theory building for social scientists interested in economic sociology, organization theory, strategic management, and related fields. Builds skills for developing social scientific theory. Focuses on assessing and developing the relevance of sociological research for key questions in strategy research: what explains the relative performance of firms and the variety of their strategies for achieving performance. Students also develop skills in evaluating academic research in this area. Restricted to doctoral students."}, "Identity and Action": {"title": "Identity and Action", "number": "15.929", "description": "Doctoral seminar in theory building for social scientists. Primary goal is to build skills for developing social scientific theory. Secondary goals are to review and integrate a broad array of ideas concerning the foundations of identity and its relation to action, and to suggest how such issues relate to a broader set of questions in the social sciences.   Students learn that any account of action is based on ascribing desires, beliefs, and opportunities to specific actors, but such actors cannot be easily explained except as a result of action by prior actors.  The focus of this course is around developing this paradox and providing a foundation for resolving it. Restricted to doctoral students."}, "Strategic Opportunities in Energy": {"title": "Strategic Opportunities in Energy", "number": "15.933", "description": "Introduces the energy system in terms of sources and uses, market characteristics, and key metrics.  Provides frameworks for understanding the structure and dynamics of the sector and the drivers of the energy future.  Opportunities resulting from demand growth, supply challenges, environmental constraints, security of supply, technology breakthroughs, and regulation are analyzed from the perspectives of both established players and entrepreneurs.  Student teams engage in projects that evaluate a segment of the energy landscape and develop a strategic prospectus for a new business opportunity."}, "Leadership in Real Estate": {"title": "Leadership in Real Estate", "number": "15.941[J]", "description": "Designed to help students deepen their understanding of leadership and increase self-awareness. They reflect on their leadership styles and create goals and a learning plan to develop their capabilities. They also participate in activities to strengthen their \"leadership presence\" - the ability to authentically connect with people's hearts and minds. Students converse with leaders to learn from their insights, experiences, and advice. Limited to 15."}, "Undergraduate Research in Management": {"title": "Undergraduate Research in Management", "number": "15.UR", "description": "Participation in the work of a research group which includes such activities as independent study of the literature, direct involvement in the group's research (commensurate with the student's skills and preparation), or project work under an individual faculty member possibly extending over more than one term. Admission by arrangement with individual faculty member. Requires written project report."}, "UPOP Engineering Practice Experience": {"title": "UPOP Engineering Practice Experience", "number": "15.EPE", "description": "Provides sophomores with guided practice in finding opportunities and excelling in the world of practice. Building on the skills and relationships acquired in the Engineering Practice Workshop, students receive coaching to articulate goals, invoke the UPOP network of mentors and employers, identify and pursue opportunities and negotiate terms of their summer assignment. Students complete a 10-12 week internship, which includes filing three progress reports, conducting one informational interview, and possibly hosting a site visit by MIT staff. Returning to campus as juniors, UPOP students take part in reflective exercises that aid assimilation of learning objectives and reinforce the cognitive link between all aspects of the UPOP experience and disciplinary fields of study. Sequence begins in the spring of sophomore year and ends in the fall of junior year."}, "Independent Group Study in Action Learning": {"title": "Independent Group Study in Action Learning", "number": "15.998", "description": "Team-based opportunities for application management tools, under faculty supervision, on dynamic projects that provide a wide array of operational challenges facing organizations around the world. May include travel to on-site locales. Projects require prior approval, as well as a written proposal and a final report."}, "Internship": {"title": "Internship", "number": "15.999", "description": "Students participate in an off-campus internship experience and apply topics of management and/or culture to their experience. Requirements include mandatory attendance at one workshop and a written deliverable. Students must have a formal offer letter from host employer/organization prior to enrolling. Restricted to MIT Sloan students who wish to intern in an area related to their field of study. Additional restrictions may apply."}}