{"Introduction to Professional Success and Leadership in Biological Engineering": {"title": "Introduction to Professional Success and Leadership in Biological Engineering", "number": "20.001", "description": "Interactive introduction to the discipline of Biological Engineering through presentations by alumni practitioners, with additional panels and discussions on skills for professional development. Presentations emphasize the roles of communication through writing and speaking, building and maintaining professional networks, and interpersonal and leadership skills in building successful careers. Provides practical advice about how to prepare for job searches and graduate or professional school applications from an informed viewpoint. Prepares students for UROPs, internships, and selection of BE electives."}, "Ethics for Engineers": {"title": "Ethics for Engineers", "number": "20.005", "description": "Integrates classical readings that provide an overview of ethics with a survey of case studies that focus on ethical problems arising in the practice of engineering. Readings taken from a variety of sources, such as Aristotle, Machiavelli, Bacon, Hobbes, Locke, the Founding Fathers, and the Bible. Case studies include written analyses and films that address engineering disasters, biotechnology, court cases, ethical codes, and the ultimate scope and aims of engineering. Students taking independent inquiry version 6.9041 expand the scope of their term project. Students taking 20.005 focus their term project on a problem in biological engineering in which there are intertwined ethical and technical issues."}, "Introduction to Biological Engineering Design Using Synthetic Biology": {"title": "Introduction to Biological Engineering Design Using Synthetic Biology", "number": "20.020", "description": "Project-based introduction to the engineering of synthetic biological systems. Throughout the term, students develop projects that are responsive to real-world problems of their choosing, and whose solutions depend on biological technologies. Lectures, discussions, and studio exercises will introduce components and control of prokaryotic and eukaryotic behavior; DNA synthesis, standards, and abstraction in biological engineering; and issues of human practice, including biological safety, security, ethics, and ownership, sharing, and innovation. Preference to freshmen."}, "Metakaryotic Biology and Epidemiology": {"title": "Metakaryotic Biology and Epidemiology", "number": "20.101", "description": "Introduces non-eukaryotic, \"metakaryotic\" cells with hollow bell-shaped nuclei that serve as the stem cells of human fetal/juvenile growth and development as well as of tumors and atherosclerotic plaques. Studies the relationship of lifetime growth and mutations of metakaryotic stem cells to age-specific death rates. Considers the biological bases of treatment protocols found to kill metakaryotic cancer stem cells"}, "Environmental Cancer Risks, Prevention, and Therapy": {"title": "Environmental Cancer Risks, Prevention, and Therapy", "number": "20.104[J]", "description": "Analysis of the history of cancer and vascular disease mortality rates in predominantly European- and African-American US cohorts, 1895-2016, to discover specific historical shifts. Explored in terms of contemporaneously changing environmental risk factors: air-, food- and water-borne chemicals; subclinical infections; diet and lifestyles. Special section on occupational risk factors. Considers the hypotheses that genetic and/or environmental factors affect metakaryotic stem cell mutation rates in fetuses and juveniles and/or their growth rates of preneoplastic in adults."}, "Systems Microbiology": {"title": "Systems Microbiology", "number": "20.106[J]", "description": "Introductory microbiology from a systems perspective - considers microbial diversity and the integration of data from a molecular, cellular, organismal, and ecological context to understand the interaction of microbial organisms with their environment. Special emphasis on specific viral, bacterial, and eukaryotic microorganisms and their interaction with animal hosts with focus on contemporary problems in areas such as vaccination, emerging disease, antimicrobial drug resistance, and toxicology."}, "Laboratory Fundamentals in Biological Engineering": {"title": "Laboratory Fundamentals in Biological Engineering", "number": "20.109", "description": "Introduces experimental biochemical and molecular techniques from a quantitative engineering perspective. Experimental design, data analysis, and scientific communication form the underpinnings of this subject. Examples of discovery-based experimental modules include DNA engineering in which students design, construct, and use genetic material; parts engineering, which emphasizes protein design and quantitative assessment of protein performance; systems engineering, in which students consider genome-wide consequences of genetic perturbations; and biomaterials engineering, in which students use biologically-encoded devices to design and build materials. Students complete some laboratory time online in advance of each class. Enrollment limited; priority to Course 20 majors."}, "Thermodynamics of Biomolecular Systems": {"title": "Thermodynamics of Biomolecular Systems", "number": "20.110[J]", "description": "Equilibrium properties of macroscopic and microscopic systems. Basic thermodynamics: state of a system, state variables. Work, heat, first law of thermodynamics, thermochemistry. Second and third law of thermodynamics: entropy and its statistical basis, Gibbs function. Chemical equilibrium of reactions in gas and solution phase. Macromolecular structure and interactions in solution. Driving forces for molecular self-assembly. Binding cooperativity, solvation, titration of macromolecules."}, "Biological Circuit Engineering Laboratory": {"title": "Biological Circuit Engineering Laboratory", "number": "20.129[J]", "description": "Students assemble individual genes and regulatory elements into larger-scale circuits; they experimentally characterize these circuits in yeast cells using quantitative techniques, including flow cytometry, and model their results computationally. Emphasizes concepts and techniques to perform independent experimental and computational synthetic biology research. Discusses current literature and ongoing research in the field of synthetic biology. Instruction and practice in oral and written communication provided. Enrollment limited."}, "Fundamentals of Drug Development": {"title": "Fundamentals of Drug Development", "number": "20.201", "description": "Addresses the scientific basis for the development of new drugs. First half of term begins with an overview of the drug discovery process, followed by fundamental principles of pharmacokinetics, pharmacodynamics, metabolism, and the mechanisms by which drugs cause therapeutic and toxic responses. Second half applies principles to case studies and literature discussions of current problems with specific drugs, drug classes, and therapeutic targets."}, "In vivo Models: Principles and Practices": {"title": "In vivo Models: Principles and Practices", "number": "20.202", "description": "Selected aspects of anatomy, histology, immuno-cytochemistry, in situ hybridization, physiology, and cell biology of mammalian organisms and their pathogens. Subject material integrated with principles of toxicology, in vivo genetic engineering, and molecular biology. A lab/demonstration period each week involves experiments in anatomy (in vivo), physiology, and microscopy to augment the lectures. Offered first half of spring term."}, "Neurotechnology in Action": {"title": "Neurotechnology in Action", "number": "20.203[J]", "description": "Offers a fast-paced introduction to numerous laboratory methods at the forefront of modern neurobiology. Comprises a sequence of modules focusing on neurotechnologies that are developed and used by MIT research groups. Each module consists of a background lecture and 1-2 days of firsthand laboratory experience. Topics typically include optical imaging, optogenetics, high throughput neurobiology, MRI/fMRI, advanced electrophysiology, viral and genetic tools, and connectomics."}, "Principles and Applications of Genetic Engineering for Biotechnology and Neuroscience": {"title": "Principles and Applications of Genetic Engineering for Biotechnology and Neuroscience", "number": "20.205[J]", "description": "Covers principles underlying current and future genetic engineering approaches, ranging from single cellular organisms to whole animals. Focuses on development and invention of technologies for engineering biological systems at the genomic level, and applications of engineered biological systems for medical and biotechnological needs, with particular emphasis on genetic manipulation of the nervous system. Design projects by students."}, "Biotechnologies in Infectious Disease": {"title": "Biotechnologies in Infectious Disease", "number": "20.207", "description": "Team-based exploration of current and emerging technologies used in the surveillance, diagnosis, understanding, treatment and prevention of infectious diseases, drawing on basic science and bio-engineering principles. In a term-long project, student teams develop novel technologies to solve major problems in global infectious disease, with a trajectory to a start-up company. Industry experts and academic entrepreneurs present case studies throughout the term, including technology innovations, regulatory sciences, intellectual property and clinical development. Term culminates with team presentations to a panel of industry and scientific leaders."}, "Genome Stability and Engineering in the Context of Diseases, Drugs, and Public Health": {"title": "Genome Stability and Engineering in the Context of Diseases, Drugs, and Public Health", "number": "20.213", "description": "Studies how DNA damage leads to diseases, and how DNA repair modulates cancer risk and treatment. Also covers how DNA repair impacts genetic engineering, whether by targeted gene therapy or CRISPR-mediated genetic changes. Students gain a public health perspective by examining how DNA-damaging agents in our environment can lead to downstream cancer. Explores the underlying chemical, molecular and biochemical processes of DNA damage and repair, and their implications for disease susceptibility and treatment."}, "Macroepidemiology, Population Genetics, and Stem Cell Biology of Human Clonal Diseases": {"title": "Macroepidemiology, Population Genetics, and Stem Cell Biology of Human Clonal Diseases", "number": "20.215", "description": "Studies the logic and technology needed to discover genetic and environmental risks for common human cancers and vascular diseases. Includes an introduction to metakaryotic stem cell biology. Analyzes large, organized historical public health databases using quantitative cascade computer models that include population stratification of stem cell mutation rates in fetal/juvenile tissues and growth rates in preneoplastic colonies and atherosclerotic plaques. Means to test hypotheses (CAST) that certain genes carry mutations conferring risk for common cancers via genetic analyses in large human cohorts. Involves <em>de novo</em> computer modeling of a lifetime disease experience or test of a student-developed hypothesis."}, "Immunology": {"title": "Immunology", "number": "20.630[J]", "description": "Comprehensive survey of molecular, genetic, and cellular aspects of the immune system. Topics include innate and adaptive immunity; cells and organs of the immune system; hematopoiesis; immunoglobulin, T cell receptor, and major histocompatibility complex (MHC) proteins and genes; development and functions of B and T lymphocytes; immune responses to infections and tumors; hypersensitivity, autoimmunity, and immunodeficiencies. Particular attention to the development and function of the immune system as a whole, as studied by modern methods and techniques. Students taking graduate version explore the subject in greater depth, including study of recent primary literature."}, "Computational Analysis of Biological Data": {"title": "Computational Analysis of Biological Data", "number": "20.260", "description": "Presents foundational methods for analysis of complex biological datasets. Covers fundamental concepts in probability, statistics, and linear algebra underlying computational tools that enable generation of biological insights. Assignments focus on practical examples spanning basic science and medical applications. Assumes basic knowledge of calculus and programming."}, "Principles of Synthetic Biology": {"title": "Principles of Synthetic Biology", "number": "20.405[J]", "description": "Introduces the basics of synthetic biology, including quantitative cellular network characterization and modeling. Considers the discovery and genetic factoring of useful cellular activities into reusable functions for design. Emphasizes the principles of biomolecular system design and diagnosis of designed systems. Illustrates cutting-edge applications in synthetic biology and enhances skills in analysis and design of synthetic biological applications. Students taking graduate version complete additional assignments."}, "Instrumentation and Measurement for Biological Systems": {"title": "Instrumentation and Measurement for Biological Systems", "number": "20.309[J]", "description": "Sensing and measurement aimed at quantitative molecular/cell/tissue analysis in terms of genetic, biochemical, and biophysical properties. Methods include light and fluorescence microscopies, and electro-mechanical probes (atomic force microscopy, optical traps, MEMS devices). Application of statistics, probability, signal and noise analysis, and Fourier techniques to experimental data. Enrollment limited; preference to Course 20 undergraduates."}, "Molecular, Cellular, and Tissue Biomechanics": {"title": "Molecular, Cellular, and Tissue Biomechanics", "number": "20.410[J]", "description": "Develops and applies scaling laws and the methods of continuum mechanics to biomechanical phenomena over a range of length scales. Topics include structure of tissues and the molecular basis for macroscopic properties; chemical and electrical effects on mechanical behavior; cell mechanics, motility and adhesion; biomembranes; biomolecular mechanics and molecular motors. Experimental methods for probing structures at the tissue, cellular, and molecular levels."}, "Physical Biology": {"title": "Physical Biology", "number": "20.415", "description": "Focuses on current major research topics in quantitative, physical biology. Topics include synthetic structural biology, synthetic cell biology, microbial systems biology and evolution, cellular decision making, neuronal circuits, and development and morphogenesis. Emphasizes current motivation and historical background, state-of-the-art measurement methodologies and techniques, and quantitative physical modeling frameworks. Experimental techniques include structural biology, next-generation sequencing, fluorescence imaging and spectroscopy, and quantitative biochemistry. Modeling approaches include stochastic rate equations, statistical thermodynamics, and statistical inference. Students taking graduate version complete additional assignments."}, "Analysis of Biomolecular and Cellular Systems": {"title": "Analysis of Biomolecular and Cellular Systems", "number": "20.320", "description": "Analysis of molecular and cellular processes across a hierarchy of scales, including genetic, molecular, cellular, and cell population levels. Topics include gene sequence analysis, molecular modeling, metabolic and gene regulation networks, signal transduction pathways and cell populations in tissues. Emphasis on experimental methods, quantitative analysis, and computational modeling."}, "Fields, Forces and Flows in Biological Systems": {"title": "Fields, Forces and Flows in Biological Systems", "number": "20.330[J]", "description": "Introduction to electric fields, fluid flows, transport phenomena and their application to biological systems. Flux and continuity laws, Maxwell's equations, electro-quasistatics, electro-chemical-mechanical driving forces, conservation of mass and momentum, Navier-Stokes flows, and electrokinetics. Applications include biomolecular transport in tissues, electrophoresis, and microfluidics."}, "Biological Systems Modeling": {"title": "Biological Systems Modeling", "number": "20.334", "description": "Practices the use of modern numerical analysis tools (e.g., COMSOL) for biological systems with multi-physics behavior. Covers modeling of diffusion, reaction, convection and other transport mechanisms. Analysis of microfluidic devices as examples. Discusses practical issues and challenges in numerical modeling. No prior knowledge of modeling software required. Includes weekly modeling homework and one final modeling project. For Fall 2018, class is comprised of a combination of online material and remote lectures given during evening hours."}, "Bioinstrumentation Project Lab": {"title": "Bioinstrumentation Project Lab", "number": "20.345[J]", "description": "In-depth examination of instrumentation design, principles and techniques for studying biological systems, from single molecules to entire organisms. Lectures cover optics, advanced microscopy techniques, electronics for biological measurement, magnetic resonance imaging, computed tomography, MEMs, microfluidic devices, and limits of detection. Students select two lab exercises during the first half of the semester and complete a final design project in the second half. Lab emphasizes design process and skillful realization of a robust system. Enrollment limited; preference to Course 20 majors and minors."}, "Principles of Neuroengineering": {"title": "Principles of Neuroengineering", "number": "20.452[J]", "description": "Covers how to innovate technologies for brain analysis and engineering, for accelerating the basic understanding of the brain, and leading to new therapeutic insight and inventions. Focuses on using physical, chemical and biological principles to understand technology design criteria governing ability to observe and alter brain structure and function. Topics include optogenetics, noninvasive brain imaging and stimulation, nanotechnologies, stem cells and tissue engineering, and advanced molecular and structural imaging technologies. Includes design projects. Designed for students with engineering maturity who are ready for design. Students taking graduate version complete additional assignments."}, "Molecular and Engineering Aspects of Biotechnology": {"title": "Molecular and Engineering Aspects of Biotechnology", "number": "20.361[J]", "description": "Covers biological and bioengineering principles underlying the development and therapeutic use of recombinant proteins and stem cells; glycoengineering of recombinant proteins; normal and pathological signaling by growth factors and their receptors; receptor trafficking; monoclonal antibodies as therapeutics; protein pharmacology and delivery; stem cell-derived tissues as therapeutics; RNA therapeutics; combinatorial protein engineering; and new antitumor drugs."}, "Biomaterials Science and Engineering": {"title": "Biomaterials Science and Engineering", "number": "20.463[J]", "description": "Covers, at a molecular scale, the analysis and design of materials used in contact with biological systems, and biomimetic strategies aimed at creating new materials based on principles found in biology. Topics include molecular interaction between bio- and synthetic molecules and surfaces; design, synthesis, and processing approaches for materials that control cell functions; and application of materials science to problems in tissue engineering, drug delivery, vaccines, and cell-guiding surfaces. Students taking graduate version complete additional assignments."}, "Engineering the Immune System in Cancer and Beyond": {"title": "Engineering the Immune System in Cancer and Beyond", "number": "20.465", "description": "Examines strategies in clinical and preclinical development for manipulating the immune system to treat and protect against disease. Begins with brief review of immune system. Discusses interaction of tumors with the immune system, followed by approaches by which the immune system can be modulated to attack cancer. Also covers strategies based in biotechnology, chemistry, materials science, and molecular biology to induce immune responses to treat infection, transplantation, and autoimmunity. Students taking graduate version complete additional assignments."}, "Cellular Neurophysiology and Computing": {"title": "Cellular Neurophysiology and Computing", "number": "20.470[J]", "description": "Integrated overview of the biophysics of cells from prokaryotes to neurons, with a focus on mass transport and electrical signal generation across cell membrane. First third of course focuses on mass transport through membranes: diffusion, osmosis, chemically mediated, and active transport. Second third focuses on electrical properties of cells: ion transport to action potential generation and propagation in electrically excitable cells. Synaptic transmission. Electrical properties interpreted via kinetic and molecular properties of single voltage-gated ion channels. Final third focuses on biophysics of synaptic transmission and introduction to neural computing. Laboratory and computer exercises illustrate the concepts. Students taking graduate version complete different assignments."}, "Biological Engineering Design": {"title": "Biological Engineering Design", "number": "20.380", "description": "Illustrates how knowledge and principles of biology, biochemistry, and engineering are integrated to create new products for societal benefit. Uses case study format to examine recently developed products of pharmaceutical and biotechnology industries: how a product evolves from initial idea, through patents, testing, evaluation, production, and marketing. Emphasizes scientific and engineering principles, as well as the responsibility scientists, engineers, and business executives have for the consequences of their technology. Instruction and practice in written and oral communication provided. Enrollment limited; preference to Course 20 undergraduates."}, "Understanding Current Research in Synthetic Biology": {"title": "Understanding Current Research in Synthetic Biology", "number": "20.385", "description": "Provides an in-depth understanding of the state of research in synthetic biology. Critical evaluation of primary research literature covering a range of approaches to the design, modeling and programming of cellular behaviors. Focuses on developing the skills needed to read, present and discuss primary research literature, and to manage and lead small teams. Students mentor a small undergraduate team of 20.020 students. Open to advanced students with appropriate background in biology."}, "Foundations of Computational and Systems Biology": {"title": "Foundations of Computational and Systems Biology", "number": "20.490", "description": "Provides an introduction to computational and systems biology. Includes units on the analysis of protein and nucleic acid sequences, protein structures, and biological networks. Presents principles and methods used for sequence alignment, motif finding, expression array analysis, structural modeling, structure design and prediction, and network analysis and modeling. Techniques include dynamic programming, Markov and hidden Markov models, Bayesian networks, clustering methods, and energy minimization approaches. Exposes students to emerging research areas. Designed for students with strong backgrounds in either molecular biology or computer science. Some foundational material covering basic programming skills, probability and statistics is provided for students with less quantitative backgrounds. Students taking graduate version complete additional assignments."}, "Biological Engineering II: Instrumentation and Measurement": {"title": "Biological Engineering II: Instrumentation and Measurement", "number": "20.409", "description": "Sensing and measurement aimed at quantitative molecular/cell/tissue analysis in terms of genetic, biochemical, and biophysical properties. Methods include light and fluorescence microscopies, electronic circuits, and electro-mechanical probes (atomic force microscopy, optical traps, MEMS devices). Application of statistics, probability, signal and noise analysis, and Fourier techniques to experimental data. Limited to 5 graduate students."}, "Topics in Biophysics and Physical Biology": {"title": "Topics in Biophysics and Physical Biology", "number": "20.416[J]", "description": "Provides broad exposure to research in biophysics and physical biology, with emphasis on the critical evaluation of scientific literature. Weekly meetings include in-depth discussion of scientific literature led by distinct faculty on active research topics. Each session also includes brief discussion of non-research topics including effective presentation skills, writing papers and fellowship proposals, choosing scientific and technical research topics, time management, and scientific ethics."}, "Principles of Molecular Bioengineering": {"title": "Principles of Molecular Bioengineering", "number": "20.420[J]", "description": "Provides an introduction to the mechanistic analysis and engineering of biomolecules and biomolecular systems. Covers methods for measuring, modeling, and manipulating systems, including biophysical experimental tools, computational modeling approaches, and molecular design. Equips students to take systematic and quantitative approaches to the investigation of a wide variety of biological phenomena."}, "Fields, Forces, and Flows in Biological Systems": {"title": "Fields, Forces, and Flows in Biological Systems", "number": "20.430[J]", "description": "Molecular diffusion, diffusion-reaction, conduction, convection in biological systems; fields in heterogeneous media; electrical double layers; Maxwell stress tensor, electrical forces in physiological systems. Fluid and solid continua: equations of motion useful for porous, hydrated biological tissues. Case studies of membrane transport, electrode interfaces, electrical, mechanical, and chemical transduction in tissues, convective-diffusion/reaction, electrophoretic, electroosmotic flows in tissues/MEMs, and ECG. Electromechanical and physicochemical interactions in cells and biomaterials; musculoskeletal, cardiovascular, and other biological and clinical examples. Prior undergraduate coursework in transport recommended."}, "Analysis of Biological Networks": {"title": "Analysis of Biological Networks", "number": "20.440", "description": "Conceptual and experimental approaches to analyzing complex biological networks and systems, from molecules to human populations, focusing on human pathophysiology and disease. Moving from single component analysis to pathways and networks, combines didactic lectures with in-depth analysis of current literature and computational analysis. Emphasizes the chemistry and biochemistry of underlying biological processes. Topics include linking genes/SNPs to disease, defining pathways, analysis of pathways"}, "Molecular and Cellular Pathophysiology": {"title": "Molecular and Cellular Pathophysiology", "number": "20.450", "description": "Compares the complex molecular and cellular interactions in health and disease between commensal microbial communities,  pathogens and the human or animal host. Special focus is given to current research on microbe/host interactions, infection of significant importance to public health, and chronic infectious disease. Classwork will include lecture, but emphasize critical evaluation and class discussion of recent scientific papers, and the development of new research agendas in the fields presented."}, "Revolutionary Ventures: How to Invent and Deploy Transformative Technologies": {"title": "Revolutionary Ventures: How to Invent and Deploy Transformative Technologies", "number": "20.454[J]", "description": "Seminar on envisioning and building ideas and organizations to accelerate engineering revolutions. Focuses on emerging technology domains, such as neurotechnology, imaging, cryotechnology, gerontechnology, and bio-and-nano fabrication. Draws on historical examples as well as live case studies of existing or emerging organizations, including labs, institutes, startups, and companies. Goals range from accelerating basic science to developing transformative products or therapeutics. Each class is devoted to a specific area, often with invited speakers, exploring issues from the deeply technical through the strategic. Individually or in small groups, students prototype new ventures aimed at inventing and deploying revolutionary technologies."}, "Applied Developmental Biology and Tissue Engineering": {"title": "Applied Developmental Biology and Tissue Engineering", "number": "20.475", "description": "This subject addresses the integration of engineering and biology design principles to create human tissues and organs for regenerative medicine to drug development. Overview of embryogenesis; how morphogenic phenomena are governed by biochemical and biophysical cues. Analysis of in vitro generation of human brain, gut, and other organoids from stem cells. Roles of biomaterials and microreactors in improving organoid formation and function. Organoid use in modeling disease and physiology in vitro. Engineering and biological principles of reconstructing tissues and organs from postnatal donor cells using biomaterials scaffolds and bioreactors. Select applications such as liver disease, brain disorders, and others. Graduate students will have additional assignments."}, "Case Studies and Strategies in Drug Discovery and Development": {"title": "Case Studies and Strategies in Drug Discovery and Development", "number": "20.486[J]", "description": "Aims to develop appreciation for the stages of drug discovery and development, from target identification, to the submission of preclinical and clinical data to regulatory authorities for marketing approval. Following introductory lectures on the process of drug development, students working in small teams analyze how one of four new drugs or drug candidates traversed the discovery/development landscape. For each case, an outside expert from the sponsoring drug company or pivotal clinical trial principal investigator provides guidance and critiques the teams' presentations to the class."}, "Optical Microscopy and Spectroscopy for Biology and Medicine": {"title": "Optical Microscopy and Spectroscopy for Biology and Medicine", "number": "20.487[J]", "description": "Introduces the theory and the design of optical microscopy and its applications in biology and medicine.  The course starts from an overview of basic optical principles allowing an understanding of microscopic image formation and common contrast modalities such as dark field, phase, and DIC.  Advanced microscopy imaging techniques such as total internal reflection, confocal, and multiphoton will also be discussed.  Quantitative analysis of biochemical microenvironment using spectroscopic techniques based on fluorescence, second harmonic, Raman signals will be covered.  We will also provide an overview of key image processing techniques for microscopic data."}, "Biological Chemistry I": {"title": "Biological Chemistry I", "number": "20.507[J]", "description": "Chemical and physical properties of the cell and its building blocks. Structures of proteins and principles of catalysis. The chemistry of organic/inorganic cofactors required for chemical transformations within the cell. Basic principles of metabolism and regulation in pathways, including glycolysis, gluconeogenesis, fatty acid synthesis/degradation, pentose phosphate pathway, Krebs cycle and oxidative phosphorylation, DNA replication, and transcription and translation."}, "Frontiers in Chemical Biology": {"title": "Frontiers in Chemical Biology", "number": "20.554[J]", "description": "Introduction to current research at the interface of chemistry, biology, and bioengineering. Topics include imaging of biological processes, metabolic pathway engineering, protein engineering, mechanisms of DNA damage, RNA structure and function, macromolecular machines, protein misfolding and disease, metabolomics, and methods for analyzing signaling network dynamics. Lectures are interspersed with class discussions and student presentations based on current literature."}, "Statistics for Biological Engineering": {"title": "Statistics for Biological Engineering", "number": "20.560", "description": "Provides basic tools for analyzing experimental data, interpreting statistical reports in the literature, and reasoning under uncertain situations. Topics include probability theory, statistical tests, data exploration, Bayesian statistics, and machine learning. Emphasizes discussion and hands-on learning. Experience with MATLAB, Python, or R recommended."}, "Science and Business of Biotechnology": {"title": "Science and Business of Biotechnology", "number": "20.586[J]", "description": "Covers the new types of drugs and other therapeutics in current practice and under development, the financing and business structures of early-stage biotechnology companies, and the evaluation of their risk/reward profiles. Includes a series of live case studies with industry leaders of both established and emerging biotechnology companies as guest speakers, focusing on the underlying science and engineering as well as core financing and business issues. Students must possess a basic background in cellular and molecular biology."}, "Practical Work Experience": {"title": "Practical Work Experience", "number": "20.920", "description": "For Course 20 students participating in off-campus professional experiences in biological engineering. Before registering for this subject, students must have an offer from a company or organization and must identify a BE supervisor. Upon completion, student must submit a letter from the company or organization describing the experience, along with a substantive final report from the student approved by the MIT supervisor. Subject to departmental approval. Consult departmental undergraduate office."}, "Research Experience in Biopharma": {"title": "Research Experience in Biopharma", "number": "20.930[J]", "description": "Provides exposure to industrial science and develops skills necessary for success in such an environment. Under the guidance of an industrial mentor, students participate in on-site research at a local biopharmaceutical company where they observe and participate in industrial science. Serves as a real-time case study to internalize the factors that shape R&D in industry, including the purpose and scope of a project, key decision points in the past and future, and strategies for execution. Students utilize company resources and work with a scientific team to contribute to the goals of their assigned project; they then present project results to the company and class, emphasizing the logic that dictated their work and their ideas for future directions. Lecture component focuses on professional development."}, "UPOP Engineering Practice Experience": {"title": "UPOP Engineering Practice Experience", "number": "20.EPE", "description": "Provides sophomores with guided practice in finding opportunities and excelling in the world of practice. Building on the skills and relationships acquired in the Engineering Practice Workshop, students receive coaching to articulate goals, invoke the UPOP network of mentors and employers, identify and pursue opportunities and negotiate terms of their summer assignment. Students complete a 10-12 week internship, which includes filing three progress reports, conducting one informational interview, and possibly hosting a site visit by MIT staff. Returning to campus as juniors, UPOP students take part in reflective exercises that aid assimilation of learning objectives and reinforce the cognitive link between all aspects of the UPOP experience and disciplinary fields of study. Sequence begins in the spring of sophomore year and ends in the fall of junior year."}, "UPOP Engineering Practice Workshop": {"title": "UPOP Engineering Practice Workshop", "number": "20.EPW", "description": "Develops foundational skills for the world of practice in science, technology, and engineering. Sophomores receive classroom instruction, and one-on-one and small-group coaching in basics of professional identity building. They attend field trips to local employers and receive job interview practice, coached by industry volunteers. Over IAP, students attend a weeklong Team Training Camp of experiential learning modules - led by MIT faculty with the help of MIT alums and other senior professionals in business, engineering, and science where students participate in creative simulations, team problem-solving challenges, and oral presentations, and practice networking with employers. Enrollment limited."}}