{"Subjects": {"title": "Subjects", "number": "Introductory", "description": "Explores the actor's tools: body, voice, mind, imagination, and the essential self. Through studio exercises, students address issues of honesty and creativity in the theatrical moment, and begin to have a sense of their strengths and limitations as communicating theatrical artists. Provides an opportunity for students to discover their relationship to \"the other\" in the acting partner, the group, the environment, and the audience. Limited to 20 per section."}, "Introduction to Western Music": {"title": "Introduction to Western Music", "number": "21M.011", "description": "Provides a broad overview of Western music from the Middle Ages to the 20th century, with emphasis on late baroque, classical, romantic, and modernist styles. Designed to enhance the musical experience by developing listening skills and an understanding of diverse forms and genres. Major composers and works placed in social and cultural contexts. Weekly lectures feature demonstrations by professional performers and introduce topics to be discussed in sections. Enrollment limited."}, "The Supernatural in Music, Literature and Culture": {"title": "The Supernatural in Music, Literature and Culture", "number": "21M.013[J]", "description": "Explores the relationship between music and the supernatural, focusing on the social history and context of supernatural beliefs as reflected in key literary and musical works from 1600 to the present. Provides an understanding of the place of ambiguity and the role of interpretation in culture, science and art. Explores great works of art by Shakespeare, Verdi, Goethe (in translation), Gounod, Henry James and Benjamin Britten. Readings also include selections from the most recent scholarship on magic and the supernatural. Writing assignments range from web-based projects to analytic essays. No previous experience in music is necessary.  Projected guest lectures, musical performances, field trips. Limited to 36."}, "Introduction to World Music": {"title": "Introduction to World Music", "number": "21M.030", "description": "An introduction to diverse musical traditions of the world. Music from a wide range of geographical areas is studied in terms of structure, performance practice, social use, aesthetics, and cross-cultural contact. Includes hands-on music making, live demonstrations by guest artists, and ethnographic research projects. Enrollment limited by lottery."}, "Fundamentals of Music": {"title": "Fundamentals of Music", "number": "21M.051", "description": "Introduces students to the rudiments of Western music through oral, aural, and written practice utilizing rhythm, melody, intervals, scales, chords, and musical notation. Individual skills are addressed through a variety of approaches, including keyboard practice in the required piano labs. Limited to 20 by lottery. Not open to students who have completed 21M.301 or 21M.302."}, "Introduction to Musical Composition": {"title": "Introduction to Musical Composition", "number": "21M.065", "description": "Through a progressive series of composition projects, students investigate the sonic organization of musical works and performances, focusing on fundamental questions of unity and variety. Aesthetic issues are considered in the pragmatic context of the instructions that composers provide to achieve a desired musical result, whether these instructions are notated in prose, as graphic images, or in symbolic notation. No formal training is required. Weekly listening, reading, and composition assignments draw on a broad range of musical styles and intellectual traditions, from various cultures and historical periods. Limited to 18."}, "Introduction to Music Technology": {"title": "Introduction to Music Technology", "number": "21M.080", "description": "Investigates how technology is used in the analysis, modeling, synthesis and composition of music, and its contribution to the artistic production practice. With an eye towards historical context as well as modern usage, topics include the physics of sound, digital representations of music, the Digital Audio Workstation (DAW), analog and digital synthesis techniques, MIDI and sequencing, electronic instrument design, notation software, generative music systems, and computational analysis of music. Weekly assignments focus on both theory and practice, requiring technical proficiency, creative output, and aesthetic consideration. Enrollment limited."}, "Tuning Systems and Temperament": {"title": "Tuning Systems and Temperament", "number": "21M.121", "description": "Surveys selected tunings of the scale, including Pythagorean, just intonation, mean-tone, and equal temperaments, as well as non-Western systems and the impact of tunings and temperaments on musical composition and performance. Projects based on live demonstration and on reading and listening assignments."}, "Moments in Music: History/Culture": {"title": "Moments in Music: History/Culture", "number": "21M.129", "description": "Examines a particular moment in music history, an era, style, or even the composition of a major work through analysis and cultural context.  Goes into further depth on a particular topic than would be possible in a longer survey.  Periods and topics vary. Examples include Minimalism, The Beatles, A Cappella, or"}, "Moments in Music: Theory and Analysis": {"title": "Moments in Music: Theory and Analysis", "number": "21M.159", "description": "Specific musical compositions or topics in music theory will provide the basis for analysis and close reading. Topics vary. Examples include a Bach Cantana, a Beethoven Quartet, Pierrot Lunaire, or cross-cultural musical analysis. May be repeated once for credit if content differs. Enrollment limited."}, "Music of the Americas": {"title": "Music of the Americas", "number": "21M.215", "description": "A survey of the music of North and South America from the Renaissance to the present, with emphasis on the cross-fertilizations of indigenous and European traditions.  Listening assignments will focus on composers as varied as Copland and Still, Revueltas and Chihara."}, "Medieval and Renaissance Music": {"title": "Medieval and Renaissance Music", "number": "21M.220", "description": "Examines European music from the early Middle Ages until the end of the Renaissance. Includes a chronological survey and intensive study of three topics: chant and its development, music in Italy 1340-1420, and music in Elizabethan England. Focuses on methods and pitfalls in studying music of the distant past. Students' papers, problem sets, and presentations explore lives, genres, and works in depth. Works studied in facsimile of original notation, and from original manuscripts at MIT, where possible."}, "Folk Music of the British Isles and North America": {"title": "Folk Music of the British Isles and North America", "number": "21M.223[J]", "description": "Examines  the production, transmission, preservation and the qualities of folk music in the British Isles and North America from the 18th century to the folk revival of the 1960s and the present. Special emphasis on balladry, fiddle styles, and African-American influences. Enrollment limited."}, "Jazz": {"title": "Jazz", "number": "21M.226", "description": "Historical survey from roots in African and American contexts, including spirituals, blues, and ragtime, through early jazz, Swing, bebop, and post-bop movements, with attention to recent developments. Key jazz styles, the relation of music and society, and major figures such as Armstrong, Ellington, Basie, Goodman, Parker, Monk, Mingus, Coltrane, and others are considered. Some investigation of cross-influences with popular, classical, folk, and rock musics. Enrollment may be limited."}, "Baroque and Classical Music": {"title": "Baroque and Classical Music", "number": "21M.235", "description": "Surveys Baroque and Classical genres: opera, cantata, oratorio, sonata, concerto, quartet and symphony. Includes the composers Monteverdi, Schutz, Purcell, Vivaldi, Bach, Handel, Haydn and Mozart. Bases written essays, projects and oral presentations on live performances as well as listening and reading assignments. Basic music score-reading ability required."}, "Nineteenth-Century Music": {"title": "Nineteenth-Century Music", "number": "21M.250", "description": "Surveys Romantic genres including Lied/song, choral music, opera, piano sonata/character cycle, concerto, and symphony/symphonic poem. Includes the composers Beethoven, Schubert, Berlioz, Chopin, Brahms, Wagner, Verdi, Tchaikovsky, and Mahler. Bases written essays and oral presentations on live performances as well as listening and reading assignments. Basic score-reading ability recommended."}, "Music since 1900": {"title": "Music since 1900", "number": "21M.260", "description": "Surveys musical works drawn from many genres, representing stylistic movements that have transformed classical music over the past hundred years. Focal topics include musical modernism, serialism, neoclassicism, nationalism and ideology, minimalism, and aleatoric and noise composition experiments. Discusses electronic and computer music, and new media and the postmodern present. Begins with Stravinsky's early ballets and ends with music by current MIT composers and other important figures active today. Ability to read music required. Instruction and practice in oral and written communication provided."}, "Studies in Western Music History": {"title": "Studies in Western Music History", "number": "21M.269", "description": "Explores particular questions or repertories in Western classical music. Requires individual participation, presentations, and writing. Topics vary each year. Examples include women in music, musical borrowing, the Ars Nova, Schumann, or music after 1990. May be repeated for credit with permission of instructor."}, "Symphony and Concerto": {"title": "Symphony and Concerto", "number": "21M.271", "description": "Explores the style, form, and history of approximately two dozen pieces of canonical symphonic repertoire. Students write short reviews of musicological articles on the rich cultural history of selected works and complete one project about the state of classical music in contemporary society. Basic score-reading ability required."}, "Opera": {"title": "Opera", "number": "21M.273", "description": "Focuses on the different styles and dramatic approaches exhibited by a range of operas.  Central questions include the process of adaptation from source material, the conventions of different operatic eras, and how the works are staged in contrasting productions. Basic  score-reading ability required."}, "Musicals": {"title": "Musicals", "number": "21M.283", "description": "Covers Broadway works and Hollywood films in depth. Proceeds chronologically, exploring three stage musicals and three films at a time, within four historical categories: breakthrough musicals of the 1920s and '30s; classic \"book musicals\" of the '40s and '50s; modernist and concept musicals of the '60s and '70s; and post modern and cutting-edge works of the '80s and '90s. Attention given to the role of music in relation to script, characterization, and dramatic structure. Final papers involve comparison of one stage and one film work, selected in consultation with the instructor. Oral presentations required and in-class performances encouraged."}, "Film Music": {"title": "Film Music", "number": "21M.284", "description": "Surveys styles and dramatic functions of music for silent films of the 1910s-20s, and music in sound films from the 1930s to the present. Close attention given to landmark scores by American and European composers, including Korngold, Steiner, Rozsa, Prokofiev, Copland, Herrmann, Rota, Morricone, and Williams. Subsidiary topics include new trends in contemporary film-scoring, pop scores, the impact of electronics, and specialized genres (e.g., animation). Students taking the graduate version complete different assignments. Some background in the study of film and/or music is expected."}, "Studies in Western Classical Genres": {"title": "Studies in Western Classical Genres", "number": "21M.289", "description": "Explores topics concerned with specific types of classical music, such as repertories for instrumental soloists and/or small ensembles, orchestral works, solo songs, choral works, or compositions for theater, film, or new media.  Topics vary and may require additional prerequisites or specialized skills such as score-reading or playing an instrument. Examples include the English madrigal, Baroque chamber music, Beethoven's symphonies, French art song, Wagner's 'Ring' cycle, American choral music, Stravinsky's theater works, and the Hollywood film score. May be repeated for credit with permission of instructor."}, "Music of India": {"title": "Music of India", "number": "21M.291", "description": "Focuses on Hindustani classical music of North India, and also involves learning about the ancient foundations of the rich classical traditions of music and dance of all Indian art and culture. Practice of the ragas and talas through the learning of songs, dance, and drumming compositions. Develops insights through listening, readings, and concert attendance."}, "Music of Indonesia": {"title": "Music of Indonesia", "number": "21M.292", "description": "Provides an introduction to the fascinating, intricate music of Indonesia with a special focus on Bali. Students explore diverse musical traditions, engaging deeply with musical structures and techniques through analysis, composition, and extensive hands-on music-making. They also study music's cultural, political, and historical significance through listening, reading, class discussion, and creative, open-ended projects.  Limited to 15."}, "Music of Africa": {"title": "Music of Africa", "number": "21M.293", "description": "Studies musical traditions of sub-Saharan Africa, with focus on West Africa.  Explores a variety of musical practices and their cultural contexts through listening, reading and writing assignments with an emphasis on class discussion.  Includes in-class instruction in drumming, song and dance of Senegal, Ghana, and South Africa, as well as live lecture-demonstrations by guest performers from throughout sub-Saharan Africa. Limited to 15; preference to majors, minors, concentrators. Admittance may be controlled by lottery."}, "Popular Musics of the World": {"title": "Popular Musics of the World", "number": "21M.294", "description": "Focuses on popular music created for and transmitted by mass media. Studies various popular music genres from around the world through listening and reading assignments, while considering issues of musical change, syncretism, Westernization, globalization, the impact of recording industries, and the post-colonial era.  Case studies include bhangra, Afro-pop, reggae, and global hip-hop. Limited to 25; preference to majors, minors, concentrators. Admittance may be controlled by lottery."}, "American Popular Music": {"title": "American Popular Music", "number": "21M.295", "description": "Surveys the development of popular music in the US, and in a cross-cultural milieu, relative to the history and sociology of the last two hundred years. Examines the ethnic mixture that characterizes modern music, and how it reflects many rich traditions and styles (minstrelsy, music-hall, operetta, Tin Pan Alley, blues, rock, electronic media, etc.). Provides a background for understanding the musical vocabulary of current popular music styles. Limited to 20."}, "Studies in World Music": {"title": "Studies in World Music", "number": "21M.299", "description": "Studies of selected topics in ethnomusicology (the study of music in culture).  Topics vary.  Examples include the social lives of musical instruments, music and storytelling, fieldwork methodologies, music and politics, and rhythms of the world.  May be repeated for credit with permission of instructor."}, "Harmony and Counterpoint I": {"title": "Harmony and Counterpoint I", "number": "21M.301", "description": "Covers basic writing skills in music of the common-practice period (Bach to Brahms). Regular written assignments lead to the composition of short pieces. Analyzes representative works from the literature, keyboard laboratory, and sight-singing choir. Students should have experience reading music. Limited to 20 per section."}, "Writing in Tonal Forms I": {"title": "Writing in Tonal Forms I", "number": "21M.303", "description": "Written and analytic exercises based on 18th- and 19th-century small forms and harmonic practice found in music such as the chorale preludes of Bach; minuets and trios of Haydn, Mozart, and Beethoven; and the songs and character pieces of Schubert and Schumann. Musicianship laboratory is required. Limited to 20 per section."}, "Writing in Tonal Forms II": {"title": "Writing in Tonal Forms II", "number": "21M.304", "description": "Further written and analytic exercises in tonal music, focusing on larger or more challenging forms. For example, students might compose a sonata-form movement for piano or a two-part invention in the style of Bach. Students have opportunities to write short works that experiment with the expanded tonal techniques of the late 19th and early 20th centuries. Musicianship laboratory is required. Limited to 20."}, "Techniques of 20th-Century Composition": {"title": "Techniques of 20th-Century Composition", "number": "21M.310", "description": "Students complete written and analytical exercises based on compositional forms and practices from the first half of the 20th century. Areas covered include compositions based upon artificial scales and modes, as in Debussy, Bartok, and Stravinsky; compositions based on atonal pitch organizations, as with Schoenberg and Webern; compositions based on rhythmic process, timbral exploration, and/or non-Western influences. Basic instrumentation will be taught, and compositions will be performed in class."}, "Jazz Harmony and Arranging": {"title": "Jazz Harmony and Arranging", "number": "21M.340", "description": "Basic harmony and theory of mainstream jazz and blues; includes required listening in jazz, writing and analysis work, and two full-scale arrangements. Serves as preparation for more advanced work in jazz with application to rock and pop music. Performance of student arrangements. Limited to 15."}, "Jazz Composition": {"title": "Jazz Composition", "number": "21M.341", "description": "Jazz writing using tonal, modal, and extended compositional approaches as applied to the blues, the 32-bar song form, and post-bop structural designs. Consideration given to a variety of styles and to the ways improvisation informs the compositional process. Study of works by Ellington, Mingus, Parker, Russell, Golson, Coleman, Coltrane, Hancock, Tyner, Davis, and others. Performance of student compositions. Limited to 15."}, "Composing for Jazz Orchestra": {"title": "Composing for Jazz Orchestra", "number": "21M.342", "description": "Explores composition and arrangement for the large jazz ensembles from 1920s foundations to current postmodern practice. Consideration given to a variety of styles and to the interaction of improvisation and composition. Study of works by Basie, Ellington, Evans, Gillespie, Golson, Mingus, Morris, Nelson, Williams, and others. Open rehearsals, workshops, and performances of student compositions by the MIT Festival Jazz Ensemble and the Aardvark Jazz Orchestra. Limited to 15."}, "Music Composition": {"title": "Music Composition", "number": "21M.505", "description": "Directed composition of original writing involving voices and/or instruments. Includes a weekly seminar in composition for the presentation and discussion of work in progress. Students are expected to produce at least one substantive work and perform it in public by the end of the term. Contemporary compositions and major works from 20th-century music literature are studied. Students taking the graduate version complete different assignments."}, "Musical Improvisation": {"title": "Musical Improvisation", "number": "21M.355", "description": "Students study concepts and practice techniques of improvisation in solo and ensemble contexts. Examines relationships between improvisation, composition, and performance based in traditional and experimental approaches. Topics, with occasional guest lectures, may include jazz, non-western music, and western concert music, as well as improvisation with film, spoken word, theater, and dance. Enrollment limited to 15; open by audition to instrumental or vocal performers."}, "Studies in Musical Composition, Theory and Analysis": {"title": "Studies in Musical Composition, Theory and Analysis", "number": "21M.359", "description": "Explores techniques associated with musical composition and/or analysis. Written exercises in the form of music (composition) and/or prose (papers) may be required, depending on the topic. Topics vary each year; examples include fugue, contemporary aesthetics of composition, orchestration, music analysis, or music and mathematics. May be repeated for credit with permission of instructor. Limited to 18."}, "Electronic Music Composition I": {"title": "Electronic Music Composition I", "number": "21M.361", "description": "Students develop basic skills in composition through weekly assignments focusing on sampling and audio processing. Source materials include samples of urban/natural environments, electronically generated sounds, inherent studio/recording noise, and pre-existing recordings. Audio processing includes digital signal processing (DSP) and analog devices. Covers compositional techniques, including mixing, algorithms, studio improvisation, and interaction. Students critique each other's work and give informal presentations on recordings drawn from sound art, experimental electronica, conventional and non-conventional classical electronic works, and popular music. Covers technology, math, and acoustics in varying detail. Limited to 10 per section; preference to Music majors, minors, and concentrators."}, "Electronic Music Composition II": {"title": "Electronic Music Composition II", "number": "21M.362", "description": "Explores sophisticated synthesis techniques, from finely tuned additive to noise filtering and distortion, granular synthesis to vintage emulation. Incorporates production techniques and use of multimedia, with guest lecturers/performers. Considers composing environments such as Max/MSP/Jitter, SPEAR, SoundHack, and Mathematica. Assignments include diverse listening sessions, followed by oral or written presentations, weekly sound studies, critiques, and modular compositions/soundscapes. Prior significant computer music experience preferred. Consult instructor for technical requirements. Limited to 10."}, "Music and Technology": {"title": "Music and Technology", "number": "21M.380", "description": "Explores various technologies in relation to musical analysis, composition, performance, culture, and quantitative methods. Topics vary each term and may include development and impact on society, generative and algorithmic music, recording techniques or procedural sound design. May involve hands-on components such as laptop music ensemble, new instrument building, or comparing the theory and practice of audio recording. Limited to 16."}, "Interactive Music Systems": {"title": "Interactive Music Systems", "number": "21M.585", "description": "Explores audio synthesis, musical structure, human computer interaction (HCI), and visual presentation for the creation of interactive musical experiences. Topics include audio synthesis; mixing and looping; MIDI sequencing; generative composition; motion sensors; music games; and graphics for UI, visualization, and aesthetics. Includes weekly programming assignments in python. Teams build an original, dynamic, and engaging interactive music system for their final project. Limited to 18."}, "Fundamentals of Music Processing": {"title": "Fundamentals of Music Processing", "number": "21M.587", "description": "Analyzes recorded music in digital audio form using advanced signal processing and optimization techniques to understand higher-level musical meaning. Covers fundamental tools like windowing, feature extraction, discrete and short-time Fourier transforms, chromagrams, and onset detection. Addresses analysis methods including dynamic time warping, dynamic programming, self-similarity matrices, and matrix factorization. Explores a variety of applications, such as event classification, audio alignment, chord recognition, structural analysis, tempo and beat tracking, content-based audio retrieval, and audio decomposition. Students taking graduate version complete additional assignments. Enrollment limited."}, "Vocal Repertoire and Performance": {"title": "Vocal Repertoire and Performance", "number": "21M.515", "description": "For the singer and/or pianist interested in collaborative study of solo vocal performance. Historical study of the repertoire includes listening assignments of representative French, German, Italian, and English works as sung by noted vocal artists of the genre. Topics include diction as facilitated by the study of the International Phonetic Alphabet; performance and audition techniques; and study of body awareness and alignment through the Alexander Technique and yoga. Admission by audition. Emerson Vocal Scholars contact department."}, "MIT Symphony": {"title": "MIT Symphony", "number": "21M.421", "description": "Rehearsals prepare works for concerts and recordings. Analyses of musical style, structure, and performance practice are integrated into rehearsals as a means of enriching musical conception and the approach to performance. Likewise, additional scores of particular structural or stylistic interest are read whenever time permits. Admission by audition."}, "Conducting and Score-Reading": {"title": "Conducting and Score-Reading", "number": "21M.423", "description": "Introduces ensemble conducting as a technical and artistic discipline.  Incorporates ear training, score-reading skills and analysis, rehearsal technique, and studies of various philosophies.  Attendance of rehearsals and specific concerts required.  Opportunities include conducting students, professional musicians, and MIT Symphony Orchestra (when possible).  Instrumental proficiency required, although vocalists with keyboard abilities will be accepted.  May be repeated once for credit with permission of instructor."}, "MIT Wind Ensemble": {"title": "MIT Wind Ensemble", "number": "21M.426", "description": "Designed for advanced instrumentalists who are committed to the analysis, performance, and recording of woodwind, brass, and percussion literature from the Renaissance through the 21st century. The repertoire consists primarily of music for small and large wind ensembles. May include ensemble music from Gabrieli to Grainger, Schuller, Mozart, Dvorak, and various mixed media including strings. Performance of newly commissioned works. Opportunities for solo work and work with recognized professional artists and composers. Admission by audition."}, "MIT Festival Jazz Ensemble": {"title": "MIT Festival Jazz Ensemble", "number": "21M.442", "description": "Designed for instrumentalists dedicated to the analysis, performance, and recording of traditional and contemporary jazz ensemble compositions. Instrumentation includes saxophones, trumpets, trombones, piano, guitar or vibraphone, bass, percussion and occasionally french horn, double reeds, and strings. Provides opportunities to work with professional jazz artists and perform commissioned works by recognized jazz composers. Experience in improvisation preferred but not required. Admission by audition."}, "Studio Accompanying for Pianists": {"title": "Studio Accompanying for Pianists", "number": "21M.451", "description": "Open by audition to pianists who wish to explore and develop their talents as accompanists.  Pianists are paired with a music scholarship recipient and attend that student's private lesson each week.  Accompanists prepare independently, rehearse with the student partner, and provide accompaniment at a juried recital or masterclass each term.  Under supervision for music faculty and private lesson instructors, pianists may work with one or two scholarship students each term at 3 units each or one student in 21M.480/21M.512 for 6 units.  Subject satisfies the performance requirement for pianists receiving music scholarships."}, "MIT Senegalese Drum Ensemble": {"title": "MIT Senegalese Drum Ensemble", "number": "21M.460", "description": "A performance ensemble focusing on the sabar drumming tradition of Senegal, West Africa. Study and rehearse Senegalese drumming techniques and spoken word. Perform in conjunction with MIT Rambax drumming group. No previous experience necessary, but prior enrollment in 21M.030 or 21M.293 strongly recommended. Limited to 30 by audition."}, "Advanced Music Performance": {"title": "Advanced Music Performance", "number": "21M.512", "description": "Designed for students who demonstrate considerable technical and musical skills and who wish to develop them through intensive private study. Students must take a weekly lesson, attend a regular performance seminar, and participate in a departmental performing group. Full-year commitment required. Information about lesson fees, scholarships, and auditions available in Music Section Office. Students taking the graduate version complete different assignments. Admission by audition."}, "Emerson Scholar Solo Recital": {"title": "Emerson Scholar Solo Recital", "number": "21M.490", "description": "Solo 50-minute recital prepared with a private teacher and approved by the Emerson Private Studies Committee based on evidence of readiness shown in the Fall Term performances. See Music and Theater Arts website for application deadlines and conditions. Restricted to Emerson Scholars."}, "Advanced Seminar in Music": {"title": "Advanced Seminar in Music", "number": "21M.500", "description": "Seminar that develops analytic and research skills in music history/culture or theory/composition. Topics vary, but are organized around a particular methodology, musical topic, or collection of works, that allow for application to a variety of interests and genres. Strong emphasis on student presentations, discussion, and a substantial writing project. May be repeated for credit with permission from instructor."}, "Emerson Scholars Solo Recital": {"title": "Emerson Scholars Solo Recital", "number": "21M.525", "description": "Emerson Scholars may receive credit for a solo spring recital that has been prepared with and approved by the private teacher and the Emerson Private Studies Committee. Approval based on evidence of readiness shown in first term master classes. Restricted to Emerson Scholars."}, "Musical Aesthetics and Media Technology": {"title": "Musical Aesthetics and Media Technology", "number": "21M.580[J]", "description": "In-depth exploration of contemporary concepts in music and media. Studies recent music that uses advanced technology, and the artistic motivations and concerns implied by the new media. Practical experience with computer music technology, including MIDI and post-MIDI systems. Special emphasis on the interactive systems for professionals as well as amateurs. Midterm paper and term project required."}, "Projects in Media and Music": {"title": "Projects in Media and Music", "number": "21M.581[J]", "description": "Current computer music concepts and practice. Project-based work on research or production projects using the Media Lab's computer music, interactive, and media resources. Requires significant studio work and a term project. Projects based on class interests and skills, and may be individually or group-based. May be repeated for credit with permission of instructor."}, "Introduction to Acting": {"title": "Introduction to Acting", "number": "21M.600", "description": "Explores the actor's tools: body, voice, mind, imagination, and the essential self. Through studio exercises, students address issues of honesty and creativity in the theatrical moment, and begin to have a sense of their strengths and limitations as communicating theatrical artists. Provides an opportunity for students to discover their relationship to \"the other\" in the acting partner, the group, the environment, and the audience. Limited to 20 per section."}, "Drawing for Designers": {"title": "Drawing for Designers", "number": "21M.601", "description": "Explores drawing as a fundamental component of the design process. In-class drawing exercises focus on developing the hand-to-eye relationship and pre-visualization skills essential to any designer. Studies the use drawing as a route to understanding space and form and achieving accuracy through expression. By drawing figures, landscapes and/or still life compositions in a variety of media, students investigate the figure/ground relationship while dealing with tone, line, and composition, which are all requisite elements of design. Provides exposure to designers who have used drawing as a central component of their work. Students create a portfolio that includes in-class drawings, studies done outside of class, and one research-based written project. Limited to 20."}, "Introduction to Design for the Theater": {"title": "Introduction to Design for the Theater", "number": "21M.603", "description": "Introduces the fundamental skills and concepts of scenography through a series of individual design projects structured to explore the relationship of the performer to the environment, the interrelation of lighting and stage design, and the evolution of visual narrative. Develops a basic visual literacy for the theater by honing skills in drawing, model building, 3-D modeling, digital image manipulation, and color theory. Projects complimented by study of artworks and theories by Cindy Sherman, Sol LeWitt, Alan Kaprow, Robert Wilson, Bertolt Brecht, Caspar Neher, and others. Enrollment may be limited."}, "Playwriting I": {"title": "Playwriting I", "number": "21M.604[J]", "description": "Introduces the craft of writing for the theater, with special attention to the basics of dramatic structure. Through weekly assignments and in-class exercises, students explore character, conflict, language and plasticity in scenes and short plays. In workshop format, students present individual work for feedback and heavily revise their work based on that response. Readings include short plays, which provide exposure to a variety of styles and voices."}, "Voice and Speech for the Actor": {"title": "Voice and Speech for the Actor", "number": "21M.605", "description": "Concentrates upon freeing the natural voice through awareness of physical, vocal and, at times, emotional habits and the willingness and desire to experience change.  Teaches progression of contemporary approaches to voice through in-class vocal exercises.  Students use sonnets or poems as vehicles to explore the components of language and the need to communicate and reveal oneself through the voice.  Designed for students interested in theater or developing their voices for presentations and professional speaking. Limited to 14; preference to Theater majors, minors, and concentrators who have pre-registered."}, "Introduction to Stagecraft": {"title": "Introduction to Stagecraft", "number": "21M.606", "description": "Provides a foundation in theater technology, examining the creation of a theatrical production from conception to performance. Explores the realization of an artistic and structural vision for a play, taking into account all facets of technical theater: history of productions, types of technical roles, design, drafting, carpentry, costume, lighting, rigging, stage management, sound, and video. Students serve on the production team responsible for building, installing and/or running the department's show that semester. Limited to 18."}, "Beginning Screenwriting": {"title": "Beginning Screenwriting", "number": "21M.608", "description": "Explores the fundamentals of screenplay writing.  Presents skills to create compelling characters and stories in different dramatic genres (comedy, drama). In addition to their own writing, students read a selection of screenplays and watch short films that form the basis of class discussion early in the term.  Class is modeled on a professional development workshop in which participants, over the course of the term, write a short screenplay, including a final draft. Enrollment limited."}, "Foundations of Theater Practice": {"title": "Foundations of Theater Practice", "number": "21M.611", "description": "Introduces the ideas, processes, and aesthetic issues that comprise the creation of the theatrical event. Guest artists and faculty members reveal how practitioners approach the narrative of a play in each discipline (directing, design, acting, dramaturgy, playwriting). Readings and in-class exercises help students understand and experience the basic creative impulse in each area, as well as how these areas join to form a theatrical whole."}, "Acting with the Camera": {"title": "Acting with the Camera", "number": "21M.624", "description": "Studio workshop explores the discipline of acting for the camera through in-class exercises that focus on the creative challenges inherent to both filming and being filmed. Investigates the performer in the history of cinema, television, and multimedia stage performance through readings, screenings, and experimentation with the theory and practice of performing for and with the camera. Culminates in student-written, edited, directed, and acted short films. Instruction in written and oral communication provided. Limited to 20."}, "Motion Theater": {"title": "Motion Theater", "number": "21M.645", "description": "Examines the theatrical event from the perspective of composition in a performance workshop. Studio exercises address the process of developing a theatrical work through an internalized understanding of compositional principles in theater. Examines physical action in time and space. Includes outside readings, videos, short essays, and in-class discussions. Provides the performer, director, choreographer, designer or writer opportunities to engage with large and small group ensembles in creation of theatrical events. Topics include image, motion, shape, repetition, gesture, and spatial relationship. Preference to majors, minors, concentrators. Admittance may be controlled by lottery."}, "Sport as Performance": {"title": "Sport as Performance", "number": "21M.690", "description": "Seminar investigates the aesthetics of sport as theatrical performance and explores the performance of race, gender, class, nation, and sexuality in sport. Readings drawn from theatre/performance studies, anthropology, sociology, ethnic studies, gender studies, history, and kinesiology. Topics include barnstorming, Olympics, Title IX, Native American mascots, and a variety of sports ranging from football to figure skating. Limited to 18."}, "China on Stage": {"title": "China on Stage", "number": "21M.701", "description": "Explores the role theater productions have played in shaping Chinese society, politics, and cultural exchange during the past century. Topics include censorship, audience reception, and current translingual and cross-cultural trends. Examines plays in English translation, videos, photographs, archival materials, and English-language books and articles about Chinese theater. Enrollment limited."}, "Music Theater Workshop": {"title": "Music Theater Workshop", "number": "21M.704", "description": "Introduces applications of music in theater and performance.  Encourages experimentation with different genres of singing, acting, and movement by exploring an array of historical and contemporary styles and techniques. Students develop and perform their own original songs and textual materials, gaining a theoretical and practical understanding of the actor's contribution to the dynamic form of musical theater. Previous experience in musical theater not required."}, "The Actor and the Text": {"title": "The Actor and the Text", "number": "21M.705", "description": "Gives students who have begun the process of bringing themselves to a dramatic moment the opportunity to apply their skills to scripted material. Studio work in this class further develops the completeness, spontaneity, and honesty of expression of the actor's body, imagination, and voice; and introduces written material and the problems of synthesizing the self, the moment, and the scripted word. Weekly rehearsals with a scene partner. Enrollment may be limited."}, "Asian American Theater": {"title": "Asian American Theater", "number": "21M.706", "description": "Explores the history and impact of Asian American theater. Readings include plays and materials about cultural and political issues, family, and identity. Course includes short formal and creative writing assignments and scene work resulting in a collaborative final performance. Limited to 18."}, "Script Analysis": {"title": "Script Analysis", "number": "21M.710", "description": "Focuses on reading a play's script critically and theatrically, with a view to mounting a coherent production. Through careful, intensive analysis of a variety of plays from different periods and aesthetics, a pattern emerges for discerning what options exist for interpreting a script from the distinct perspectives of the playwright, the actor, the designer, and the director. Students discuss the consequences of those options for production.  Enrollment limited."}, "Production Seminar": {"title": "Production Seminar", "number": "21M.711", "description": "Pursues detailed study of a particular playtext or theme and is related to some planned production activity during the following IAP. Seminar activities may include guest speakers from various disciplines who approach some aspect of the playtext or theme from the perspective of their fields; various theatrical practitioners; and critical and scholarly presentations by seminar members. Participation in the IAP production is not required."}, "Contemporary American Theater": {"title": "Contemporary American Theater", "number": "21M.714", "description": "Examines the exciting terrain of contemporary American writing for the theater, focusing on what is known in New York as \"Off Broadway,\" \"downtown,\" or \"indie theater.\" Students read work by influential playwrights from earlier generations alongside plays by new voices currently in production in Boston, New York, and across the country. Students also examine the changing institution of American theater, reading a selection of plays in order to determine what constellation of issues and concerns they engage. Discussions unpack how these plays reflect, challenge and re-construct the idea of America in the 21st century. Enrollment limited."}, "Costume Design": {"title": "Costume Design", "number": "21M.732", "description": "Studio workshop designed for students who possess a basic understanding of the principles of design and seek a more intensive study of costume. Students develop designs through a collaborative creative process that incorporates production dramaturgy and script analysis, and map those findings to a scenographically charged directorial concept. Fosters period research, conceptual design, and rendering skills through practical studio exercises. Instruction in life drawing, visual presentation, and basic costume construction provides the tools for applying conceptual design skills in performance."}, "Set Design": {"title": "Set Design", "number": "21M.733", "description": "Investigates the creation of set design for live performance. Students develop designs related to current production projects at MIT. Focuses on developing the designer's communication tools, particularly in the areas of visual research, 3-D digital model making, and design presentation. Examines the relationship of set design to theater architecture, emerging media technologies and dramaturgies of the 20th and 21st centuries. In addition to creating their own designs, students research, write about, and present the work and practice of a set designer."}, "Lighting Design": {"title": "Lighting Design", "number": "21M.734", "description": "Explores the history, concepts and techniques of sculpting space with light within a contemporary context. Students experiment with a wide range of approaches, tools, and skills to develop their own creative vision. Focuses on discrete forms that include live performance, installation, architecture, and developments in applied technologies. Studio projects alternate between conceptual studies and realized designs reflective of students' own unique interests and talents. Enrollment may be limited."}, "Technical Design for Performance": {"title": "Technical Design for Performance", "number": "21M.735", "description": "Studio examines the role of the technical designer as an integral member of an ensemble.  Focusing on the artistic process, students develop their own unique approaches to stage design, lighting, sound, video design and other new media applications for the performing arts.  They also explore an array of pre-production research and rehearsal techniques and analyze dramatic texts.  Introduces theoretical and practical aspects of technical design, from the budgeting of time and selection of materials, to use of new technologies.  Culminates in a public showing of final design projects for an invited audience."}, "Interactive Design and Projection for Live Performance": {"title": "Interactive Design and Projection for Live Performance", "number": "21M.737", "description": "Studies design, history, artistic purposes, and programming techniques involved in the development of interactive performance design systems for controlling video projection, media, and lighting for live performances. Includes readings, viewings of historical and contemporary works, and in class-practice and performance. Students use motion-sensing input devices, such as the Kinect, infrared-light tracking, accelerometers, live video, and generative graphics, to create interactive design systems.  Enrollment limited."}, "Playwrights' Workshop": {"title": "Playwrights' Workshop", "number": "21M.789", "description": "Continued work in the development of play scripts for the theater. Writers work on one-act plays in weekly workshop meetings in addition to individual script meetings with the instructor. All students see their work presented as a stage reading during the MTA Playwrights Lab. Students taking graduate version complete additional assignments.  Enrollment is limited to 10."}, "Director's Craft": {"title": "Director's Craft", "number": "21M.790", "description": "Explores several models of directing, each with its unique structures, philosophy, terminology, and techniques. Develops an individual voice for each student and clarity in his/her directorial point of view. Class sessions concentrate on how a point of view is arrived at through analysis of material and the way the results are rendered with the basic tools of theater. All points of view are honored as long as they can be actively supported by the work. Provides instruction and practice in oral and written communication.  Students taking graduate version complete additional assignments."}, "All the World's a Stage: Socio-Political Perspectives in Global Performance": {"title": "All the World's a Stage: Socio-Political Perspectives in Global Performance", "number": "21M.800", "description": "Investigates repertoire from international creators of theater, opera, performance art, and dance. Explores diverse storytelling and directorial points of view, examining the contexts which inform approaches to performance making. Discusses specific cultural and political shifts that have inspired the work of international artists, such as Marina Abramovic (Serbia), Pina Bausch (Germany), Nora Chipaumire (Zimbabwe), Ping Chong (US/Canada), Peter Sellars (US), and The Yes Men (US). Weekly readings, screenings and guest artists provide the foundation for an understanding of the role of director as an artist who finds inspiration in the contradictions of the world. Students taking graduate version complete additional assignments."}, "All the Worlds a Stage: Socio-Political Perspectives in Global Performance": {"title": "All the Worlds a Stage: Socio-Political Perspectives in Global Performance", "number": "21M.801", "description": "Investigates repertoire from international creators of theater, opera, performance art, and dance. Explores diverse storytelling and directorial points of view, examining the contexts which inform approaches to performance making. Discusses specific cultural and political shifts that have inspired the work of international artists, such as Marina Abramovic (Serbia), Pina Bausch (Germany), Nora Chipaumire (Zimbabwe), Ping Chong (US/Canada), Peter Sellars (US), and The Yes Men (US). Weekly readings, screenings and guest artists provide the foundation for an understanding of the role of director as an artist who finds inspiration in the contradictions of the world. Students taking graduate version complete additional assignments."}, "Performance and Design Workshop": {"title": "Performance and Design Workshop", "number": "21M.803", "description": "Provides directed practice in the disciplines of performance practice, including design, acting, directing, technical theater, management, dramaturgy and other creative fields. Students test and refine their skills by participating in the creation of produced plays, intensive workshops, installations and other design or performance projects in dance, film, music theater, opera, and other performing arts events. Students work closely with faculty, peers and guest artists. Students seeking to design individual performance and design workshops must be supervised by a theater arts faculty member, and obtain his or her written approval."}, "Applied Performance and Design Production": {"title": "Applied Performance and Design Production", "number": "21M.806", "description": "Provides opportunities for applied practice in the disciplines of performance, including acting, directing, playwriting, design, technical theater, dramaturgy, and management. Students test and refine their skills in the prototyping of design projects, installations, plays, dance, film, music theater, opera, and other performing arts events. They also apply theory and practice while tracing the research and rehearsal process through production and public presentation in the theater or in the studio. Students seeking to design an applied project must be supervised by a theater arts faculty member, and obtain his or her written approval."}, "Performance and Design Intensive": {"title": "Performance and Design Intensive", "number": "21M.809", "description": "Multidisciplinary, term-long, independent study geared toward the development of significant artistic and technical projects in performance and design. Students pursue projects in an array of fields and are invited to propose artistic and research projects as actors, directors, designers, dramaturges, and/or technical designers. Often in conjunction with Theater Arts-produced productions, proposals for intensives must be vetted and supervised by a member of the Theater Arts faculty with whom the student will work over the course of term."}, "Acting: Techniques and Style": {"title": "Acting: Techniques and Style", "number": "21M.835", "description": "Refines the student actor's use of the language of the stage with work on text and physical presentation. Explores issues of style, including the understanding and honoring, in performance, of the specific requirements from several different periods of the Western theatrical tradition. Periods may differ from term to term. Students taking graduate versions complete additional assignments."}, "Performance Media": {"title": "Performance Media", "number": "21M.841", "description": "Integrates media and communication technologies in performing arts. Studio exercises provide a forum for experimentation. Contemporary and historical techniques for media integration examined through readings, viewing videos and short written essays. Technologies examined include digital imaging, composite and live feed digital video, and web-based performance. Engages the designer, director, choreographer, performer, visual artist or programmer in the practice of integrating media into live art events. Equipment is provided. Students taking graduate version complete additional assignments."}, "Live Cinema Performance": {"title": "Live Cinema Performance", "number": "21M.843", "description": "Interdisciplinary studio merges the disciplines of the performer, designer, cinematographer, director, playwright and technician, and examines the deep integration of live theatrical and cinematic idioms. Studio exercises, readings, field trips and in-class presentations provide the opportunity to study the history and theory surrounding the development of genre, and to engage the practice from both sides of the camera. Includes guest artists, lectures, and master classes. Students regularly test what they develop in studio on the stage. Each class focuses on a particular dramatist, theme, or artistic genre and culminates in a full-length collaboration that will be presented in the final week of class for an invited audience. Students taking graduate version complete additional assignments. Enrollment Limited."}, "Topics in Performance Studies": {"title": "Topics in Performance Studies", "number": "21M.846", "description": "Multidisciplinary lecture/workshop engages students in a variety of approaches to the study and practice of performance as an area of aesthetic and social interaction. Special attention paid to the use of diverse media in performance. Interdisciplinary approaches to study encourage students to seek out material histories of performance and practice. May be repeated for credit if topics differ."}, "Performance Studies: Advanced Theories of Sport": {"title": "Performance Studies: Advanced Theories of Sport", "number": "21M.848", "description": "Seminar explores connections between athletics and theatre, performance studies, sociology, anthropology, and history. Focuses on performance of nation, race, and gender in sport, and how sport performs in society. Specific topics selected based on the research focus of each student. Enrollment limited."}, "Independent Study in Performance and Design": {"title": "Independent Study in Performance and Design", "number": "21M.851", "description": "Multidisciplinary independent study provides opportunity for individual practica in the performing arts. While opportunities may include directed theoretical research and practice in production and performance with permanent and visiting faculty, students are encouraged to propose independent programs of study to a member of the theater arts faculty. Permission of supervising faculty member required."}, "Pre-Thesis Tutorial": {"title": "Pre-Thesis Tutorial", "number": "21M.THT", "description": "Definition of and early-stage work on thesis project leading to 21M.THU Undergraduate Thesis in Music or Theater Arts.  Taken during the first term, or during IAP, of the student's two-term commitment to the thesis project.  Student works closely with an individual faculty tutor. Limited to Music or Theater Arts Majors."}, "Undergraduate Thesis": {"title": "Undergraduate Thesis", "number": "21M.THU", "description": "Completion of work on senior major thesis in Music or Theater Arts under supervision of a faculty tutor. Includes oral presentation of thesis project early in the term, assembling and revising final text and meeting at the close with a committee of Music or Theater Arts faculty evaluators to discuss successes and limitations of the project. Limited to Music or Theater Arts majors."}}