{"Introduction to Modeling and Simulation": {"title": "Introduction to Modeling and Simulation", "number": "22.00", "description": "Basic concepts of computer modeling and simulation in science and engineering. Uses techniques and software for simulation, data analysis and visualization. Continuum, mesoscale, atomistic and quantum methods used to study fundamental and applied problems in physics, chemistry, materials science, mechanics, engineering, and biology. Examples drawn from the disciplines above are used to understand or characterize complex structures and materials, and complement experimental observations."}, "Introduction to Nuclear Engineering and Ionizing Radiation": {"title": "Introduction to Nuclear Engineering and Ionizing Radiation", "number": "22.01", "description": "Provides an introduction to nuclear science and its engineering applications. Describes basic nuclear models, radioactivity, nuclear reactions and kinematics. Covers the interaction of ionizing radiation with matter, with an emphasis on radiation detection, radiation shielding, and radiation effects on human health. Presents energy systems based on fission and fusion nuclear reactions, as well as industrial and medical applications of nuclear science."}, "Nuclear Engineering: Science, Systems and Society": {"title": "Nuclear Engineering: Science, Systems and Society", "number": "22.011", "description": "Introduction to the basic physics of nuclear energy and radiation, with an emphasis on the unique attributes and challenges of nuclear energy as a low-carbon solution. Discusses peaceful applications of ionizing radiation, such as reactors for materials science research, nuclear medicine, and security initiatives. Explores fission energy, establishing the scientific, engineering, and economic basis for power reactors. Describes the latest advances in nuclear reactor technology. Introduces magnetic fusion energy research, with lectures covering the scientific and engineering basis of tokamaks, the state-of-the-art in world fusion experiments, and the MIT vision for a high-magnetic field fusion reactor. Uses radiation detection equipment to explore radioactivity in everyday life."}, "Ethics for Engineers": {"title": "Ethics for Engineers", "number": "22.014", "description": "Integrates classical readings that provide an overview of ethics with a survey of case studies that focus on ethical problems arising in the practice of engineering. Readings taken from a variety of sources, such as Aristotle, Machiavelli, Bacon, Hobbes, Locke, the Founding Fathers, and the Bible. Case studies include written analyses and films that address engineering disasters, biotechnology, court cases, ethical codes, and the ultimate scope and aims of engineering. Students taking independent inquiry version 6.9041 expand the scope of their term project. Students taking 20.005 focus their term project on a problem in biological engineering in which there are intertwined ethical and technical issues."}, "Introduction to Applied Nuclear Physics": {"title": "Introduction to Applied Nuclear Physics", "number": "22.02", "description": "Covers basic concepts of nuclear physics with emphasis on nuclear structure and interactions of radiation with matter. Topics include elementary quantum theory; nuclear forces; shell structure of the nucleus; alpha, beta and gamma radioactive decays; interactions of nuclear radiations (charged particles, gammas, and neutrons) with matter; nuclear reactions; fission and fusion."}, "Quantum Theory of Radiation Interactions": {"title": "Quantum Theory of Radiation Interactions", "number": "22.51", "description": "Introduces elements of applied quantum mechanics and statistical physics. Starting from the experimental foundation of quantum mechanics, develops the basic principles of interaction of electromagnetic radiation with matter. Introduces quantum theory of radiation, time-dependent perturbation theory, transition probabilities and cross sections. Applications are to controlling coherent and decoherent dynamics with examples from quantum information processing. Students taking graduate version complete additional assignments."}, "Introduction to Nuclear Design": {"title": "Introduction to Nuclear Design", "number": "22.03", "description": "Focuses on design thinking, rapid prototyping, overcoming fixation, and optimizing solutions within design constraints as applied to ideas relevant to nuclear science and engineering. Includes hands-on introductions to modern, rapid prototyping tools (laser cutter, 3D printer) in the context of a nuclear design problem, followed by discovery-based labs illustrating nuclear concepts. Culminates in a student-directed nuclear making experience. Enrollment limited; preference to Course 22 majors and minors."}, "Nuclear Systems Design Project": {"title": "Nuclear Systems Design Project", "number": "22.033", "description": "Group design project involving integration of nuclear physics, particle transport, control, heat transfer, safety, instrumentation, materials, environmental impact, and economic optimization. Provides opportunity to synthesize knowledge acquired in nuclear and non-nuclear subjects and apply this knowledge to practical problems of current interest in nuclear applications design. Past projects have included using a fusion reactor for transmutation of nuclear waste, design and implementation of an experiment to predict and measure pebble flow in a pebble bed reactor, and development of a mission plan for a manned Mars mission including the conceptual design of a nuclear powered space propulsion system and power plant for the Mars surface, a lunar/Martian nuclear power station and the use of nuclear plants to extract oil from tar sands.  Students taking graduate version complete additional assignments."}, "Integration of Reactor Design, Operations, and Safety": {"title": "Integration of Reactor Design, Operations, and Safety", "number": "22.39", "description": "Integration of reactor physics and engineering sciences into nuclear power plant design focusing on designs that are projected to be used in the first half of this century. Topics include materials issues in plant design and operations, aspects of thermal design, fuel depletion and fission-product poisoning, and temperature effects on reactivity. Safety considerations in regulations and operations such as the evolution of the regulatory process, the concept of defense in depth, general design criteria, accident analysis, probabilistic risk assessment, and risk-informed regulations. Students taking graduate version complete additional assignments."}, "Social Problems of Nuclear Energy": {"title": "Social Problems of Nuclear Energy", "number": "22.04[J]", "description": "Surveys the major social challenges for nuclear energy.     Topics include the ability of nuclear power to help mitigate climate change; challenges associated with ensuring nuclear safety; the effects of nuclear accidents; the management of nuclear waste; the linkages between nuclear power and nuclear weapons, the consequences of nuclear war; and political challenges to the safe and economic regulation of the nuclear industry.  Weekly readings presented from both sides of the debate, followed by in-class discussions. Instruction and practice in oral and written communication provided. Limited to 18."}, "Neutron Science and Reactor Physics": {"title": "Neutron Science and Reactor Physics", "number": "22.05", "description": "Introduces fundamental properties of the neutron. Covers reactions induced by neutrons, nuclear fission, slowing down of neutrons in infinite media, diffusion theory, the few-group approximation, point kinetics, and fission-product poisoning. Emphasizes the nuclear physics bases of reactor design and its relationship to reactor engineering problems."}, "Systems Analysis of the Nuclear Fuel Cycle": {"title": "Systems Analysis of the Nuclear Fuel Cycle", "number": "22.251", "description": "Study of the relationship between the technical and policy elements of the nuclear fuel cycle. Topics include uranium supply, enrichment, fuel fabrication, in-core reactivity and fuel management of uranium and other fuel types, used fuel reprocessing and waste disposal. Principles of fuel cycle economics and the applied reactor physics of both contemporary and proposed thermal and fast reactors are presented. Nonproliferation aspects, disposal of excess weapons plutonium, and transmutation of long lived radioisotopes in spent fuel are examined. Several state-of-the-art computer programs relevant to reactor core physics and heat transfer are provided for student use in problem sets and term papers. Students taking graduate version complete additional assignments."}, "Materials Performance in Extreme Environments": {"title": "Materials Performance in Extreme Environments", "number": "22.054[J]", "description": "Studies the behavior of materials in extreme environments typical of those in which advanced energy systems (including fossil, nuclear, solar, fuel cells, and battery) operate. Takes both a science and engineering approach to understanding how current materials interact with their environment under extreme conditions. Explores the role of modeling and simulation in understanding material behavior and the design of new materials. Focuses on energy and transportation related systems."}, "Radiation Biophysics": {"title": "Radiation Biophysics", "number": "22.55[J]", "description": "Provides a background in sources of radiation with an emphasis on terrestrial and space environments and on industrial production. Discusses experimental approaches to evaluating biological effects resulting from irradiation regimes differing in radiation type, dose and dose-rate.  Effects at the molecular, cellular, organism, and population level are examined.  Literature is reviewed identifying gaps in our understanding of the health effects of radiation, and responses of regulatory bodies to these gaps is discussed. Students taking graduate version complete additional assignments."}, "Engineering of Nuclear Systems": {"title": "Engineering of Nuclear Systems", "number": "22.06", "description": "Using the basic principles of reactor physics, thermodynamics, fluid flow and heat transfer, students examine the engineering design of nuclear power plants. Emphasizes light-water reactor technology, thermal limits in nuclear fuels, thermal-hydraulic behavior of the coolant, nuclear safety and dynamic response of nuclear power plants."}, "Fusion Energy": {"title": "Fusion Energy", "number": "22.62", "description": "Basic nuclear physics and plasma physics for controlled fusion. Fusion cross sections and consequent conditions required for ignition and energy production. Principles of magnetic and inertial confinement. Description of magnetic confinement devices: tokamaks, stellarators and RFPs, their design and operation. Elementary plasma stability considerations and the limits imposed. Plasma heating by neutral beams and RF. Outline design of the ITER \"burning plasma\" experiment and a magnetic confinement reactor."}, "Electronics, Signals, and Measurement": {"title": "Electronics, Signals, and Measurement", "number": "22.071", "description": "Provides the knowledge necessary for reading schematics and designing, building, analyzing, and testing fundamental analog and digital circuits. Students construct interactive examples and explore the practical uses of electronics in engineering and experimental science, including signals and measurement fundamentals. Uses state-of-the-art hardware and software for data acquisition, analysis, and control. Suitable for students with little or no previous background in electronics. Limited to 20."}, "Corrosion: The Environmental Degradation of Materials": {"title": "Corrosion: The Environmental Degradation of Materials", "number": "22.72", "description": "Applies thermodynamics and kinetics of electrode reactions to aqueous corrosion of metals and alloys. Application of advanced computational and modeling techniques to evaluation of materials selection and susceptibility of metal/alloy systems to environmental degradation in aqueous systems. Discusses materials degradation problems in marine environments, oil and gas production, and energy conversion and generation systems, including fossil and nuclear.  Students taking graduate version complete additional assignments."}, "Radiation Damage and Effects in Nuclear Materials": {"title": "Radiation Damage and Effects in Nuclear Materials", "number": "22.74[J]", "description": "Studies the origins and effects of radiation damage in structural materials for nuclear applications. Radiation damage topics include formation of point defects, defect diffusion, defect reaction kinetics and accumulation, and differences in defect microstructures due to the type of radiation (ion, proton, neutron). Radiation effects topics include detrimental changes to mechanical properties, phase stability, corrosion properties, and differences in fission and fusion systems. Term project required. Students taking graduate version complete additional assignments."}, "Principles of Nuclear Chemical Engineering and Waste Management": {"title": "Principles of Nuclear Chemical Engineering and Waste Management", "number": "22.78", "description": "Introduces scientific and engineering aspects of chemical engineering and waste management applied to reactors and the fuel cycle. Includes chemical behavior in reactors (normal and accident), spent nuclear fuel aging, separation processes in reprocessing (aqueous, pryo, and molten salt), and waste treatment processes. Addresses management of radioactive wastes, including waste forms, classification, fundamental principles, governing equations for radionuclide transport in the environment, performance assessment of geological waste disposal systems, and implications of advanced fuel cycles. Students taking graduate version complete additional assignments."}, "Introduction to Sustainable Energy": {"title": "Introduction to Sustainable Energy", "number": "22.081[J]", "description": "Assessment of current and potential future energy systems. Covers resources, extraction, conversion, and end-use technologies, with emphasis on meeting 21st-century regional and global energy needs in a sustainable manner. Examines various renewable and conventional energy production technologies, energy end-use practices and alternatives, and consumption practices in different countries. Investigates their attributes within a quantitative analytical framework for evaluation of energy technology system proposals. Emphasizes analysis of energy propositions within an engineering, economic and social context. Students taking graduate version complete additional assignments. Limited to juniors and seniors."}, "Principles of Nuclear Radiation Measurement and Protection": {"title": "Principles of Nuclear Radiation Measurement and Protection", "number": "22.09", "description": "Combines lectures, demonstrations, and experiments.  Review of radiation protection procedures and regulations; theory and use of alpha, beta, gamma, and neutron detectors; applications in imaging and dosimetry; gamma-ray spectroscopy; design and operation of automated data acquisition experiments using virtual instruments.  Meets with  graduate subject 22.90, but homework assignments and examinations differ. Instruction and practice in written communication provided."}, "22.093 Independent Project in Nuclear Science and Engineering": {"title": "22.093 Independent Project in Nuclear Science and Engineering", "number": "22.091,", "description": "For undergraduates who wish to conduct a one-term project of theoretical or experimental nature in the field of nuclear engineering, in close cooperation with individual staff members. Topics and hours arranged to fit students' requirements. Projects require prior approval by the Course 22 Undergraduate Office. 22.093 is graded P/D/F."}, "Topics in Nuclear Science and Engineering": {"title": "Topics in Nuclear Science and Engineering", "number": "22.099", "description": "Provides credit for work on material in nuclear science and engineering outside of regularly scheduled subjects. Intended for study abroad with a student exchange program or an approved one-term or one-year study abroad program. Credit may be used to satisfy specific SB degree requirements. Requires prior approval. Consult department."}, "UPOP Engineering Practice Experience": {"title": "UPOP Engineering Practice Experience", "number": "22.EPE", "description": "Provides sophomores with guided practice in finding opportunities and excelling in the world of practice. Building on the skills and relationships acquired in the Engineering Practice Workshop, students receive coaching to articulate goals, invoke the UPOP network of mentors and employers, identify and pursue opportunities and negotiate terms of their summer assignment. Students complete a 10-12 week internship, which includes filing three progress reports, conducting one informational interview, and possibly hosting a site visit by MIT staff. Returning to campus as juniors, UPOP students take part in reflective exercises that aid assimilation of learning objectives and reinforce the cognitive link between all aspects of the UPOP experience and disciplinary fields of study. Sequence begins in the spring of sophomore year and ends in the fall of junior year."}, "UPOP Engineering Practice Workshop": {"title": "UPOP Engineering Practice Workshop", "number": "22.EPW", "description": "Develops foundational skills for the world of practice in science, technology, and engineering. Sophomores receive classroom instruction, and one-on-one and small-group coaching in basics of professional identity building. They attend field trips to local employers and receive job interview practice, coached by industry volunteers. Over IAP, students attend a weeklong Team Training Camp of experiential learning modules - led by MIT faculty with the help of MIT alums and other senior professionals in business, engineering, and science where students participate in creative simulations, team problem-solving challenges, and oral presentations, and practice networking with employers. Enrollment limited."}, "Undergraduate Research Opportunities Program": {"title": "Undergraduate Research Opportunities Program", "number": "22.UR", "description": "The Undergraduate Research Opportunities Program is an excellent way for undergraduate students to become familiar with the Department of Nuclear Engineering. Student research as a UROP project has been conducted in areas of fission reactor studies, utilization of fusion devices, applied radiation research, and biomedical applications. Projects include the study of engineering aspects for both fusion and fission energy sources."}, "Applied Nuclear Physics": {"title": "Applied Nuclear Physics", "number": "22.11", "description": "Introduction to nuclear structure, reactions, and radioactivity. Review of quantization, the wave function, angular momentum and tunneling. Simplified application to qualitative understanding of nuclear structure.  Stable and unstable isotopes, radioactive decay, decay products and chains. Nuclear reactions, cross-sections, and fundamental forces, and the resulting phenomena."}, "Radiation Interactions, Control, and Measurement": {"title": "Radiation Interactions, Control, and Measurement", "number": "22.12", "description": "The interaction, attenuation, and biological effects of penetrating radiation, especially neutrons and photons.  Physical processes of radiation scattering and absorption, and their cross-sections.  Outline of health physics. Biological effects of radiation, and its quantification. Principles of radiation shielding, detection, dosimetry and radiation protection."}, "Nuclear Energy Systems": {"title": "Nuclear Energy Systems", "number": "22.13", "description": "Introduction to generation of energy from nuclear reactions. Characteristics of nuclear energy. Fission cross-sections, criticality, and reaction control. Basic considerations of fission reactor engineering, thermal hydraulics, and safety. Nuclear fuel and waste characteristics. Fusion reactions and the character and conditions of energy generation.  Plasma physics and approaches to achieving terrestrial thermonuclear fusion energy."}, "Materials in Nuclear Engineering": {"title": "Materials in Nuclear Engineering", "number": "22.14", "description": "Introduces the fundamental phenomena of materials science with special attention to radiation and harsh environments. Materials lattices and defects and the consequent understanding of strength of materials, fatigue, cracking, and corrosion.  Coulomb collisions of charged particles; their effects on structured materials; damage and defect production, knock-ons, transmutation, cascades and swelling. Materials in fission and fusion applications: cladding, waste, plasma-facing components, blankets."}, "Essential Numerical Methods": {"title": "Essential Numerical Methods", "number": "22.15", "description": "Introduces computational methods for solving physical problems in nuclear applications. Ordinary and partial differential equations for particle orbit, and fluid, field, and particle conservation problems; their representation and solution by finite difference numerical approximations. Iterative matrix inversion methods. Stability, convergence, accuracy and statistics. Particle representations of Boltzmann's equation and methods of solution such as Monte-Carlo and particle-in-cell techniques."}, "Nuclear Technology and Society": {"title": "Nuclear Technology and Society", "number": "22.16", "description": "Introduces the societal context and challenges for nuclear technology. Major themes include economics and valuation of nuclear power, interactions with government and regulatory frameworks; safety, quantification of radiation hazards, and public attitudes to risk. Covers policies and methods for limiting nuclear-weapons proliferation, including nuclear detection, materials security and fuel-cycle policy."}, "Nuclear Reactor Physics I": {"title": "Nuclear Reactor Physics I", "number": "22.211", "description": "Provides an overview of reactor physics methods for core design and analysis.  Topics include nuclear data, neutron slowing down, homogeneous and heterogeneous resonance absorption, calculation of neutron spectra, determination of group constants, nodal diffusion methods, Monte Carlo simulations of reactor core reload design methods."}, "Nuclear Reactor Analysis II": {"title": "Nuclear Reactor Analysis II", "number": "22.212", "description": "Addresses advanced topics in nuclear reactor physics with an additional focus towards computational methods and algorithms for neutron transport. Covers current methods employed in lattice physics calculations, such as resonance models, critical spectrum adjustments, advanced homogenization techniques, fine mesh transport theory models, and depletion solvers. Also presents deterministic transport approximation techniques, such as the method of characteristics, discrete ordinates methods, and response matrix methods."}, "Nuclear Reactor Physics III": {"title": "Nuclear Reactor Physics III", "number": "22.213", "description": "Covers numerous high-level topics in nuclear reactor analysis methods and builds on the student's background in reactor physics to develop a deep understanding of concepts needed for time-dependent nuclear reactor core physics, including coupled non-linear feedback effects. Introduces numerical algorithms needed to solve real-world time-dependent reactor physics problems in both diffusion and transport. Additional topics include iterative numerical solution methods (e.g., CG, GMRES, JFNK, MG), nonlinear accelerator methods, and numerous modern time-integration techniques."}, "Thermal Hydraulics in Power Technology": {"title": "Thermal Hydraulics in Power Technology", "number": "22.313[J]", "description": "Emphasis on thermo-fluid dynamic phenomena and analysis methods for conventional and nuclear power stations. Kinematics and dynamics of two-phase flows.  Steam separation.  Boiling, instabilities, and critical conditions. Single-channel transient analysis.  Multiple channels connected at plena.  Loop analysis including single and two-phase natural circulation.  Subchannel analysis."}, "Applied Computational Fluid Dynamics and Heat Transfer": {"title": "Applied Computational Fluid Dynamics and Heat Transfer", "number": "22.315", "description": "Focuses on the application of computational fluid dynamics to the analysis of power generation and propulsion systems, and on industrial and chemical processes in general.  Discusses simulation methods for single and multiphase applications and their advantages and limitations in industrial situations. Students practice breaking down an industrial problem into its modeling challenges, designing and implementing a plan to optimize and validate the modeling approach, performing the analysis, and quantifying the uncertainty margin."}, "Nuclear Engineering Design": {"title": "Nuclear Engineering Design", "number": "22.33", "description": "Group design project involving integration of nuclear physics, particle transport, control, heat transfer, safety, instrumentation, materials, environmental impact, and economic optimization. Provides opportunity to synthesize knowledge acquired in nuclear and non-nuclear subjects and apply this knowledge to practical problems of current interest in nuclear applications design.  Past projects have included using a fusion reactor for transmutation of nuclear waste, design and implementation of an experiment to predict and measure pebble flow in a pebble bed reactor, and development of a mission plan for a manned Mars mission including the conceptual design of a nuclear powered space propulsion system and power plant for the Mars surface.  Students taking graduate version complete additional assignments."}, "Probability and Its Applications To Reliability, Quality Control, and Risk Assessment": {"title": "Probability and Its Applications To Reliability, Quality Control, and Risk Assessment", "number": "22.38", "description": "Interpretations of the concept of probability. Basic probability rules; random variables and distribution functions; functions of random variables. Applications to quality control and the reliability assessment of mechanical/electrical components, as well as simple structures and redundant systems. Elements of statistics. Bayesian methods in engineering. Methods for reliability and risk assessment of complex systems, (event-tree and fault-tree analysis, common-cause failures, human reliability models). Uncertainty propagation in complex systems (Monte Carlo methods, Latin hypercube sampling). Introduction to Markov models. Examples and applications from nuclear and other industries, waste repositories, and mechanical systems. Open to qualified undergraduates."}, "Fundamentals of Advanced Energy Conversion": {"title": "Fundamentals of Advanced Energy Conversion", "number": "22.40[J]", "description": "Fundamentals of thermodynamics, chemistry, and transport applied to energy systems. Analysis of energy conversion and storage in thermal, mechanical, chemical, and electrochemical processes in power and transportation systems, with emphasis on efficiency, performance and environmental impact. Applications to fuel reforming and alternative fuels, hydrogen, fuel cells and batteries, combustion, catalysis, combined and hybrid power cycles using fossil, nuclear and renewable resources. CO"}, "Magnetic Resonance Analytic, Biochemical, and Imaging Techniques": {"title": "Magnetic Resonance Analytic, Biochemical, and Imaging Techniques", "number": "22.561[J]", "description": "Introduction to basic NMR theory. Examples of biochemical data obtained using NMR summarized along with other related experiments. Detailed study of NMR imaging techniques includes discussions of basic cross-sectional image reconstruction, image contrast, flow and real-time imaging, and hardware design considerations. Exposure to laboratory NMR spectroscopic and imaging equipment included."}, "Introduction to Plasma Physics I": {"title": "Introduction to Plasma Physics I", "number": "22.611[J]", "description": "Introduces plasma phenomena relevant to energy generation by controlled thermonuclear fusion and to astrophysics. Elementary plasma concepts, plasma characterization.  Motion of charged particles in magnetic fields. Coulomb collisions, relaxation times, transport processes. Two-fluid hydrodynamic and MHD descriptions. Plasma confinement by magnetic fields, simple equilibrium and stability analysis. Wave propagation in a magnetic field; application to RF plasma heating. Introduction to kinetic theory; Vlasov, Boltzmann and Fokker-Planck equations; relation of fluid and kinetic descriptions. Electron and ion acoustic plasma waves, Landau damping."}, "Introduction to Plasma Physics II": {"title": "Introduction to Plasma Physics II", "number": "22.612[J]", "description": "Linear waves and instabilities in magnetized plasma; solutions of Vlasov-Maxwell equations in homogeneous and inhomogeneous plasmas; conservation principles for energy and momentum; quasi-linear theory and nonlinear stabilization; solitons and coherent nonlinear phenomena; collisions and discrete particle effects; fluctuations in a stable plasma; Fokker-Planck equation and transport phenomena. A subject description tailored to fit the background and interests of the attending students distributed shortly before and at the beginning of the subject."}, "Plasma Turbulence and Transport": {"title": "Plasma Turbulence and Transport", "number": "22.617", "description": "Introduces plasma turbulence and turbulent transport, with a focus on fusion plasmas. Covers theory of mechanisms for turbulence in confined plasmas, fluid and kinetic equations, and linear and nonlinear gyrokinetic equations; transport due to stochastic magnetic fields, magnetohydrodynamic (MHD) turbulence, and drift wave turbulence; and suppression of turbulence, structure formation, intermittency, and stability thresholds. Emphasis on comparing experiment and theory. Discusses experimental techniques, simulations of plasma turbulence, and predictive turbulence-transport models."}, "Engineering Principles for Fusion Reactors": {"title": "Engineering Principles for Fusion Reactors", "number": "22.63", "description": "Fusion reactor design considerations: ignition devices, engineering test facilities, and safety/environmental concerns. Magnet principles: resistive and superconducting magnets; cryogenic features. Blanket and first wall design: liquid and solid breeders, heat removal, and structural considerations. Heating devices: radio frequency and neutral beam."}, "Principles of Plasma Diagnostics": {"title": "Principles of Plasma Diagnostics", "number": "22.67[J]", "description": "Introduction to the physical processes used to measure the properties of plasmas, especially fusion plasmas. Measurements of magnetic and electric fields, particle flux, refractive index, emission and scattering of electromagnetic waves and heavy particles; their use to deduce plasma parameters such as particle density, pressure, temperature, and velocity, and hence the plasma confinement properties. Discussion of practical examples and assessments of the accuracy and reliability of different techniques."}, "Modern Physical Metallurgy": {"title": "Modern Physical Metallurgy", "number": "22.71[J]", "description": "Examines how the presence of 1-, 2- and 3-D defects and second phases control the mechanical, electromagnetic and chemical behavior of metals and alloys. Considers point, line and interfacial defects in the context of structural transformations including annealing, spinodal decomposition, nucleation, growth, and particle coarsening. Concentrates on structure-function relationships, and in particular how grain size, interstitial and substitutional solid solutions, and second-phase particles impact mechanical and other properties  Industrially relevant case studies illustrate lecture concepts. Students taking the graduate version explore the subject in greater depth."}, "Defects in Materials": {"title": "Defects in Materials", "number": "22.73[J]", "description": "Examines point, line, and planar defects in structural and functional materials. Relates their properties to transport, radiation response, phase transformations, semiconductor device performance and quantum information processing. Focuses on atomic and electronic structures of defects in crystals, with special attention to optical properties, dislocation dynamics, fracture, and charged defects population and diffusion. Examples also drawn from other systems, e.g., disclinations in liquid crystals, domain walls in ferromagnets, shear bands in metallic glass, etc."}, "Properties of Solid Surfaces": {"title": "Properties of Solid Surfaces", "number": "22.75[J]", "description": "Covers fundamental principles needed to understand and measure the microscopic properties of the surfaces of solids, with connections to structure, electronic, chemical, magnetic and mechanical properties. Reviews the theoretical aspects of surface behavior, including stability of surfaces, restructuring, and reconstruction. Examines the interaction of the surfaces with the environment, including absorption of atoms and molecules, chemical reactions and material growth, and interaction of surfaces with other point defects within the solids (space charges in semiconductors). Discusses principles of important tools for the characterization of surfaces, such as surface electron and x-ray diffraction, electron spectroscopies (Auger and x-ray photoelectron spectroscopy), scanning tunneling, and force microscopy."}, "Sustainable Energy": {"title": "Sustainable Energy", "number": "22.811[J]", "description": "Assessment of current and potential future energy systems. Covers resources, extraction, conversion, and end-use technologies, with emphasis on meeting 21st-century regional and global energy needs in a sustainable manner. Examines various energy technologies in each fuel cycle stage for fossil (oil, gas, synthetic), nuclear (fission and fusion) and renewable (solar, biomass, wind, hydro, and geothermal) energy types, along with storage, transmission, and conservation issues. Emphasizes analysis of energy propositions within an engineering, economic and social context. Students taking graduate version complete additional assignments."}, "Energy Technology and Policy:  From Principles to Practice": {"title": "Energy Technology and Policy:  From Principles to Practice", "number": "22.813[J]", "description": "Develops analytical skills to lead a successful technology implementation with an integrated approach that combines technical, economical and social perspectives. Considers corporate and government viewpoints as well as international aspects, such as nuclear weapons proliferation and global climate issues.  Discusses technologies such as oil and gas, nuclear, solar, and energy efficiency. Limited to 100."}, "Nuclear Weapons and International Security": {"title": "Nuclear Weapons and International Security", "number": "22.814[J]", "description": "Examines the historical, political, and technical contexts for nuclear policy making, including the development of nuclear weapons by states, the evolution of nuclear strategy, the role nuclear weapons play in international politics, the risks posed by nuclear arsenals, and the policies and strategies in place to mitigate those risks.  Equal emphasis is given to political and technical considerations affecting national choices.  Considers the issues surrounding new non-proliferation strategies, nuclear security, and next steps for arms control."}, "Nuclear Power Plant Dynamics and Control": {"title": "Nuclear Power Plant Dynamics and Control", "number": "22.921", "description": "Introduction to reactor dynamics, including subcritical multiplication, critical operation in absence of thermal feedback effects and effects of xenon, fuel and moderator temperature, etc. Derivation of point kinetics and dynamic period equations. Techniques for reactor control including signal validation, supervisory algorithms, model-based trajectory tracking, and rule-based control. Overview of light-water reactor start-up. Lectures and demonstrations with use of the MIT Research Reactor. Open to undergraduates with permission of instructor."}, "Teaching Experience in Nuclear Science & Engineering": {"title": "Teaching Experience in Nuclear Science & Engineering", "number": "22.93", "description": "For qualified graduate students interested in teaching as a career. Classroom, laboratory, or tutorial teaching under the supervision of a faculty member. Students selected by interview. Credits for this subject may not be used toward master's or engineer's degrees. Enrollment limited by availability of suitable teaching assignments."}, "Internship in Nuclear Science and Engineering": {"title": "Internship in Nuclear Science and Engineering", "number": "22.95", "description": "For Nuclear Science and Engineering students participating in research or curriculum-related off-campus experiences. Before enrolling, students must have an offer from a company or organization. Upon completion, the student must submit a final report or presentation to the approved MIT supervisor, usually the student's thesis supervisor or a member of the thesis committee. Subject to departmental approval. Consult the NSE Academic Office for details on procedures and restrictions. Limited to students participating in internships consistent with NSE policies relating to research-related employment."}}