{"Introduction to Materials Science and Engineering": {"title": "Introduction to Materials Science and Engineering", "number": "3.001", "description": "Provides a broad introduction to topics in materials science and the curricula in the Department of Materials Science and Engineering's core subjects. Lectures emphasize conceptual and visual examples of materials phenomena and engineering, interspersed with guest speakers from both inside and outside academia to show possible career paths. Preference to first-year students."}, "Principles of Engineering Practice": {"title": "Principles of Engineering Practice", "number": "3.004", "description": "Introduces students to the interdisciplinary nature of 21st-century engineering projects with three threads of learning: a technical toolkit, a social science toolkit, and a methodology for problem-based learning. Students encounter the social, political, economic and technological challenges of engineering practice via case studies and participation in engineering projects. Includes a six-stage term project in which student teams develop solutions through exercises in project planning, analysis, design, optimization, demonstration, reporting, and team building."}, "Passion Projects: Living in a Material World": {"title": "Passion Projects: Living in a Material World", "number": "3.005", "description": "Project-based seminar in which students formulate and answer questions about a material or object that interests and inspires them. Uses cutting-edge equipment to characterize the materials' structure in order to understand its role and functionality. Analyzes the lifecycle of the material to better understand the full use case. Culminates in the creation of a website, video, and final presentation in which students share the results of their research. Preference to first-year students; limited to 15."}, "Introduction to Materials and Mechanical Design": {"title": "Introduction to Materials and Mechanical Design", "number": "3.007", "description": "Focuses on hands-on experience with characterization techniques, instrumentation, design thinking and optimizing solutions within design constraints. Applied to ideas relevant to materials science and mechanical engineering. Includes introductions to modern, rapid prototyping and characterization tools in the context of a design problem, followed by discovery-based labs illustrating manufacturing concepts. Culminates in a student-directed making experience."}, "IAP in India - Humanistic Co-design of Assistive Technology in the Developing World": {"title": "IAP in India - Humanistic Co-design of Assistive Technology in the Developing World", "number": "3.008", "description": "Experiential practicum during which students innovate an assistive technology by engaging in a humanistic co-design process with someone who has a disability and lives in the developing world. Provides a unique platform to explore the complex engineering requirements of designing assistive technologies that must be relied upon in unpredictable environments. Students select a specialty within the field to investigate current state-of-the-art technologies and identify the facets of the material, mechanical and electrical design where innovation is possible. Previous experience designing and prototyping products using mechanical, material, electrical, or computational techniques suggested. Opportunities for funded travel available. May be taken for up to 12 units. Enrollment limited; preference to students looking to carry these projects forward as independent research projects."}, "Fundamentals of Materials Science and Engineering": {"title": "Fundamentals of Materials Science and Engineering", "number": "3.012", "description": "Describes the fundamentals of structure and energetics that underpin materials science. Presents thermodynamic concepts and the laws governing equilibrium properties, and the connections between thermodynamic concepts and materials phenomena, such as phase transformations, multiphase equilibria, and chemical reactions. Introduces computerized thermodynamics. Structure of noncrystalline, crystalline, and liquid-crystalline states. Symmetry and tensor properties of materials. Point, line, and surface imperfections in materials. Diffraction and structure determination."}, "Materials Laboratory": {"title": "Materials Laboratory", "number": "3.014", "description": "Experimental exploration of the connections between structure, properties, processing, and performance of materials. Hands-on experience with materials characterization techniques and instrumentation. Covers methodology of technical communication (written and oral) with a view to integrate experimental design, execution, and analysis. Concurrent enrollment in 3.012 and 3.014 strongly recommended."}, "Computational Methods for Materials Scientists and Engineers": {"title": "Computational Methods for Materials Scientists and Engineers", "number": "3.016", "description": "Computational and analytical techniques necessary for materials science and engineering topics, such as material structure, symmetry, and thermodynamics, materials response to applied fields, mechanics and physics of solids and soft materials. Presents mathematical concepts and materials-related problem solving skills alongside symbolic programming techniques. Symbolic algebraic computational methods, programming, and visualization techniques; topics include linear algebra, quadratic forms, tensor operations, symmetry operations, calculus of several variables, eigensystems, systems of ordinary and partial differential equations, beam theory, resonance phenomena, special functions, numerical solutions, statistical analysis, Fourier analysis, and random walks."}, "Modelling, Problem Solving, Computing, and Visualization": {"title": "Modelling, Problem Solving, Computing, and Visualization", "number": "3.017", "description": "Covers development and design of models for materials processes and structure-property relations. Emphasizes techniques for solving equations from models or simulating their behavior. Assesses methods for visualizing solutions and aesthetics of the graphical presentation of results. Topics include symmetry and structure, classical and statistical thermodynamics, solid state physics, mechanics, phase transformations and kinetics, statistics and presentation of data."}, "Introduction to Modeling and Simulation": {"title": "Introduction to Modeling and Simulation", "number": "3.021", "description": "Basic concepts of computer modeling and simulation in science and engineering. Uses techniques and software for simulation, data analysis and visualization. Continuum, mesoscale, atomistic and quantum methods used to study fundamental and applied problems in physics, chemistry, materials science, mechanics, engineering, and biology. Examples drawn from the disciplines above are used to understand or characterize complex structures and materials, and complement experimental observations."}, "Microstructural Evolution in Materials": {"title": "Microstructural Evolution in Materials", "number": "3.022", "description": "Covers microstructures, defects, and structural evolution in all classes of materials. Topics include solution kinetics, interface stability, dislocations and point defects, diffusion, surface energetics, grains and grain boundaries, grain growth, nucleation and precipitation, and electrochemical reactions. Lectures illustrate a range of examples and applications based on metals, ceramics, electronic materials, polymers, and biomedical materials. Explores the evolution of microstructure through experiments involving optical and electron microscopy, calorimetry, electrochemical characterization, surface roughness measurements, and other characterization methods. Investigates structural transitions and structure-property relationships through practical materials examples."}, "Electronic, Optical and Magnetic Properties of Materials": {"title": "Electronic, Optical and Magnetic Properties of Materials", "number": "3.024", "description": "Uses fundamental principles of quantum mechanics, solid state physics, electricity and magnetism to describe how the electronic, optical and magnetic properties of materials originate. Illustrates how these properties can be designed for particular applications, such as diodes, solar cells, optical fibers, and magnetic data storage. Involves experimentation using spectroscopy, resistivity, impedance and magnetometry measurements, behavior of light in waveguides, and other characterization methods. Uses practical examples to investigate structure-property relationships."}, "Mechanical Behavior of Materials": {"title": "Mechanical Behavior of Materials", "number": "3.22", "description": "Explores how the macroscale mechanical behavior of materials originates from fundamental, microscale mechanisms of elastic and inelastic deformation. Topics include: elasticity, viscoelasticity, plasticity, creep, fracture, and fatigue. Case studies and examples  are drawn from a variety of material classes: metals, ceramics, polymers, thin films, composites, and cellular materials."}, "Organic and Biomaterials Chemistry": {"title": "Organic and Biomaterials Chemistry", "number": "3.034A", "description": "Focuses on the chemistry and chemical structure-property relationships of soft synthetic and biologically derived materials. Topics include methods for preparing synthetic polymers by step and chain growth polymerizations; polymerization reaction kinetics; chemistry of proteins, nucleic acids, polysaccharides and lipids; enzymatic reactions; electroactive organic materials; polymer mechanical properties and processing techniques; applications of biological and biomaterials; self-assembly of polymer, nanoparticle, and biological materials; instrumental techniques for characterizing soft materials. 3.034A students also complete additional written assignments in place of the 3.034 laboratory component."}, "Problems in Materials Science and Engineering": {"title": "Problems in Materials Science and Engineering", "number": "3.038", "description": "For undergraduates desiring to carry on projects of their own choosing, which may be experimental, theoretical, or of a design nature. Also for undergraduate studies arranged by students or staff, which may consist of seminars, assigned reading, or laboratory projects. See UROP Coordinator for registration procedures."}, "Materials Project Laboratory": {"title": "Materials Project Laboratory", "number": "3.042", "description": "Student project teams design and fabricate a working prototype using materials processing technologies (e.g. solid works 3-D design software, computer numerical controlled mill, injection molding, thermoforming, investment casting, powder processing, three-dimensional printing, physical vapor deposition) appropriate for the materials and device of interest. Goals include using MSE fundamentals in a practical application; understanding trade-offs between design, processing, and performance and cost; and fabrication of a deliverable prototype. Emphasis on teamwork, project management, communications and computer skills, with extensive hands-on work using student and MIT laboratory shops. Teams document their progress and final results by means of written and oral communication. Limited to 25."}, "Materials Processing": {"title": "Materials Processing", "number": "3.044", "description": "Introduction to materials processing science, with emphasis on heat transfer, chemical diffusion, and fluid flow. Uses an engineering approach to analyze industrial-scale processes, with the goal of identifying and understanding physical limitations on scale and speed. Covers materials of all classes, including metals, polymers, electronic materials, and ceramics. Considers specific processes, such as melt-processing of metals and polymers, deposition technologies (liquid, vapor, and vacuum), colloid and slurry processing, viscous shape forming, and powder consolidation."}, "Thermodynamics of Materials": {"title": "Thermodynamics of Materials", "number": "3.046", "description": "Explores equilibrium thermodynamics through its application to topics in materials science and engineering. Begins with a fast-paced review of introductory classical and statistical thermodynamics. Students select additional topics to cover; examples include batteries and fuel cells, solar photovoltaics, magnetic information storage, extractive metallurgy, corrosion, thin solid films, and computerized thermodynamics."}, "Nanomechanics of Materials and Biomaterials": {"title": "Nanomechanics of Materials and Biomaterials", "number": "3.052", "description": "Latest scientific developments and discoveries in the field of nanomechanics, i.e. the deformation of extremely tiny (10-9 meters) areas of synthetic and biological materials. Lectures include a description of normal and lateral forces at the atomic scale, atomistic aspects of adhesion, nanoindentation, molecular details of fracture, chemical force microscopy, elasticity of individual macromolecular chains, intermolecular interactions in polymers, dynamic force spectroscopy, biomolecular bond strength measurements, and molecular motors."}, "Molecular, Cellular, and Tissue Biomechanics": {"title": "Molecular, Cellular, and Tissue Biomechanics", "number": "3.971[J]", "description": "Develops and applies scaling laws and the methods of continuum mechanics to biomechanical phenomena over a range of length scales. Topics include structure of tissues and the molecular basis for macroscopic properties; chemical and electrical effects on mechanical behavior; cell mechanics, motility and adhesion; biomembranes; biomolecular mechanics and molecular motors. Experimental methods for probing structures at the tissue, cellular, and molecular levels."}, "Cellular Solids: Structure, Properties, Applications": {"title": "Cellular Solids: Structure, Properties, Applications", "number": "3.36", "description": "Discusses processing and structure of cellular solids as they are created from polymers, metals, ceramics, glasses, and composites; derivation of models for the mechanical properties of honeycombs and foams; and how unique properties of honeycombs and foams are exploited in applications such as lightweight structural panels, energy absorption devices, and thermal insulation. Covers applications of cellular solids in medicine, such as increased fracture risk due to trabecular bone loss in patients with osteoporosis, the development of metal foam coatings for orthopedic implants, and designing porous scaffolds for tissue engineering that mimic the extracellular matrix. Includes modelling of cellular materials applied to natural materials and biomimicking. Offers a combination of online and in-person instruction. Students taking graduate version complete additional assignments."}, "Biomaterials Science and Engineering": {"title": "Biomaterials Science and Engineering", "number": "3.963[J]", "description": "Covers, at a molecular scale, the analysis and design of materials used in contact with biological systems, and biomimetic strategies aimed at creating new materials based on principles found in biology. Topics include molecular interaction between bio- and synthetic molecules and surfaces; design, synthesis, and processing approaches for materials that control cell functions; and application of materials science to problems in tissue engineering, drug delivery, vaccines, and cell-guiding surfaces. Students taking graduate version complete additional assignments."}, "Polymer Physics": {"title": "Polymer Physics", "number": "3.942", "description": "The mechanical, optical, electrical, and transport properties of polymers and other types of \"soft matter\" are presented with respect to the underlying physics and physical chemistry of polymers and colloids in solution, and solid states. Topics include how enthalpy and entropy determine conformation, molecular dimensions and packing of polymer chains and colloids and supramolecular materials. Examination of the structure of glassy, crystalline, and rubbery elastic states of polymers; thermodynamics of solutions, blends, crystallization; liquid crystallinity, microphase separation, and self-assembled organic-inorganic nanocomposites. Case studies of relationships between structure and function in technologically important polymeric systems. Students taking graduate version complete additional assignments."}, "Introduction to Ceramics": {"title": "Introduction to Ceramics", "number": "3.07", "description": "Discusses structure-property relationships in ceramic materials. Includes hierarchy of structures from the atomic to microstructural levels. Defects and transport, solid-state electrochemical processes, phase equilibria, fracture and phase transformations are discussed in the context of controlling properties for various applications of ceramics. Numerous examples from current technology."}, "Symmetry, Structure and Tensor Properties of Materials": {"title": "Symmetry, Structure and Tensor Properties of Materials", "number": "3.072", "description": "Studies the underlying structures of materials and deepens understanding of the relationship between the properties of materials and their structures. Topics include lattices, point groups, and space groups in both two and three dimensions; the use of symmetry in the tensor representation of crystal properties; and the relationship between crystalline structure and properties, including transport properties, piezoelectricity, and elasticity. Students taking graduate version complete additional assignments."}, "Imaging of Materials": {"title": "Imaging of Materials", "number": "3.34", "description": "Principles and applications of imaging techniques for materials characterization including transmission and scanning electron microscopy and scanning probe microscopy. Topics include electron diffraction; image formation in transmission and scanning electron microscopy; diffraction and phase contrast; imaging of crystals and crystal imperfections; review of the most recent advances in electron microscopy for bio- and nanosciences; analysis of chemical composition and electronic structure at the atomic scale. Lectures, real-case studies and computer simulations. Graduate students complete additional assignments."}, "Industrial Ecology of Materials": {"title": "Industrial Ecology of Materials", "number": "3.560", "description": "Covers quantitative techniques to address principles of substitution, dematerialization, and waste mining implementation in materials systems. Includes life-cycle and materials flow analysis of the impacts of materials extraction; processing; use; and recycling for materials, products, and services. Student teams undertake a case study regarding materials and technology selection using the latest methods of analysis and computer-based models of materials process. Students taking graduate version complete additional assignments."}, "Venture Engineering": {"title": "Venture Engineering", "number": "3.085[J]", "description": "Provides an integrated approach to the development and growth of new innovative ventures. Intended for students who seek to leverage their engineering and science background through innovation-driven entrepreneurship. Emphasizes the concept that innovation-driven entrepreneurs must make a set of interdependent choices under conditions of high uncertainty, and demonstrates that venture engineering involves reducing uncertainty through a structured process of experimental learning and staged commitments. Provides deep understanding of the core technical, customer, and strategic choices and challenges facing start-up innovators, and a synthetic framework for the development and implementation of ventures in dynamic environments."}, "Innovation and Commercialization of Materials Technology": {"title": "Innovation and Commercialization of Materials Technology", "number": "3.086", "description": "Introduces the fundamental process of innovating and its role in promoting growth and prosperity. Exposes students to innovation through team projects as a structured process, while developing skills to handle multiple uncertainties simultaneously. Provides training to address these uncertainties through research methods in the contexts of materials technology development, market applications, industry structure, intellectual property, and other factors. Case studies place the project in a context of historical innovations with worldwide impact. Combination of projects and real-world cases help students identify how they can impact the world through innovation."}, "Introduction to Solid-State Chemistry": {"title": "Introduction to Solid-State Chemistry", "number": "3.091", "description": "Basic principles of chemistry and their application to engineering systems. The relationship between electronic structure, chemical bonding, and atomic order. Characterization of atomic arrangements in crystalline and amorphous solids: metals, ceramics, semiconductors, and polymers. Topical coverage of organic chemistry, solution chemistry, acid-base equilibria, electrochemistry, biochemistry, chemical kinetics, diffusion, and phase diagrams. Examples from industrial practice (including the environmental impact of chemical processes), from energy generation and storage (e.g., batteries and fuel cells), and from emerging technologies (e.g., photonic and biomedical devices)."}, "Materials in Human Experience": {"title": "Materials in Human Experience", "number": "3.094", "description": "Examines the ways in which people in ancient and contemporary societies have selected, evaluated, and used materials of nature, transforming them to objects of material culture. Some examples: Maya use of lime plaster for frescoes, books and architectural sculpture; sounds and colors of powerful metals in Mesoamerica; cloth and fiber technologies in the Inca empire. Explores ideological and aesthetic criteria often influential in materials development. Laboratory/workshop sessions provide hands-on experience with materials discussed in class. Subject complements 3.091. Enrollment may be limited."}, "Introduction to Metalsmithing": {"title": "Introduction to Metalsmithing", "number": "3.095", "description": "Centers around art history, design principles, sculptural concepts, and metallurgical processes. Covers metalsmithing techniques of enameling, casting, and hollowware. Students create artworks that interpret lecture material and utilize metalsmithing techniques and metal as means of expression. Also covers topics of art patronage, colonial influence upon arts production, and gender and class issues in making. Lectures and lab sessions supplemented by a visiting artist lecture and art museum field trip. Limited to 12."}, "Physical Metallurgy": {"title": "Physical Metallurgy", "number": "3.14", "description": "Focuses on the links between the processing, structure, and properties of metals and alloys. First, the physical bases for strength, stiffness, and ductility are discussed with reference to crystallography, defects, and microstructure.  Second, phase transformations and microstructural evolution are studied in the context of alloy thermodynamics and kinetics. Together, these components comprise the modern paradigm for designing metallic microstructures for optimized properties. Concludes with a focus on processing/microstructure/property relationships in structural engineering alloys, particularly steels and aluminum alloys. Students taking the graduate version explore the subject in greater depth."}, "Electrical, Optical, and Magnetic Materials and Devices": {"title": "Electrical, Optical, and Magnetic Materials and Devices", "number": "3.15", "description": "Explores the relationships between the performance of electrical, optical, and magnetic devices and the microstructural and defect characteristics of the materials from which they are constructed. Features a device-motivated approach that places strong emphasis on the design of functional materials for emerging technologies. Applications center around diodes, transistors, memristors, batteries, photodetectors, solar cells (photovoltaics) and solar-to-fuel converters, displays, light emitting diodes, lasers, optical fibers and optical communications, photonic devices, magnetic data storage and spintronics."}, "Magnetic Materials": {"title": "Magnetic Materials", "number": "3.45", "description": "Topics include origin of magnetism in materials, magnetic domains and domain walls, magnetostatics, anisotropy, antiferro- and ferrimagnetism, magnetization dynamics, spintronics, magnetism in thin films and nanoparticles, magnetotransport phenomena, and magnetic characterization. Discusses a range of applications, including magnetic recording, spintronic memory, magnetoopical devices, and multiferroics. Assignments include problem sets and a term paper on a magnetic device or technology. Students taking graduate version complete additional assignments."}, "Materials Performance in Extreme Environments": {"title": "Materials Performance in Extreme Environments", "number": "3.154[J]", "description": "Studies the behavior of materials in extreme environments typical of those in which advanced energy systems (including fossil, nuclear, solar, fuel cells, and battery) operate. Takes both a science and engineering approach to understanding how current materials interact with their environment under extreme conditions. Explores the role of modeling and simulation in understanding material behavior and the design of new materials. Focuses on energy and transportation related systems."}, "Micro/Nano Processing Technology": {"title": "Micro/Nano Processing Technology", "number": "3.155[J]", "description": "Introduces the theory and technology of micro/nano fabrication. Includes lectures and laboratory sessions on basic processing techniques such as vacuum processes, lithography, diffusion, oxidation, and pattern transfer. Students fabricate solar cells, MEMS cantilevers, and microfluidic mixers. Emphasizes interrelationships between material properties and processing, device structure, and the electrical, mechanical, optical, chemical or biological behavior of devices. Provides background for thesis work in micro/nano fabrication. Students engage in extensive written and oral communication exercises."}, "Photonic Materials and Devices": {"title": "Photonic Materials and Devices", "number": "3.46", "description": "Optical materials design for semiconductors, dielectrics and polymers. Ray optics, electromagnetic optics and guided wave optics. Physics of light-matter interactions.  Device design principles: LEDs, lasers, photodetectors, modulators, fiber and waveguide interconnects, optical filters, and photonic crystals. Device processing:  crystal growth, substrate engineering, thin film deposition, etching and process integration for dielectric, silicon and compound semiconductor materials. Microphotonic integrated circuits.  Telecom/datacom systems. Assignments include three design projects that emphasize materials, devices and systems applications. Students taking graduate version complete additional assignments."}, "Industrial Challenges in Metallic Materials Selection": {"title": "Industrial Challenges in Metallic Materials Selection", "number": "3.39", "description": "Advanced metals and alloy design with emphasis in advanced steels and non-ferrous alloys.  Applies physical metallurgy concepts to solve specific problems aiming at sustainable, efficient and safer engineered solutions.  Discusses industrial challenges involving metallic materials selection and manufacturing for different value chains and industrial segments. Includes applications in essential segments of modern life such as transportation, energy and strutuctural applications.  Recognizing steel as an essential engineering material, the course will cover manufacturing and end-uses of advanced steels ranging from microalloyed steels to highly alloyed steels.  Materials for very low temperature applications such as superconducting materials and for higher temperature applications such as superalloys will also be covered. Students taking graduate version complete additional assignments."}, "Structural Materials and Manufacturing": {"title": "Structural Materials and Manufacturing", "number": "3.171", "description": "Combines online and in-person lectures to discuss structural materials selection, design and processing using examples from deformation processes, casting, welding and joining, non-destructive evaluation, failure and structural life assessment, and codes and standards. Emphasizes the underlying science of a given process rather than a detailed description of the technique or equipment. Presented in modules to be selected by student. Students taking graduate version must submit additional work. Meets with 3.171 when offered concurrently."}, "Materials Science and Engineering of Clean Energy": {"title": "Materials Science and Engineering of Clean Energy", "number": "3.70", "description": "Develops the materials principles, limitations and challenges in clean energy technologies, including solar, energy storage, thermoelectrics, fuel cells, and novel fuels. Draws correlations between the limitations and challenges related to key figures of merit and the basic underlying thermodynamic, structural, transport, and physical principles, as well as to the means for fabricating devices exhibiting optimum operating efficiencies and extended life at reasonable cost. Students taking graduate version complete additional assignments."}, "Sustainable Chemical Metallurgy": {"title": "Sustainable Chemical Metallurgy", "number": "3.50", "description": "Covers principles of metal extraction processes. Provides a direct application of the fundamentals of thermodynamics and kinetics to the industrial production of metals from their ores, e.g. iron, aluminum, or reactive metals and silicon. Discusses the corresponding economics and global challenges. Addresses advanced techniques for sustainable metal extraction, particularly with respect to greenhouse gas emissions. Students taking graduate version complete additional assignments."}, "Materials at Equilibrium": {"title": "Materials at Equilibrium", "number": "3.20", "description": "Laws of thermodynamics: general formulation and applications to mechanical, electromagnetic and electrochemical systems, solutions, and phase diagrams. Computation of phase diagrams. Statistical thermodynamics and relation between microscopic and macroscopic properties, including ensembles, gases, crystal lattices, phase transitions.  Applications to phase stability and properties of mixtures.  Representations of chemical equilibria. Interfaces."}, "Innovation and Commercialization": {"title": "Innovation and Commercialization", "number": "3.207", "description": "Explores in depth projects on a particular materials-based technology. Investigates the science and technology of materials advances and their strategic value, explore potential applications for fundamental advances, and determine intellectual property related to the materials technology and applications. Students map progress with presentations, and are expected to create an end-of-term document enveloping technology, intellectual property, applications, and potential commercialization. Lectures cover aspects of technology, innovation, entrepreneurship, intellectual property, and commercialization of fundamental technologies."}, "Kinetic Processes in Materials": {"title": "Kinetic Processes in Materials", "number": "3.21", "description": "Unified treatment of phenomenological and atomistic kinetic processes in materials. Provides the foundation for the advanced understanding of processing, microstructural evolution, and behavior for a broad spectrum of materials. Topics include irreversible thermodynamics; rate and transition state theory, diffusion; nucleation and phase transitions; continuous phase transitions; grain growth and coarsening; capillarity driven morphological evolution; and interface stability during phase transitions."}, "Electrical, Optical, and Magnetic Properties of Materials": {"title": "Electrical, Optical, and Magnetic Properties of Materials", "number": "3.23", "description": "Origin of electrical, magnetic and optical properties of materials. Focus on the acquisition of quantum mechanical tools. Analysis of the properties of materials. Presentation of the postulates of quantum mechanics. Examination of the hydrogen atom, simple molecules and bonds, and the behavior of electrons in solids and energy bands. Introduction of the variation principle as a method for the calculation of wavefunctions. Investigation of how and why materials respond to different electrical, magnetic and electromagnetic fields and probes. Study of the conductivity, dielectric function, and magnetic permeability in metals, semiconductors, and insulators. Survey of common devices such as transistors, magnetic storage media, optical fibers."}, "Properties of Solid Surfaces": {"title": "Properties of Solid Surfaces", "number": "3.30[J]", "description": "Covers fundamental principles needed to understand and measure the microscopic properties of the surfaces of solids, with connections to structure, electronic, chemical, magnetic and mechanical properties. Reviews the theoretical aspects of surface behavior, including stability of surfaces, restructuring, and reconstruction. Examines the interaction of the surfaces with the environment, including absorption of atoms and molecules, chemical reactions and material growth, and interaction of surfaces with other point defects within the solids (space charges in semiconductors). Discusses principles of important tools for the characterization of surfaces, such as surface electron and x-ray diffraction, electron spectroscopies (Auger and x-ray photoelectron spectroscopy), scanning tunneling, and force microscopy."}, "Radiation Damage and Effects in Nuclear Materials": {"title": "Radiation Damage and Effects in Nuclear Materials", "number": "3.31[J]", "description": "Studies the origins and effects of radiation damage in structural materials for nuclear applications. Radiation damage topics include formation of point defects, defect diffusion, defect reaction kinetics and accumulation, and differences in defect microstructures due to the type of radiation (ion, proton, neutron). Radiation effects topics include detrimental changes to mechanical properties, phase stability, corrosion properties, and differences in fission and fusion systems. Term project required. Students taking graduate version complete additional assignments."}, "Atomistic Computer Modeling of Materials": {"title": "Atomistic Computer Modeling of Materials", "number": "3.320", "description": "Theory and application of atomistic computer simulations to model, understand, and predict the properties of real materials. Energy models: from classical potentials to first-principles approaches. Density-functional theory and the total-energy pseudopotential method. Errors and accuracy of quantitative predictions. Thermodynamic ensembles: Monte Carlo sampling and molecular dynamics simulations. Free energies and phase transitions. Fluctations and transport properties. Coarse-graining approaches and mesoscale models."}, "Defects in Materials": {"title": "Defects in Materials", "number": "3.33[J]", "description": "Examines point, line, and planar defects in structural and functional materials. Relates their properties to transport, radiation response, phase transformations, semiconductor device performance and quantum information processing. Focuses on atomic and electronic structures of defects in crystals, with special attention to optical properties, dislocation dynamics, fracture, and charged defects population and diffusion. Examples also drawn from other systems, e.g., disclinations in liquid crystals, domain walls in ferromagnets, shear bands in metallic glass, etc."}, "Fracture and Fatigue": {"title": "Fracture and Fatigue", "number": "3.35", "description": "Advanced study of material failure in response to mechanical stresses. Damage mechanisms include microstructural changes, crack initiation, and crack propagation under monotonic and cyclic loads. Covers a wide range of materials: metals, ceramics, polymers, thin films, biological materials, composites. Describes toughening mechanisms and the effect of material microstructures. Includes stress-life, strain-life, and damage-tolerant approaches. Emphasizes fracture mechanics concepts and latest applications for structural materials, biomaterials, microelectronic components as well as nanostructured materials. Limited to 10."}, "Structural Materials": {"title": "Structural Materials", "number": "3.371[J]", "description": "Combines online and in-person lectures to discuss structural materials selection, design and processing using examples from deformation processes, casting, welding and joining, non-destructive evaluation, failure and structural life assessment, and codes and standards. Emphasizes the underlying science of a given process rather than a detailed description of the technique or equipment. Presented in modules to be selected by student. Students taking graduate version must submit additional work. Meets with 3.171 when offered concurrently."}, "Ceramics: Processing, Properties and Functional Devices": {"title": "Ceramics: Processing, Properties and Functional Devices", "number": "3.38", "description": "Explores modern ceramic processing - ranging from large-scale synthesis, 3D manufacturing and printing to nanoscale-thin film structures integrated for microelectronics useful for material, chemical, electronic or mechanical engineers. Examples of devices studied include opto-electronic materials, sensors, memories, batteries, solar-to-fuel convertors, and solid oxide fuel cells. Provides the skills and guidance to design ceramic and glassy materials for large-scale components as energy storage or convertors, or for nano-scale electronic applications in information storage devices."}, "Modern Physical Metallurgy": {"title": "Modern Physical Metallurgy", "number": "3.40[J]", "description": "Examines how the presence of 1-, 2- and 3-D defects and second phases control the mechanical, electromagnetic and chemical behavior of metals and alloys. Considers point, line and interfacial defects in the context of structural transformations including annealing, spinodal decomposition, nucleation, growth, and particle coarsening. Concentrates on structure-function relationships, and in particular how grain size, interstitial and substitutional solid solutions, and second-phase particles impact mechanical and other properties  Industrially relevant case studies illustrate lecture concepts. Students taking the graduate version explore the subject in greater depth."}, "Colloids, Surfaces, Absorption, Capillarity, and Wetting Phenomena": {"title": "Colloids, Surfaces, Absorption, Capillarity, and Wetting Phenomena", "number": "3.41", "description": "Integrates elements of physics and chemistry toward the study of material surfaces. Begins with classical colloid phenomena and the interaction between surfaces in different media. Discusses the mechanisms of surface charge generation as well as how dispersion forces are created and controlled. Continues with exploration of chemical absorption processes and surface design of inorganic and organic materials. Includes examples in which such surface design can be used to control critical properties of materials in applications. Addresses lastly how liquids interact with solids as viewed by capillarity and wetting phenomena. Studies how materials are used in processes and applications that are intended to control liquids, and how the surface chemistry and structure of those materials makes such applications possible."}, "Electronic Materials Design": {"title": "Electronic Materials Design", "number": "3.42", "description": "Extensive and intensive examination of structure-processing-property correlations for a wide range of materials including metals, semiconductors, dielectrics, and optical materials.  Topics covered include defect equilibria; junction characteristics; photodiodes, light sources and displays; bipolar and field effect transistors; chemical, thermal and mechanical transducers; data storage.  Emphasis on materials design in relation to device performance."}, "Integrated Microelectronic Devices": {"title": "Integrated Microelectronic Devices", "number": "3.43[J]", "description": "Covers physics of microelectronic semiconductor devices for integrated circuit applications. Topics include semiconductor fundamentals, p-n junction, metal-oxide semiconductor structure, metal-semiconductor junction, MOS field-effect transistor, and bipolar junction transistor.  Emphasizes physical understanding of device operation through energy band diagrams and short-channel MOSFET device design and modern device scaling. Familiarity with MATLAB recommended."}, "Materials Processing for Micro- and Nano-Systems": {"title": "Materials Processing for Micro- and Nano-Systems", "number": "3.44", "description": "Processing of bulk, thin film, and nanoscale materials for applications in electronic, magnetic, electromechanical, and photonic devices and microsystems. Topics include growth of bulk, thin-film, nanoscale single crystals via vapor and liquid phase processes; formation, patterning and processing of thin films, with an emphasis on relationships among processing, structure, and properties; and processing of systems of nanoscale materials. Examples from materials processing for applications in high-performance integrated electronic circuits, micro-/nano-electromechanical devices and systems and integrated sensors."}, "Electrochemical Processing of Materials": {"title": "Electrochemical Processing of Materials", "number": "3.53", "description": "Thermodynamic and transport properties of aqueous and nonaqueous electrolytes. The electrode/electrolyte interface. Kinetics of electrode processes. Electrochemical characterization: d.c. techniques (controlled potential, controlled current), a.c. techniques (voltametry and impedance spectroscopy). Applications: electrowinning, electrorefining, electroplating, and electrosynthesis, as well as electrochemical power sources (batteries and fuel cells)."}, "Materials Selection, Design, and Economics": {"title": "Materials Selection, Design, and Economics", "number": "3.57", "description": "A survey of techniques for analyzing how the choice of materials, processes, and design determine properties, performance, and cost. Topics include production and cost functions, mathematical optimization, evaluation of single and multi-attribute utility, decision analysis, materials property charts, and performance indices. Students use analytical techniques to develop a plan for starting a new materials-related business."}, "Symmetry, Structure, and Tensor Properties of Materials": {"title": "Symmetry, Structure, and Tensor Properties of Materials", "number": "3.60", "description": "Studies the underlying structures of materials and deepens understanding of the relationship between the properties of materials and their structures. Topics include lattices, point groups, and space groups in both two and three dimensions; the use of symmetry in the tensor representation of crystal properties; and the relationship between crystalline structure and properties, including transport properties, piezoelectricity, and elasticity. Students taking graduate version complete additional assignments."}, "Soft Matter Characterization": {"title": "Soft Matter Characterization", "number": "3.65", "description": "Focuses on the design and execution of advanced experiments to characterize soft materials, such as synthetic and natural polymers, biological composites, and supramolecular nanomaterials. Each week focuses on a new characterization technique explored through interactive lectures, demonstrations, and lab practicum sessions in which students gain experience in key experimental aspects of soft matter sample preparation and characterization. Among others, topics include chemical characterization, rheology and viscometry, microscopy, and spectroscopic analyses. Limited to 15."}, "Teaching Fellows Seminar": {"title": "Teaching Fellows Seminar", "number": "3.69", "description": "Provides instruction to help prepare students for teaching at an advanced level and for industry or academic career paths. Topics include preparing a syllabus, selecting a textbook, scheduling assignments and examinations, lecture preparation, \"chalk and talk\" vs. electronic presentations, academic honesty and discipline, preparation of examinations, grading practices, working with teaching assistants, working with colleagues, mentoring outside the classroom, pursuing academic positions, teaching through technical talks, and successful grant writing strategies."}, "Teaching Materials Science and Engineering": {"title": "Teaching Materials Science and Engineering", "number": "3.692", "description": "Provides classroom or laboratory teaching experience under the supervision of faculty member(s). Students assist faculty by preparing instructional materials, leading discussion groups, and monitoring students' progress. Credit arranged on a case-by-case basis and reviewed by the department. Limited to Course 3 undergraduates selected by Teaching Assignments Committee."}, "Statistical Mechanics of Polymers": {"title": "Statistical Mechanics of Polymers", "number": "3.941[J]", "description": "Concepts of statistical mechanics and thermodynamics applied to macromolecules: polymer conformations in melts, solutions, and gels; Rotational Isomeric State theory, Markov processes and molecular simulation methods applied to polymers; incompatibility and segregation in incompressible and compressible systems; molecular theory of viscoelasticity; relation to scattering and experimental measurements."}, "Communities of the Living and the Dead: the Archaeology of Ancient Egypt": {"title": "Communities of the Living and the Dead: the Archaeology of Ancient Egypt", "number": "3.981", "description": "Examines the development of complex societies in Egypt over a 3000-year period. Uses archaeological and historical sources to determine how and why prehistoric communities coalesced into a long-lived and powerful state. Studies the remains of ancient settlements, tombs, and temples, exploring their relationships to one another and to the geopolitical landscape of Egypt and the Mediterranean world. Considers the development of advanced technologies, rise of social hierarchy, expansion of empire, role of writing, and growth of a complex economy."}, "The Ancient Andean World": {"title": "The Ancient Andean World", "number": "3.982", "description": "Examines development of Andean civilization which culminated in the extraordinary empire established by the Inka. Archaeological, ethnographic, and ethnohistorical approaches. Particular attention to the unusual topography of the Andean area, its influence upon local ecology, and the characteristic social, political, and technological responses of Andean people to life in a topographically \"vertical\" world. Characteristic cultural styles of prehistoric Andean life."}, "Materials in Ancient Societies: Ceramics": {"title": "Materials in Ancient Societies: Ceramics", "number": "3.984", "description": "Seminars and labs provide in-depth study of the technologies ancient societies used to produce objects from ceramic materials, including clays and mortars.  Seminars cover basic ceramic materials science and engineering and relate materials selection and processing to environment, exchange, political power, and cultural values."}, "Archaeological Science": {"title": "Archaeological Science", "number": "3.985[J]", "description": "Pressing issues in archaeology as an anthropological science. Stresses the natural science and engineering methods archaeologists use to address these issues. Reconstructing time, space, and human ecologies provides one focus; materials technologies that transform natural materials to material culture provide another. Topics include 14C dating, ice core and palynological analysis, GIS and other remote sensing techniques for site location, organic residue analysis, comparisons between Old World and New World bronze production, invention of rubber by Mesoamerican societies, analysis and conservation of Dead Sea Scrolls."}, "The Human Past: Introduction to Archaeology": {"title": "The Human Past: Introduction to Archaeology", "number": "3.986", "description": "From an archaeological perspective, examines ancient human activities and the forces that shaped them. Draws on case studies from the Old and/or New World. Exposes students to various classes of archaeological data, such as stone, bone, and ceramics, that help reconstruct the past."}, "Human Evolution: Data from Palaeontology, Archaeology, and Materials Science": {"title": "Human Evolution: Data from Palaeontology, Archaeology, and Materials Science", "number": "3.987", "description": "Examines human physical and cultural evolution over the past five million years via lectures and labs that incorporate data from human palaeontology, archaeology, and materials science. Topics include the evolution of hominin morphology and adaptations; the nature and structure of bone and its importance in human evolution; and the fossil and archaeological evidence for human behavioral and cultural evolution, from earliest times through the Pleistocene. Laboratory sessions include study of stone technology, artifacts, and fossil specimens."}, "Seminar in Archaeological Method and Theory": {"title": "Seminar in Archaeological Method and Theory", "number": "3.990", "description": "Designed for undergraduate seniors majoring in Archaeology and Materials. Critical analysis of major intellectual and methodological developments in American archaeology, including evolutionary theory, the \"New Archaeology,\" Marxism, formal and ideological approaches. Explores the use of science and engineering methods to reconstruct cultural patterns from archaeological data. Seminar format, with formal presentations by all students. Non-majors fulfilling all prerequisites may enroll by permission of instructors. Instruction and practice in oral and written communication provided."}, "Archaeology of the Middle East": {"title": "Archaeology of the Middle East", "number": "3.993", "description": "Explores the long history of the Middle East and its role as an enduring center of civilization and human thought. Beginning over 100,000 years ago and ending up in the present day, tackles major issues in the human career through examination of archaeological and written materials. Students track the course of human development in the Middle East, from hunting and gathering to cities and empires."}, "UPOP Engineering Practice Experience": {"title": "UPOP Engineering Practice Experience", "number": "3.EPE", "description": "Provides sophomores with guided practice in finding opportunities and excelling in the world of practice. Building on the skills and relationships acquired in the Engineering Practice Workshop, students receive coaching to articulate goals, invoke the UPOP network of mentors and employers, identify and pursue opportunities and negotiate terms of their summer assignment. Students complete a 10-12 week internship, which includes filing three progress reports, conducting one informational interview, and possibly hosting a site visit by MIT staff. Returning to campus as juniors, UPOP students take part in reflective exercises that aid assimilation of learning objectives and reinforce the cognitive link between all aspects of the UPOP experience and disciplinary fields of study. Sequence begins in the spring of sophomore year and ends in the fall of junior year."}, "UPOP Engineering Practice Workshop": {"title": "UPOP Engineering Practice Workshop", "number": "3.EPW", "description": "Develops foundational skills for the world of practice in science, technology, and engineering. Sophomores receive classroom instruction, and one-on-one and small-group coaching in basics of professional identity building. They attend field trips to local employers and receive job interview practice, coached by industry volunteers. Over IAP, students attend a weeklong Team Training Camp of experiential learning modules - led by MIT faculty with the help of MIT alums and other senior professionals in business, engineering, and science where students participate in creative simulations, team problem-solving challenges, and oral presentations, and practice networking with employers. Enrollment limited."}, "Undergraduate Research": {"title": "Undergraduate Research", "number": "3.URG", "description": "Provides sophomores with guided practice in finding opportunities and excelling in the world of practice. Building on the skills and relationships acquired in the Engineering Practice Workshop, students receive coaching to articulate goals, invoke the UPOP network of mentors and employers, identify and pursue opportunities and negotiate terms of their summer assignment. Students complete a 10-12 week internship, which includes filing three progress reports, conducting one informational interview, and possibly hosting a site visit by MIT staff. Returning to campus as juniors, UPOP students take part in reflective exercises that aid assimilation of learning objectives and reinforce the cognitive link between all aspects of the UPOP experience and disciplinary fields of study. Sequence begins in the spring of sophomore year and ends in the fall of junior year."}}