{"Design Studio: How to Design": {"title": "Design Studio: How to Design", "number": "4.021", "description": "Introduces fundamental design principles as a way to demystify design and provide a basic introduction to all aspects of the process. Stimulates creativity, abstract thinking, representation, iteration, and design development. Equips students with skills to have more effective communication with designers, and develops their ability to apply the foundations of design to any discipline. Limited to 25; preference to Course 4 and 4B majors and Design and Architecture minors, and first- and second-year students."}, "Design Studio: Introduction to Design Techniques and Technologies": {"title": "Design Studio: Introduction to Design Techniques and Technologies", "number": "4.022", "description": "Introduces the tools, techniques and technologies of design across a range of projects in a studio environment. Explores concepts related to form, function, materials, tools, and physical environments through project-based exercises. Develops familiarity with design process, critical observation, and the translation of design concepts into digital and physical reality. Utilizing traditional and contemporary techniques and tools, faculty across various design disciplines expose students to a unique cross-section of inquiry. Limited to 25; preference to Course 4 and 4B majors, Design and Architecture minors, and first- and second-year students."}, "Architecture Design Studio I": {"title": "Architecture Design Studio I", "number": "4.023", "description": "Provides instruction in architectural design and project development within design constraints including architectural program and site. Students engage the design process through various 2-dimensional and 3-dimensional media. Working directly with representational and model making techniques, students gain experience in the conceptual, formal, spatial and material aspects of architecture. Instruction and practice in oral and written communication provided. Preference to Course 4 majors and minors."}, "Architecture Design Studio II": {"title": "Architecture Design Studio II", "number": "4.024", "description": "Provides instruction in architectural design and project development with an emphasis on social, cultural, or civic programs. Builds on foundational design skills with more complex constraints and contexts. Integrates aspects of architectural theory, building technology, and computation into the design process. Preference to Course 4 majors."}, "Architecture Design Studio III": {"title": "Architecture Design Studio III", "number": "4.025", "description": "Provides instruction in more advanced architectural design projects. Students develop integrated design skills as they negotiate the complex issues of program, site, and form in a specific cultural context. Focuses on how architectural concepts and ideas translate into built environments that transform the public sphere. Studio designed to prepare students for graduate studies in the field. Preference to Course 4 majors."}, "Design Studio: How to Design Intensive": {"title": "Design Studio: How to Design Intensive", "number": "4.02A", "description": "Introduces fundamental design principles as a way to demystify design and provide a basic introduction to all aspects of the process. Stimulates creativity, abstract thinking, representation, iteration, and design development. Equips students with skills to have more effective communication with designers, and develops their ability to apply the foundations of design to any discipline. Limited to 30; preference to Course 4 and 4B majors and Design and Architecture minors, and first- and second-year students."}, "Design Studio: Objects and Interaction": {"title": "Design Studio: Objects and Interaction", "number": "4.031", "description": "Overview of design as the giving of form, order, and interactivity to the objects that define our daily life. Follows the path from project to interactive product. Covers the overall design process, preparing students for work in a hands-on studio learning environment. Emphasizes design development and constraints. Topics include the analysis of objects; interaction design and user experience; design methodologies, current dialogues in design; economies of scale vs. means; and the role of technology in design. Provides a foundation in prototyping skills such as carpentry, casting, digital fabrication, electronics, and coding. Limited to 15; preference to Course 4-B majors and Design Minors."}, "Design Studio: Information and Visualization": {"title": "Design Studio: Information and Visualization", "number": "4.033", "description": "Provides an introduction to working with information, data and visualization in a hands-on studio learning environment. Studies the history and theory of information, followed by a series of projects in which students apply the ideas directly. Progresses though basic data analysis, visual design and presentation, and more sophisticated interaction techniques. Topics include storytelling and narrative, choosing representations, understanding audiences, and the role of designers working with data. Graduate students are expected to complete additional assignments."}, "Design Studio: Advanced Product Design": {"title": "Design Studio: Advanced Product Design", "number": "4.041", "description": "Focuses on producing a small series of manufactured products. Students develop products that address specific user needs, propose novel design concepts, iteratively prototype, test functionality, and ultimately exhibit their work in a retail context. Stemming from new research and technological developments around MIT, students try to imagine the future products that emerge from new materials and machine intelligence. Provides an in-depth exploration of the design and manufacturing of products, through narrative, form, function, fabrication, and their relationship to customers. Enrollment imited to 15; preference to Course 4B majors and Design Minors."}, "Design Studio: Advanced Interactions": {"title": "Design Studio: Advanced Interactions", "number": "4.043", "description": "Overview of core principles and methodologies for the design of interaction and behavior across objects and spaces. Students develop high-fidelity, interactive prototypes that can be deployed and experienced by real users. Topics include the history of human-computer interaction, behavior prototyping, augmented and virtual reality, haptics, internet of things, and wearables. Provides a foundation in technical skills, such as physical prototyping, 2D and 3D animation, Unity, coding, and electronics. Enrollment limited to 16 students; preference given to 4B majors and Design minors."}, "The Human Factor in Innovation and Design Strategy": {"title": "The Human Factor in Innovation and Design Strategy", "number": "4.051", "description": "Focuses on understanding the emerging field of human-centered design and its approach to real-world design challenges. Through group working sessions, design reviews, and presentations by leading design practitioners, thinkers, and business leaders, the class explores core methodologies on how design brings value to human experiences and to the contemporary marketplace."}, "Visual Communication Fundamentals": {"title": "Visual Communication Fundamentals", "number": "4.053", "description": "Provides an introduction to visual communication, emphasizing the development of a visual and verbal vocabulary. Presents the fundamentals of line, shape, color, composition, visual hierarchy, word/image relationships and typography as building blocks for communicating with clarity, emotion, and meaning. Students develop their ability to analyze, discuss and critique their work and the work of the designed world. Limited to 15; preference to Course 4-B majors and Design minors."}, "Design Workshop: Fabricating Function": {"title": "Design Workshop: Fabricating Function", "number": "4.100", "description": "Through design and making, students discover the relationship between mind and hand and acquire the elemental skills necessary to research, conceptualize, represent, develop and fabricate design solutions to real-world problems. Covers the steps to creating and fabricating a functional object critical to understanding design and provides useful tools for problem solving in general. Lab fee. Limited to 15; preference to freshmen."}, "Geometric Disciplines and Architecture Skills I": {"title": "Geometric Disciplines and Architecture Skills I", "number": "4.105", "description": "Intensive introduction to architectural design tools and process, taught through a series of short exercises. Together with 4.107, covers a broad range of topics relating to the discourse of geometry as the basis of architectural design process. Focuses on projective drawings, explicit 3D modeling, and the reciprocity between representation and materialization. Lectures, workshops, and pin-ups address the architectural arguments intrinsic to geometry and its representation. Restricted to level one MArch students."}, "Materials and Fabrication for Architecture": {"title": "Materials and Fabrication for Architecture", "number": "4.109", "description": "Provides the material system knowledge and fabrication process skills to successfully engage with all areas of the shop, from precision handwork to multi-axis computer numerically controlled (CNC) machining. Progresses through a series of basic exercises that introduce the material and workflow, concluding with more complex problems that explore opportunities and issues specific to architecture. Lab fee. Limited to 12; preference to first-year MArch students."}, "Creative Computation": {"title": "Creative Computation", "number": "4.118", "description": "Dedicated to bridging the gap between the virtual and physical world, the subject embraces modes of computation that hold resonance with materials and methods that beg to be computed. Students engage in bi-weekly exercises to solve complex design problems. Each exercise is dedicated to a different computation approach (recursion, parametric, genetic algorithms, particle-spring systems, etc.) that is married to a physical challenge, thereby learning the advantages and disadvantages to each approach while verifying the results in physical and digitally fabricated prototypes. Through the tools of computation and fabrication, it empowers students to design as architects, engineers and craftspeople. Additional work required of student taking for graduate credit. Preference to Course 4-B majors and Design minors."}, "Furniture Making Workshop": {"title": "Furniture Making Workshop", "number": "4.125", "description": "Provides instruction in designing and building a functional piece of furniture from an original design. Develops woodworking techniques from use of traditional hand tools to digital fabrication. Gives students the opportunity to practice design without using a building program or code. Surveys the history of furniture making and includes site visits to local collections and artists/craftsmen. Additional work required of students taking for graduate credit. Limited to 12; preference to Course 4 students."}, "Architectural Assemblies": {"title": "Architectural Assemblies", "number": "4.123", "description": "Fosters a holistic understanding of the architectural-building cycle, enabling students to build upon the history of design and construction to make informed decisions towards developing innovative building systems. Includes an overview of materials, processing methods, and their formation into building systems across cultures. Looks at developing innovative architectural systems focusing on the building envelope. Seeks to adapt processes from the aerospace and automotive industries to investigate buildings as prefabricated design and engineering assemblies. Synthesizes knowledge in building design and construction systems, environmental and structural design, and geometric and computational approaches."}, "Architectural Design Theory and Methodologies": {"title": "Architectural Design Theory and Methodologies", "number": "4.130", "description": "Studies design as an interrogative technique to examine material sciences, media arts and technology, cultural studies, computation and emerging fabrication protocols. Provides in-depth, theoretical grounding to the notion of 'design' in architecture, and to the consideration of contemporary design methodologies, while encouraging speculation on emerging design thinking. Topical focus varies with instructor. May be repeated for credit with permission of department."}, "How to Make (Almost) Anything": {"title": "How to Make (Almost) Anything", "number": "4.140[J]", "description": "Provides a practical hands-on introduction to digital fabrication, including CAD/CAM/CAE, NC machining, 3-D printing and scanning, molding and casting, composites, laser and waterjet cutting, PCB design and fabrication; sensors and actuators; mixed-signal instrumentation, embedded processing, and wired and wireless communications. Develops an understanding of these capabilities through projects using them individually and jointly to create functional systems."}, "Architecture Design Core Studio I": {"title": "Architecture Design Core Studio I", "number": "4.151", "description": "Establishes foundational processes, techniques and attitudes towards architectural design. Includes projects of increasing scope and complexity engaging issues of structure, circulation, program, organization, building systems, materiality and tectonics. Develops methods of representation that incorporate both analogue and digital drawings and models. First in a sequence of design subjects, which must be taken in order. Limited to first-year MArch students."}, "Architecture Design Core Studio II": {"title": "Architecture Design Core Studio II", "number": "4.152", "description": "Builds on Core I skills and expands the constraints of the architectural problem to include issues of urban site logistics, cultural and programmatic material (inhabitation and human factors), and long span structures. Two related projects introduce a range of disciplinary issues, such as working with precedents, site, sectional and spatial proposition of the building, and the performance of the outer envelope. Emphasizes the clarity of intentions and the development of appropriate architectural and representational solutions. Limited to first-year MArch students."}, "Architecture Design Core Studio III": {"title": "Architecture Design Core Studio III", "number": "4.153", "description": "Interdisciplinary approach to design through studio design problems that engage the domains of building technology, computation, and the cultural/historical geographies of energy. Uses different modalities of thought to examine architectural agendas for 'sustainability'; students position their work with respect to a broader understanding of the environment and its relationship to society and technology. Students develop a project with a comprehensive approach to programmatic organization, energy load considerations, building material assemblies, exterior envelope and structure systems. Limited to second-year MArch students."}, "Architecture Design Option Studio": {"title": "Architecture Design Option Studio", "number": "4.154", "description": "Offers a broad range of advanced-level investigations in architectural design in various contexts, including international sites. Integrates theoretical and technological discourses into specific topics. Studio problems may include urbanism and city scale strategies, habitation and urban housing systems, architecture in landscapes, material investigations and new production technologies, programmatic and spatial complex building typologies, and research centered studies. Mandatory lottery process."}, "Urban Design Studio": {"title": "Urban Design Studio", "number": "4.163[J]", "description": "The design of urban environments. Strategies for change in large areas of cities, to be developed over time, involving different actors. Fitting forms into natural, man-made, historical, and cultural contexts; enabling desirable activity patterns; conceptualizing built form; providing infrastructure and service systems; guiding the sensory character of development. Involves architecture and planning students in joint work; requires individual designs or design and planning guidelines."}, "China Urban Design Studio": {"title": "China Urban Design Studio", "number": "4.173[J]", "description": "Design studio that includes architects and city planners working in teams on a contemporary development project of importance in China, particularly in transitional, deindustrializing cities. Students analyze conditions, explore alternatives, and synthesize architecture, city design, and implementation plans. Lectures and brief study tours expose students to history and contemporary issues of urbanism in China. Offered each spring at MIT in parallel with urban design studio at Tsinghua University, Beijing, involving students and faculty from both schools. Field visit to China will occur in January prior to studio. Limited to 10."}, "Architectural Design Workshop": {"title": "Architectural Design Workshop", "number": "4.183-4.185", "description": "Builds on Core I skills and expands the constraints of the architectural problem to include issues of urban site logistics, cultural and programmatic material (inhabitation and human factors), and long span structures. Two related projects introduce a range of disciplinary issues, such as working with precedents, site, sectional and spatial proposition of the building, and the performance of the outer envelope. Emphasizes the clarity of intentions and the development of appropriate architectural and representational solutions. Limited to first-year MArch students."}, "Preparation for MArch Thesis": {"title": "Preparation for MArch Thesis", "number": "4.189", "description": "Preparatory research development leading to a well-conceived proposition for the MArch design thesis. Students formulate a cohesive thesis argument and critical project using supportive research and case studies through a variety of representational media, critical traditions, and architectural/artistic conventions. Group study in seminar and studio format, with periodic reviews supplemented by conference with faculty and a designated committee member for each individual thesis. Restricted to MArch students."}, "Practical Experience in Architecture": {"title": "Practical Experience in Architecture", "number": "4.190", "description": "Practical experience through summer and January IAP internships secured by the student in the field of architecture, urbanism, digital design, art, or building technology. Before registering for this subject, students must have an employment offer and complete an application signed by the advisor. Upon completion of the internship, students must submit an employer evaluation form available from the departmental academic office. Registration limited to two summers and one IAP. Restricted to Course 4 students. Limited to two summers and one IAP."}, "Independent Study in Architecture Design": {"title": "Independent Study in Architecture Design", "number": "4.194", "description": "Establishes foundational processes, techniques and attitudes towards architectural design. Includes projects of increasing scope and complexity engaging issues of structure, circulation, program, organization, building systems, materiality and tectonics. Develops methods of representation that incorporate both analogue and digital drawings and models. First in a sequence of design subjects, which must be taken in order. Limited to first-year MArch students."}, "Precedents in Critical Practice": {"title": "Precedents in Critical Practice", "number": "4.210", "description": "Through formal analysis and discussion of historical and theoretical texts, seminar produces a map of contemporary architectural practice. Examines six pairs of themes in terms of their recent history: city and global economy, urban plan and map of operations, program and performance, drawing and scripting, image and surface, and utopia and projection. Restricted to year-one MArch students."}, "The Once and Future City": {"title": "The Once and Future City", "number": "4.211[J]", "description": "Examines the evolving structure of cities, the dynamic processes that shape them, and the significance of a city's history for its future development. Develops the ability to read urban form as an interplay of natural processes and human purposes over time. Field assignments in Boston provide the opportunity to use, develop, and refine these concepts. Enrollment limited."}, "Ecological Urbanism Seminar": {"title": "Ecological Urbanism Seminar", "number": "4.213[J]", "description": "Examines the urban environment as a natural phenomenon, human habitat, medium of expression, and forum for action. Subject has two related, major themes: how ideas of nature influence the way cities are perceived, designed, built, and managed; and how natural processes and urban form interact and the consequences of these for human health safety and welfare. Enrollment limited."}, "Water, Landscape and Urban Design": {"title": "Water, Landscape and Urban Design", "number": "4.214[J]", "description": "Workshop surveys how water affects the design of buildings, landscapes and cities in aesthetic, functional and symbolic ways. Combines the systematic study of water issues with urban design projects in South Asia and the US. Covers topics such as rainwater harvesting, water use efficiency, wastewater reuse, stormwater management, floodplain design, constructed wetlands, and waterfront development. Students work together to integrate these design concepts at the site, urban, and international scales. Limited to 15."}, "Disaster Resilient Design": {"title": "Disaster Resilient Design", "number": "4.218", "description": "Seminar examines the linkages between natural hazards and environmental design. Engages theoretical debates about landscapes of risk, vulnerability, and resilience. Participants generate proposals for disaster resilience through combinations of retrofit, reconstruction, resettlement, commemorative, and anticipatory design. Methods include rapid bibliographic search, risk analysis, landscape synthesis, and comparative international methods. Projects vary and may focus on current crises or involve collaboration with the Aga Khan Development Network and other humanitarian organizations. Additional work required of students taking the graduate version. Limited to 15; preference to Course 4 majors and minors."}, "Architecture Studies Colloquium": {"title": "Architecture Studies Colloquium", "number": "4.221", "description": "Series of open lectures, presented as an introduction to the diverse academic and creative community of MIT and the region, at which discipline groups of the SMArchS program converge and exchange ideas. Organized thematically, guest speakers from cultural and scientific fields present viewpoints in areas of emerging interest within design, building technology, architectural computation, history, and art. Encourages discourse with speakers and among students from different disciplines. Students initiate online debates among their peers and respond to an evolving series of discussions resulting in publication."}, "Professional Practice": {"title": "Professional Practice", "number": "4.222", "description": "Gives a critical orientation towards a career in architectural practice. Uses historical and current examples to illustrate the legal, ethical and management concepts underlying the practice of architecture. Emphasis on facilitating design excellence and strengthening connections between the profession and academia."}, "Landscapes of Energy": {"title": "Landscapes of Energy", "number": "4.227", "description": "Spatializes large technological systems of energy, analyzes existing and speculative energy visions, and imagines energy futures in relation to concerns of ecology, politics, and aesthetics. Identifies different scales of thinking about the territory of energy from that of environmental systems, to cities, regions, and global landscapes. Readings and students' research projects draw on critical geography, history of technology, environmental history to synthesize energy attributes within the design disciplines."}, "Contemporary Urbanism Proseminar: Theory and Representation": {"title": "Contemporary Urbanism Proseminar: Theory and Representation", "number": "4.228", "description": "Critical introduction to key contemporary positions in urbanism to the ends of researching, representing, and designing territories that respond to the challenges of the 21st century. Provides an overview of contemporary urban issues, situates them in relation to a genealogy of urban precedents, and constructs a theoretical framework that engages the allied fields of architecture, landscape architecture, political ecology, geography, territorial planning, and environmental humanities. Comprised of three sections, first section articulates a framework on the urban as both process and form, shifting the emphasis from city to territory. Second section engages a series of related urban debates, such as density/sprawl, growth/shrinkage, and codes/exception. Third section calls upon urban agency in the age of environment through the object of infrastructures of trash, water, oil, and food. Limited to 25."}, "SIGUS Workshop": {"title": "SIGUS Workshop", "number": "4.230[J]", "description": "Interdisciplinary projects and interactive practices in urban settlement issues as investigated by MIT's SIGUS (Special Interest Group in Urban Settlements), with a focus on developing countries throughout the world. Participation by guest practitioners. Additional work required of students taking the graduate version."}, "The New Global Planning Practitioner": {"title": "The New Global Planning Practitioner", "number": "4.232[J]", "description": "Considers a new interdisciplinary paradigm of practice that regards dialogue among practitioners and users essential for efficacious and creative design and planning process. Focuses on non-traditional client groups: communities, the poor, and the generally excluded middle-income. Explores key issues confronting development practitioners, with stress on practical exercises drawn from current national and international case studies; e.g., an investigative comparison of cities or tools in coping with impending rapid and massive growth and expansion. Engages those with a design and community service orientation."}, "Urban Design Skills: Observing, Interpreting, and Representing the City": {"title": "Urban Design Skills: Observing, Interpreting, and Representing the City", "number": "4.240[J]", "description": "Introduces methods of recording, evaluating, and representing the urban environment. Through visual observation, field analysis, measurements, interviews, and other means, students draw on their senses and develop their ability to deduce, conclude, question, and test conclusions about how the environment is used and valued. Using representational tools such as drawing, photographing, computer modeling and desktop publishing, students communicate what they observe along with their impressions and design ideas. Intended as a foundation for future studio work in urban design. Includes design-based projects."}, "The Making of Cities": {"title": "The Making of Cities", "number": "4.251", "description": "Examines the complex development of cities through history by tracing a diachronic accumulation of forms and spaces in specific cities, and showing how significant ideas were made manifest across distinct geographies and cultures. Emphasizes how economic, spiritual, political, geographic and technological forces have simultaneously shaped and, in turn, been influenced by the city. Additional work required of students taking graduate version."}, "Urban Design Seminar: Perspectives on Contemporary Practice": {"title": "Urban Design Seminar: Perspectives on Contemporary Practice", "number": "4.244[J]", "description": "Examines innovations in urban design practice occurring through the work of leading practitioners in the fields of architecture, landscape architecture, and urban planning. Features lectures by major national and global practitioners in urban design. Projects and topics vary based on term and speakers but may cover architectural urbanism, landscape and ecology, arts and culture, urban design regulation and planning agencies, and citywide and regional design. Focuses on analysis and synthesis of themes discussed in presentations and discussions."}, "DesignX Entrepreneurship": {"title": "DesignX Entrepreneurship", "number": "4.245[J]", "description": "Students work in teams to create their own design and business narrative, technology and social strategies, and preliminary plan for moving their innovation forward. Lectures and workshops are interspersed with one-on-one critiques with instructors and outside mentors in specific areas of student interest. Students visit SA+P alumni firms to learn how principals have developed their own business, technology, design, and civic platforms. End-of-term presentation highlights important features of their venture. Limited to 30; preference to students in DesignX Program."}, "DesignX Accelerator": {"title": "DesignX Accelerator", "number": "4.246[J]", "description": "Students work in entrepreneurial teams to advance innovative ideas, products, services, and firms oriented to design and the built environment.  Lectures, demonstrations, and presentations are supplemented by workshop time, when teams interact individually with instructors and industry mentors, and by additional networking events and field trips.  At the end of the term, teams pitch for support of their venture to outside investors, accelerators, companies, or cities. Limited to 30; preference to students in DesignX Program."}, "Urban Design Ideals and Action": {"title": "Urban Design Ideals and Action", "number": "4.247[J]", "description": "Examines the relationship between urban design ideals, urban design action, and the built environment through readings, discussions, presentations, and papers. Analyzes the diverse design ideals that influence cities and settlements, and investigates how urban designers use them to shape urban form. Provides a critical understanding of the diverse formal methods used to intervene creatively in both developed and developing contexts, especially pluralistic and informal built environments."}, "Introduction to Urban Design and Development": {"title": "Introduction to Urban Design and Development", "number": "4.252[J]", "description": "Examines the physical and social structure of cities and ways they can be changed. Includes historical forces that have produced cities, models of urban form, contemporary theories of urban design, implementation strategies. Core lectures are supplemented by student projects analyzing the evolution of urban place, and factors of high quality urban design and development. Guest speakers present cases involving current projects illustrating the scope and methods of urban design practice."}, "Urban Design Politics": {"title": "Urban Design Politics", "number": "4.253[J]", "description": "Examines ways urban design contributes to distribution of political power and resources in cities. Investigates the nature of relations between built form and political purposes through close study of a wide variety of situations where public sector design commissions and planning processes have been clearly motivated by political pressures. Lectures and discussions focus on specific case studies of 20th-century government-sponsored designs carried out under diverse regimes in the US, Europe, and elsewhere."}, "Real Estate Development Studio": {"title": "Real Estate Development Studio", "number": "4.254[J]", "description": "Focuses on the synthesis of urban, mixed-use real estate projects, including the integration of physical design and programming with finance and marketing. Interdisciplinary student teams analyze how to maximize value across multiple dimensions in the process of preparing professional development proposals for sites in US cities and internationally. Reviews emerging real estate products and innovative developments to provide a foundation for studio work. Two major projects are interspersed with lectures and field trips. Integrates skills and knowledge in the MSRED program; also open to other students interested in real estate development by permission of the instructors."}, "Site and Environmental Systems Planning": {"title": "Site and Environmental Systems Planning", "number": "4.255[J]", "description": "Introduces a range of practical approaches involved in evaluating and planning sites within the context of natural and cultural systems. Develops the knowledge and skills to analyze and plan a site for development through exercises and an urban design project. Topics include land inventory, urban form, spatial organization of uses, parcelization, design of roadways, grading, utility systems, off-site impacts, and landscape architecture."}, "Advanced Seminar in Landscape and Urbanism": {"title": "Advanced Seminar in Landscape and Urbanism", "number": "4.264[J]", "description": "Explores theories, practices, and emerging trends in the fields of landscape architecture and urbanism, such as systemic design, landscape urbanism, engineered nature, drosscapes, urban biodiversity, urban mobility, megaregions, and urban agriculture. Lectures, readings, and guest speakers present a wide array of multi-disciplinary topics, including current works from P-REX lab. Students conduct independent and group research that is future-oriented."}, "Innovation for Disaster Relief and Preparedness": {"title": "Innovation for Disaster Relief and Preparedness", "number": "4.270", "description": "Explores innovative solutions for disaster relief and preparedness through both design and engineering. Interactive exercises provide an overview of large-scale disaster relief issues, including response communities, operating environments, logistics and technical challenges. Projects will be developed through hands-on prototyping, emphasizing the importance of system-oriented, sustainable design. Speakers from organizations such as FEMA and The Red Cross will contribute."}, "Independent Study in Architecture Studies": {"title": "Independent Study in Architecture Studies", "number": "4.294", "description": "Considers a new interdisciplinary paradigm of practice that regards dialogue among practitioners and users essential for efficacious and creative design and planning process. Focuses on non-traditional client groups: communities, the poor, and the generally excluded middle-income. Explores key issues confronting development practitioners, with stress on practical exercises drawn from current national and international case studies; e.g., an investigative comparison of cities or tools in coping with impending rapid and massive growth and expansion. Engages those with a design and community service orientation."}, "Introduction to Artistic Experimentation": {"title": "Introduction to Artistic Experimentation", "number": "4.301", "description": "Introduces artistic practice and critical visual thinking through three studio-based projects using different scales and media, for instance, \"Body Extension,\" \"Shaping Time,\" \"Public Making,\" and/or \"Networked Cultures.\" Each project concludes with a final presentation and critique. Students explore sculptural, architectural, performative artistic methods; video and sound art; site interventions and strategies for artistic engagement in the public realm. Lectures, screenings, guest presentations, field trips, readings, and debates supplement studio practice. Also introduces students to the historic, cultural, and environmental forces affecting both the development of an artistic vision and the reception of a work of art. Lab fee required. Limited to 20."}, "Foundations in Art, Design, and Spatial Practices": {"title": "Foundations in Art, Design, and Spatial Practices", "number": "4.302", "description": "Develops an introductory foundation in artistic practice and its critical analysis, and develops artistic approaches and methods by drawing analogies to architectural thinking, urbanism, and design practice. Covers how to communicate ideas and experiences on different scales and through two-dimensional, three-dimensional, and time-based media in new genres. Uses artistic methods that engage the public realm through spatial, sculptural, performative, and process-oriented practices. Instruction components include video screenings, guest lectures, visiting artist presentations, and field trips. Instruction and practice in written and oral communication provided. Lab fee required. Enrollment limited; preference to Course 4 majors and minors."}, "Art, Architecture, and Urbanism in Dialogue": {"title": "Art, Architecture, and Urbanism in Dialogue", "number": "4.308", "description": "Initiates a dialogue between architecture, urbanism, and contemporary art by focusing on the work of practitioners who intertwine the three disciplines in a critical spatial practice. Investigates themes and works ranging from early modernist practices to the contemporary and research based. Lectures, screenings, readings, and discussions with guests and faculty contribute to the development of group and individual projects and their presentation. Additional work required of students taking graduate version. Lab fee required. Limited to 20."}, "Advanced Studio on the Production of Space": {"title": "Advanced Studio on the Production of Space", "number": "4.312", "description": "Introduces historical and contemporary spatial concepts from various cultures and geo-political settings, and examines how they relate to artistic process and production. Explores the relational qualities of spatial concepts and reflects on their producers and proponents; investigates the notion of utopian, dystopian and heterotopian space, inner and outer space, the void, the vacuum, the in-between, and \"real\" versus \"virtual\" space. Lectures, readings, screenings, presentations, and guest speakers from various disciplines support the development of individual and collective projects. Additional work required of students taking the graduate version. Lab fee required. Limited to 20."}, "Advanced Workshop in Artistic Practice and Transdisciplinary Research": {"title": "Advanced Workshop in Artistic Practice and Transdisciplinary Research", "number": "4.314", "description": "Examines artistic practice as a form of critical inquiry and knowledge production. Offers opportunity to develop art as a means for addressing the social, cultural, and ecological consequences of technology, to build bridges between industry and culture, and to challenge the boundaries between public and private, and human and non-human. Provides instruction in evaluating models of experimentation, individual research, and collaboration with other disciplines in the arts, culture, science, and technology. Supports the development of individual and collective artistic research projects. Additional work required of students taking the graduate version. Lab fee required. Limited to 20."}, "Introduction to Sound Creations": {"title": "Introduction to Sound Creations", "number": "4.321", "description": "Develops a critical awareness of how sound art as a field for artistic exploration is performed, produced, and distributed. Explores contemporary and historical practices that emerge outside of purely musical environments and investigates specific compositional developments of post-war modernity and electro-acoustic music, as well as non-musical disciplines related to the psychophysics of hearing and listening. Lectures, screenings, readings, and discussions with guests and faculty contribute to the development of group and individual projects. Additional work required of students taking the graduate version. Lab fee required. Limited to 20."}, "Introduction to Three-Dimensional Art Work": {"title": "Introduction to Three-Dimensional Art Work", "number": "4.323", "description": "Explores three-dimensional art work, including sculptures and installations, from design to model to finished piece. Addresses challenges associated with design and fabrication, process, context, and relationships between objects, the body, and physical or cultural environments. Lectures, screenings, field trips, readings, and debates supplement studio practice. Additional work required of students taking the graduate version. Lab fee required. Limited to 20."}, "Introduction to Photography and Related Media": {"title": "Introduction to Photography and Related Media", "number": "4.341", "description": "Introduces history and contemporary practices in artistic photography through projects, lectures, artist visits, group discussions, readings, and field trips. Fosters visual literacy and aesthetic appreciation of photography/digital imaging, as well as critical awareness of how images in our culture are produced and constructed. Provides instruction in the fundamentals of different camera formats, film exposure and development, lighting, black and white darkroom printing, and digital imaging. Assignments allow for incorporation of a range of traditional and experimental techniques, development of technical skills, and personal exploration. Throughout the term, present and discuss projects in a critical forum. Additional work required of students taking the graduate version. Lab fee required. Limited to 20."}, "Advanced Photography and Related Media": {"title": "Advanced Photography and Related Media", "number": "4.345", "description": "Fosters critical awareness of how images in our culture are produced and constructed. Covers a range of experimental techniques and camera formats, advanced traditional and experimental black-and-white darkroom printing, and all aspects of digital imaging and output. Includes individual and group reviews, field trips, and visits from outside professionals. Topical focus changes each term; coursework centers on student-initiated project with emphasis on conceptual, theoretical, and technical development. Additional work required of students taking the graduate version. Equipment available for checkout. Lab fee required. Limited to 20."}, "Advanced Video and Related Media": {"title": "Advanced Video and Related Media", "number": "4.353", "description": "Introduces advanced strategies of image and sound manipulation, both technical and conceptual. Covers pre-production planning (storyboards and scripting), refinement of digital editing techniques, visual effects such as chroma-keying, post-production, as well as audio and sonic components. Context provided by regular viewings of contemporary video artworks and other audio-visual formats. Students work individually and in groups to develop skills in media literacy and communication. Additional work required of students taking the graduate version. Lab fee required. Limited to 20."}, "Introduction to Video and Related Media": {"title": "Introduction to Video and Related Media", "number": "4.354", "description": "Examines the technical and conceptual variables and strategies inherent in contemporary video art practice. Analyzes structural concepts of time, space, perspective, and sound within the art form. Building upon the historical legacy of the moving the image, students render self-exploration, performance, social critique, and manipulation of raw experience into an aesthetic form. Emphasizes practical knowledge of lighting, video capturing and editing, and montage. Presentation and critique of student work, technical workshops, screenings, and reading discussions assist students with final project. Additional work required of students taking the graduate version. Lab fee required. Limited to 20."}, "Cinematic Migrations": {"title": "Cinematic Migrations", "number": "4.356", "description": "Explores ideas and contexts behind moving images through a multifaceted look at cinema's transmutations, emergence on local and national levels, and global migrations. Examines the transformation caused by online video, television, spatial installations, performances, dance, and many formats and portable devices, as well as the theory and context of film's categorization, dissemination, and analysis. Presentations, screenings, field trips, readings, visiting artists, and experimental transdisciplinary projects broaden the perception of present cinema. Additional work required of students taking the graduate version. Lab fee required. Limited to 12."}, "Performance Art Workshop": {"title": "Performance Art Workshop", "number": "4.361", "description": "Surveys performance in relation to media and to spatial structures imagined as settings for narrative movements, and uses video to explore the perception of sounds and images and how they are altered by various devices. Students design visual forms and performative actions, and make props or objects that embody aspects of their narratives. Activities include readings and screenings on the theoretical and historical background of performance art. Assignments lead to a final performance project. Additional work required of students taking graduate version. Lab fee required. Limited to 20."}, "Studio Seminar in Art and the Public Sphere": {"title": "Studio Seminar in Art and the Public Sphere", "number": "4.369", "description": "Focuses on the production of artistic interventions in public space. Explores ideas, situations, objects, and materials that shape public space and inform the notion of publicness, with an emphasis on coproduction and cooperative ethics. Examines forms of environmental art in comparison to temporal and critical forms of art and action in the public sphere. Historical models include the Russian Constructivists, the Situationists International, ecosystematic aesthetics, conceptual art, and contemporary interventionist tactics and artistic strategies. Helps students develop an initial concept for a publicly-situated project. Includes guest lectures, visiting artist presentations, and optional field trips. Additional work required of students taking graduate version. Lab fee required. Limited to 12."}, "Advanced Projects in Art, Culture and Technology": {"title": "Advanced Projects in Art, Culture and Technology", "number": "4.373", "description": "Investigates conceptual and formal issues in a variety of media. Explores representation, interpretation and meaning, and how these relate to historical, social and cultural contexts. Helps students develop an initial concept for a publicly situated project. Includes guest lectures and visiting artist presentations. Additional work required of students taking graduate version. Lab fee required. Limited to 20."}, "Preparation for SMACT Thesis": {"title": "Preparation for SMACT Thesis", "number": "4.388", "description": "Aids students in the selection of a thesis topic, development of an approach method, preparation of a proposal that includes an outline for their thesis. Explores artistic practice as a method of critical inquiry and knowledge production/dissemination. Students examine artist writings and consider academic formats and standards. Regular group meetings, including peer reviews, are supplemented by independent study and individual conferences with faculty. Restricted to first-year SMACT students."}, "Tutorial for SMACT Thesis": {"title": "Tutorial for SMACT Thesis", "number": "4.389", "description": "Series of tutorials that includes regular presentations of student writing in group critiques and supports independent thesis research and development by providing guidance on research strategy and written presentation. Sessions supplemented by regular individual conferences with thesis committee members. Restricted to second-year SMACT students."}, "Art, Culture and Technology Studio": {"title": "Art, Culture and Technology Studio", "number": "4.390", "description": "Explores the theory and criticism of intersections between art, culture, and technology in relation to contemporary artistic practice, critical design, and media. Students consider methods of investigation, documentation, and display and explore modes of communication across disciplines. Students develop projects in which they organize research methods and goals, engage in production, cultivate a context for their practice, and explore how to compellingly communicate, display, and document their work. Regular presentation and peer-critique sessions, as well as reviews involving ACT faculty and fellows, and external guest reviewers provide students with ample feedback as their projects develop. Restricted to SMACT students."}, "Environmental Technologies in Buildings": {"title": "Environmental Technologies in Buildings", "number": "4.464", "description": "Introduction to the study of the thermal and luminous behavior of buildings. Examines the basic scientific principles underlying these phenomena and introduces students to a range of technologies and analysis techniques for designing comfortable indoor environments. Challenges students to apply these techniques and explore the role energy and light can play in shaping architecture. Additional work required of students taking the graduate version."}, "D-Lab Schools: Building Technology Laboratory": {"title": "D-Lab Schools: Building Technology Laboratory", "number": "4.411[J]", "description": "Focuses on the design, analysis, and application of technologies that support the construction of less expensive and better performing schools in developing countries. Prepares students to design or retrofit school buildings in partnership with local communities and NGOs. Strategies covered include daylighting, passive heating and cooling, improved indoor air quality via natural ventilation, appropriate material selection, and structural design. Investigations are based on application of engineering fundamentals, experiments and simulations. Case studies illustrate the role of technologies in reducing barriers to improved education."}, "Space-Conditioning Systems for Low-Carbon Buildings": {"title": "Space-Conditioning Systems for Low-Carbon Buildings", "number": "4.421", "description": "Studies the thermofluid principles of, and design strategies for, natural and mechanical systems for conditioning high-performance buildings that are needed to reduce anthropogenic emissions of greenhouse gases in coming decades. Topics include the dynamics of airflow in buildings in urban areas and the design of natural and mixed-mode ventilation systems, low-energy strategies and systems for dehumidification and sensible cooling, and  thermal storage at diurnal and seasonal time scales. System design in leading commercial practice is presented and critiqued by invited practitioners and students. Through a group project, students assess climate- and building-specific systems on the basis of energy consumption, carbon emissions, and resilience to climate change."}, "Modeling and Approximation of Thermal Processes": {"title": "Modeling and Approximation of Thermal Processes", "number": "4.424[J]", "description": "Provides instruction on how to model thermal transport processes in typical engineering systems such as those found in manufacturing, machinery, and energy technologies. Successive modules cover basic modeling tactics for particular modes of transport, including steady and unsteady heat conduction, convection, multiphase flow processes, and thermal radiation. Includes a creative design project executed by the students."}, "Daylighting and Solar Gain Control": {"title": "Daylighting and Solar Gain Control", "number": "4.430", "description": "Studies natural and electric lighting in an architectural context. Promotes the integration of occupant comfort, energy efficiency and daylight availability throughout the design process, with an emphasis on the role light can play in shaping architecture. Through group and individual projects, students practice design techniques, from rule of thumb simulations to high dynamic range photography and physical model building. Offered for 9 or 12 units."}, "Architectural Acoustics": {"title": "Architectural Acoustics", "number": "4.431", "description": "Describes interactions between people and sound, indoors and outdoors, and uses this information to develop acoustical design criteria for architecture and planning. Principles of sound generation, propagation, and reception. Properties of materials for sound absorption, reflection, and transmission. Design implications for performance and gathering spaces. Use of computer modeling techniques."}, "Modeling Urban Energy Flows for Sustainable Cities and Neighborhoods": {"title": "Modeling Urban Energy Flows for Sustainable Cities and Neighborhoods", "number": "4.432", "description": "Studies energy flows in and around groups of buildings from individual buildings to complete large-scale neighborhoods. Students use emerging digital techniques to analyze and influence building design interventions in relation to energy use for construction (embodied energy) and operation, access to daylight, and assessing walkability and outdoor comfort at the neighborhood scale. Additional work required of students taking the graduate version."}, "Introduction to Structural Design": {"title": "Introduction to Structural Design", "number": "4.462", "description": "Introduces the design and behavior of large-scale structures and structural materials. Emphasizes the development of structural form and the principles of structural design. Introduces design methods for timber, masonry, concrete, and steel applied to long-span roof systems, bridges, and high-rise buildings. Includes environmental assessment of structural systems and materials. Laboratory to solve structural problems by building and testing simple models. Graduate and undergraduate students have separate lab sections."}, "Computational Structural Design and Optimization": {"title": "Computational Structural Design and Optimization", "number": "4.451", "description": "Research seminar focusing on emerging applications of computation for creative, early-stage structural design and optimization for architecture. Incorporates computational design fundamentals, including problem parameterization and formulation; design space exploration strategies, including interactive, heuristic, and gradient-based optimization; and computational structural analysis methods, including the finite element method, graphic statics, and approximation techniques. Programing experience and familiarity with structural mechanics necessary. Additional work required of students taking for graduate credit. Limited to 30."}, "Building Technology Systems: Structures and Envelopes": {"title": "Building Technology Systems: Structures and Envelopes", "number": "4.463", "description": "Addresses advanced structures, exterior envelopes, and contemporary production technologies. Continues the exploration of structural elements and systems, expanding to include more complex determinate, indeterminate, long-span, and high-rise systems. Topics include reinforced concrete, steel and engineered-wood design, and an introduction to tensile systems. The contemporary exterior envelope is discussed with an emphasis on the classification of systems, performance attributes, and analysis techniques, material specifications and novel construction technologies."}, "Building Technology Seminar": {"title": "Building Technology Seminar", "number": "4.481", "description": "Fundamental research methodologies and ongoing investigations in building tehnology to support the development of student research projects. Topics drawn from low energy building design and thermal comfort, building systems analysis and control, daylighting, structural design and analysis, novel building materials and construction techniques and resource dynamics. Organized as a series of two- and three-week sessions that consider topics through readings, discussions, design and analysis projects, and student presentations."}, "Design Computation: Art, Objects and Space": {"title": "Design Computation: Art, Objects and Space", "number": "4.500", "description": "Introduces 3-D CAD modeling to students with little or no experience in design or computation. Teaches surface, solid and mesh modeling techniques combined with a variety of modeling applications, from 3D printing to CNC fabrication and 3D rendering. Includes weekly modeling assignments leading up to a final project. Enrollment limited; preference to Course 4 and 4-B majors, and Design and Architecture minors. Lab fee."}, "Advanced Design Projects in Digital Fabrication": {"title": "Advanced Design Projects in Digital Fabrication", "number": "4.511", "description": "Integrates iterative design on paper with physical prototyping across many scales, thereby addressing digital fabrication and online presentation as a single design process. Begins with machine learning and moves on to stepped design and production process using 3-D printing, laser cutting, and CNC machining. Students complete a final project in which they individually design and fabricate a functional piece of furniture.  Additional work required of students taking graduate version. Preference given to M.Arch and Department of Architecture majors and minors."}, "Advanced Visualization: Architecture in Motion Graphics": {"title": "Advanced Visualization: Architecture in Motion Graphics", "number": "4.562", "description": "Advanced projects in architectural visualization with an emphasis on the use of computer graphics animation, interactive media, and video production tools. Introduces advanced visualization software and teaches exploration of spatial expressions in motion graphics format. Review and discussion of selected literature and video materials on architecture and film. Additional work required of students taking the graduate version. Preference to Course 4 and 4-B majors and Design and Architecture minors."}, "Design Scripting": {"title": "Design Scripting", "number": "4.564", "description": "Introduces fundamental ideas of computer programming and demonstrates their application to the process of visual and spatial design. Teaches methods for algorithmically modeling visual and spatial forms, evaluating their conditions, building interface, and processing formal data for prototyping, manufacturing, rendering, and other design tools. Proceeds through a sequence of scripting exercises in application programming environments. Each exercise requires a student to articulate computational tasks in the context of a design, and to write codes that produce graphic solutions. Additional work required of students taking the graduate version."}, "Introduction to Building Information Modeling in Architecture": {"title": "Introduction to Building Information Modeling in Architecture", "number": "4.567", "description": "Addresses fundamental methods, theories, and practices that engage contemporary modeling tools in the context of architectural design. Introduces selected academic and professional topics through lectures, demonstrations, and  assignments. Topics include parametric modeling, component types and assembly, prototyping, scripting, and simulations. Initiates intellectual explorations in the use of building information modeling in research projects and design practices. Additional work required of students taking graduate version."}, "Visual Computing I": {"title": "Visual Computing I", "number": "4.521", "description": "Introduces a visual-perceptual, rule-based approach to design using shape grammars. Covers grammar fundamentals through lectures and in-class, exercises. Focuses on shape grammar applications, from stylistic analysis to creative design, through presentations of past applications and through short student exercises and projects. Presents computer programs for automating shape grammars. Additional work required of students taking graduate version."}, "Visual Computing II": {"title": "Visual Computing II", "number": "4.523", "description": "Introduces a visual-perceptual, rule-based approach to design using shape grammars. Covers grammar fundamentals through lectures and in-class, exercises. Focuses on shape grammar applications, from stylistic analysis to creative design, through presentations of past applications and through short student exercises and projects. Presents computer programs for automating shape grammars. Additional work required of students taking graduate version."}, "Introduction to Shape Grammars I": {"title": "Introduction to Shape Grammars I", "number": "4.540", "description": "An in-depth introduction to shape grammars and their applications in architecture and related areas of design. Shapes in the algebras Ui j, in the algebras Vi j and Wi j incorporating labels and weights, and in algebras formed as composites of these. Rules and computations, shape and structure, designs."}, "Background to Shape Grammars": {"title": "Background to Shape Grammars", "number": "4.542", "description": "An advanced examination of the shape grammar formalism and its relationship to some key issues in a variety of other fields, including art and design, philosophy, history and philosophy of science, linguistics and psychology, literature and literary studies, logic and mathematics, and artificial intelligence. Student presentations and discussion of selected readings are encouraged. Topics vary from year to year. Can be repeated with permission of instructor."}, "Computational Design Lab": {"title": "Computational Design Lab", "number": "4.570", "description": "Provides students with an opportunity to explore projects that engage real world problems concerning spatial design, technology, media, and society. In collaboration with industry partners and public institutions, students identify topical issues and problems, and also explore and propose solutions through the development of new ideas, theories, tools, and prototypes. Industry and academic collaborators act as a source of expertise, and as clients and critics of projects developed during the term. General theme of workshop varies by semester or year. Open to students from diverse backgrounds in architecture and other design-related areas. Additional work required of students taking graduate version."}, "City Science": {"title": "City Science", "number": "4.557[J]", "description": "Focuses on architectural and mobility interventions that respond to changing patterns of living, working, and transport. Emphasizes mass-customized housing, autonomous parking, charging infrastructure, and shared-use networks of lightweight electric vehicles (LEVs). Students work in small teams and are lead by researchers from the Changing Places group. Projects focus on the application of these ideas to case study cities and may include travel. Invited guests from academia and industry participate. Repeatable for credit with permission of instructor."}, "Designing Interactions": {"title": "Designing Interactions", "number": "4.569[J]", "description": "Explores the future of mobile interactions and pervasive computing, taking into consideration design, technological, social and business aspects. Discusses theoretical works on human-computer interaction, mobile media and interaction design, and covers research and design methods. Students work in multidisciplinary teams and participate in user-centric design projects aimed to study, imagine and prototype concepts illustrating the future of mobile applications and ubiquitous computing. Students taking graduate version complete additional assignments. Repeatable for credit with permission of instructor. Limited to 12."}, "Inquiry into Computation and Design": {"title": "Inquiry into Computation and Design", "number": "4.580", "description": "Explores the varied nature, history and practice of computation in design through lectures, readings, small projects, discussions, and guest visits by Computation group faculty and others. Topics may vary from year to year.  Aims to help students develop a critical awareness of different approaches to and assumptions about computation in design beyond the specifics of techniques and tools, and to open avenues for further research."}, "Introduction to Art History": {"title": "Introduction to Art History", "number": "4.601", "description": "Introduction to the history and interpretation of western art that explores painting, graphic arts and sculpture from the Renaissance to the present. Engages diverse methodological perspectives to examine changing conceptions of art and the artist, and to investigate the plural meaning of artworks within the larger contexts of culture and history. Subject includes trips to local museums."}, "Modern Art and Mass Culture": {"title": "Modern Art and Mass Culture", "number": "4.652", "description": "Introduction to theories of modernism and postmodernism and their related forms (roughly 18th century to present) in art and design. Focuses on how artists use the tension between fine art and mass culture to critique both. Examines visual art in a range of genres, from painting to design objects and \"relational aesthetics.\" Works of art are viewed in their interaction with advertising, caricature, comics, graffiti, television, fashion, \"primitive\" art, propaganda, and networks on the internet. Additional work required of students taking the graduate version."}, "Understanding Modern Architecture": {"title": "Understanding Modern Architecture", "number": "4.603", "description": "Examines modern architecture, art, and design in the context of the political, economic, aesthetic, and cultural changes that occurred in the twentieth century. Presents foundational debates about social and technological aspects of modern architecture and the continuation of those debates into contemporary architecture. Incorporates varied techniques of historical and theoretical analysis to interpret exemplary objects, buildings, and cities of modernity. Additional work required of students taking the graduate version. Preference to Course 4 majors and minors."}, "A Global History of Architecture": {"title": "A Global History of Architecture", "number": "4.650", "description": "Provides an outline of the history of architecture and urbanism from ancient times to the early modern period. Analyzes buildings as the products of culture and in relation to the special problems of architectural design. Stresses the geopolitical context of buildings and in the process familiarizes students with buildings, sites and cities from around the world. Additional work required of graduate students."}, "Visual Perception and Art": {"title": "Visual Perception and Art", "number": "4.606", "description": "Introduces visual perception from neurological, cultural, and artistic vantage points. Examines aspects of visual culture ranging from body adornment to public spaces, and from logotypes to moving images. Topics range from ritual space to forensics to machine-aided vision (cameras, radar devices, robotic scanners). Designed to develop skills in visual analysis and interpretation through lectures, oral presentations, field trips, and written essays. Enrollment limited."}, "Thinking About Architecture: In History and At Present": {"title": "Thinking About Architecture: In History and At Present", "number": "4.607", "description": "Studies the interrelationship of theory, history, and practice. Looks at theory not as specialized discourse relating only to architecture, but as touching on many issues, whether they be cultural, aesthetic, philosophical, or professional. Topics and examples are chosen from a wide range of materials, from classical antiquity to today."}, "Seminar in the History of Art and Architecture": {"title": "Seminar in the History of Art and Architecture", "number": "4.609", "description": "Examination of historical method in art and/or architecture, focusing on periods and problems determined by the research interest of the faculty member leading the seminar. Emphasizes critical reading and viewing and direct tutorial guidance. Additional work required of students taking the graduate version. Limited to 15."}, "Islamic Architecture and the Environment": {"title": "Islamic Architecture and the Environment", "number": "4.612", "description": "Studies how Islamic architecture, landscape architecture, and urban planning reflect and transform environmental processes in various regions and climates of the Islamic world, from Andalusia to Southeast Asia, with an emphasis on South Asia, Central Asia, and the Middle East. Using systematic approaches to environmental data collection and analysis, examines strategies behind the design of selected architectural elements and landscape design types, ranging in scale from the fountain to the garden, courtyard, city, and agrarian region. Critically explores cultural interpretations of Islamic environmental design (e.g., paradise gardens), as they developed over time in ways that enrich, modify, or obscure their historical significance."}, "Building Islam": {"title": "Building Islam", "number": "4.614", "description": "Examines the history of Islamic architecture and culture spanning fifteen centuries on three continents - Asia, Africa, Europe. Students study a number of representative examples, from the 7th century House of the Prophet to the current high-rises of Dubai, in conjunction with their urban, social, political, and intellectual environments at the time of their construction."}, "Selected Topics on Culture and Architecture": {"title": "Selected Topics on Culture and Architecture", "number": "4.616", "description": "Seminar on how culture interacts with architecture. Analyzes architecture as a conveyor of messages that transcend stylistic, formal, and iconographic concerns to include an assessment of disciplinary, political, ideological, social, and cultural factors. Critically reviews methodologies and theoretical premises of studies on culture and meaning.  Focuses on examples from Islamic history and establishes historical and theoretical frameworks for investigation."}, "Topics in Islamic Urban History": {"title": "Topics in Islamic Urban History", "number": "4.617", "description": "Seminar on selected topics from the history of Islamic urbanism. Examines patterns of settlement, urbanization, development, and architectural production in various places and periods, ranging from the formative period in the 7th century to the new cities emerging today. Discusses the leading factors in shaping and transforming urban forms, design imperatives, cultural and economic structures, and social and civic attitudes. Critically analyzes the body of literature on Islamic urbanism. Research paper required."}, "Historiography of Islamic Art and Architecture": {"title": "Historiography of Islamic Art and Architecture", "number": "4.619", "description": "Critical review of literature on Islamic art and architecture in the last two centuries. Analyzes the cultural, disciplinary, and theoretical contours of the field and highlights the major figures that have influenced its evolution. Challenges the tacit assumptions and biases of standard studies of Islamic art and architecture and addresses historiographic and critical questions concerning how knowledge of a field is defined, produced, and reproduced."}, "Orientalism, Colonialism, and Representation": {"title": "Orientalism, Colonialism, and Representation", "number": "4.621", "description": "Seminar on the politics of representation with special focus on Orientalist traditions in architecture, art, literature, and scholarship. Critically analyzes pivotal texts, projects, and artworks that reflected the encounters between the West and the Orient from Antiquity to the present. Discusses how political, ideological, and religious attitudes informed the construction and reproduction of Western knowledge about the Islamic world as well as revisionist Eastern self-representations. Research paper required. Limited to 16."}, "Islamic Gardens and Geographies": {"title": "Islamic Gardens and Geographies", "number": "4.623", "description": "Seminar focuses on the historical geography of Islamic gardens, from Andalusia to Southeast Asia, with an emphasis on the Indian subcontinent. Critically engages evidence from archaeological, art historical, and cartographic sources, and explores strategies for generating integrative accounts of historical landscapes. Topics include gardens, cities, cultural landscapes, and political territories, along with their contemporary significance for cultural heritage conservation and design. Additional work required of graduate students. Limited to 15."}, "Water Planning, Policy, and Design": {"title": "Water Planning, Policy, and Design", "number": "4.625[J]", "description": "Focuses on water in environmental planning, policy, and design. Draws together faculty and students who are working on water-related research projects to develop and maintain a current perspective on the field from the site to metropolitan and international scales. Limited to 15."}, "Locating Capitalism: Producing Cities and Objects": {"title": "Locating Capitalism: Producing Cities and Objects", "number": "4.633", "description": "Explores what defines the parameters of a profit economy in historic Europe. Discusses major interpretive frameworks that historically have guided scholarship in architectural, art, and economic history.  Traces the core themes of commodification, production, and consumption - analyzing the relevance of studies on pre- and early modern globalization - to the culture and time under consideration. Can be taken for 9 or 12 units."}, "Early Modern Architecture and Art": {"title": "Early Modern Architecture and Art", "number": "4.634", "description": "Presents a history, from the 14th through the early 17th century, of architectural practice and design, as well as visual culture in Europe with an emphasis on Italy. Topics include the production and reception of buildings and artworks; the significance of a reinvigorated interest in antiquity; and representation of the individual, the state, and other institutions.Examines a variety of interpretive methods. Graduate students are expected to complete additional assignments."}, "Topics in European Medieval Architecture and Art": {"title": "Topics in European Medieval Architecture and Art", "number": "4.636", "description": "Investigates architecture and art in medieval Europe, including significant monuments, art objects, themes, and developments from late antiquity through the rise of European cities in the 13th century. Considers a variety of media, ranging from stone- and metalwork to parchment and glass. Topics include sacred places and spaces; pilgrimage; relics and souvenirs; iconoclasm; questions of materiality, agency, and the power associated with objects; nature and magic; visions; medieval conceptions of temporality; and the construct of feudalism. Students taking graduate version complete additional assignments."}, "Topics in Western Medieval Architecture and Art": {"title": "Topics in Western Medieval Architecture and Art", "number": "4.637", "description": "Investigates architecture and art in medieval Europe, including significant monuments, art objects, themes, and developments from late antiquity through the rise of European cities in the 13th century. Considers a variety of media, ranging from stone- and metalwork to parchment and glass. Topics include sacred places and spaces; pilgrimage; relics and souvenirs; iconoclasm; questions of materiality, agency, and the power associated with objects; nature and magic; visions; medieval conceptions of temporality; and the construct of feudalism. Students taking graduate version complete additional assignments."}, "19th-Century Art": {"title": "19th-Century Art", "number": "4.641", "description": "Investigation of visual culture in the nineteenth century with an emphasis on Western Europe and its global points of contact. Topics include art and industry, artists and urban experience, empire and its image, gender and representation, the dealer/critic system, and the emergence of the avant-garde. Strikes a balance between historical and contemporary critical perspectives to assess art's engagement with the social and political experience of modernity. Additional work required of students taking the graduate version."}, "Selected Topics in Architecture: 1750 to the Present": {"title": "Selected Topics in Architecture: 1750 to the Present", "number": "4.645", "description": "General study of modern architecture as a response to important technological, cultural, environmental, aesthetic, and theoretical challenges after the European Enlightenment. Focus on the theoretical, historiographic, and design approaches to architectural problems encountered in the age of industrial and post-industrial expansion across the globe, with specific attention to the dominance of European modernism in setting the agenda for the discourse of a global modernity at large. Explores modern architectural history through thematic exposition rather than as simple chronological succession of ideas."}, "Technopolitics, Culture, Intervention": {"title": "Technopolitics, Culture, Intervention", "number": "4.647", "description": "Examines the manner in which key theories of technology have influenced architectural and art production in terms of their \"humanizing\" claims. Students test theories of technology on the grounds of whether technology is good or bad for humans. Limited to 15; preference to MArch students."}, "Resonance: Sonic Experience, Science, and Art": {"title": "Resonance: Sonic Experience, Science, and Art", "number": "4.649[J]", "description": "Examines the sonic phenomena and experiences that motivate scientific, humanistic, and artistic practices. Explores the aesthetic and technical aspects of how we hear; measure or describe vibrations; record, compress, and distribute resonating materials; and how we ascertain what we know about the world through sound. Although the focus is on sound as an aesthetic, social, and scientific object, the subject also investigates how resonance is used in the analysis of acoustics, architecture, and music theory. Students make a sonic artifact or research project as a final requirement. Students taking graduate version complete additional assignments."}, "Art Since 1940": {"title": "Art Since 1940", "number": "4.651", "description": "Critical examination of major developments in European, Asian, and American art from 1940 to the present. Surveys the mainstream of art production but also examines marginal phenomena (feminism, identity politics, AIDS activism, net art) that come to change the terms of arts engagements with civic culture. Visits to area art museums and writing assignments develop skills for visual analysis and critical writing."}, "Design: The History of Making Things": {"title": "Design: The History of Making Things", "number": "4.657", "description": "Examines themes in the history of design, with emphasis on Euro-American theory and practice in their global contexts. Addresses the historical design of communications, objects, and environments as meaningful processes of decision-making, adaptation, and innovation. Critically assesses the dynamic interaction of design with politics, economics, technology, and culture in the past and at present. Limited to 36."}, "Nationalism, Internationalism, and Globalism in Modern Art": {"title": "Nationalism, Internationalism, and Globalism in Modern Art", "number": "4.670", "description": "Studies how international modernism interacted with the concept of \"nation\" and how contemporary discourses concerning globalism changes that dynamic. Looks at how art uses and critiques globalization on various levels. Seminar attendance and visits to art museums required. Research paper required of students taking the graduate version."}, "French Photography": {"title": "French Photography", "number": "4.674[J]", "description": "Introduces students to the world of French photography from its invention in the 1820s to the present. Provides exposure to major photographers and images of the French tradition, and encourages students to explore the social and cultural roles and meanings of photographs. Designed to help students navigate their own photo-saturated worlds; provides opportunity to gain practical experience in photography. Taught in English. Enrollment limited."}, "Collect, Classify, Consume": {"title": "Collect, Classify, Consume", "number": "4.675", "description": "Historical study of collecting from the Renaissance to the present. Addresses the practices of collecting and display at the both the individual and institutional level, and analyzes their social, aesthetic, scientific, political and economic dimensions. Specific themes vary from year to year. Offered for 9 or 12 units. May be repeated for credit with permission of instructor."}, "Preparation for HTC Qualifying Paper": {"title": "Preparation for HTC Qualifying Paper", "number": "4.683", "description": "Required of doctoral students in HTC as a prerequisite for work on the doctoral dissertation. The qualifying paper is a scholarly article fit to be published in a peer-reviewed journal that is the result of research in the history, theory and criticism of architecture and art. Topic may not be in the area of the proposed thesis. Work is done in consultation with HTC faculty, in accordance with the HTC PhD Degree Program Guidelines. Restricted to HTC PhD students."}, "Preparation for HTC Major Exam": {"title": "Preparation for HTC Major Exam", "number": "4.684", "description": "Required of doctoral students in HTC as a prerequisite for work on the doctoral dissertation. The Major Exam covers a historically broad area of interest and includes components of history, historiography, and theory. Preparation for the exam will focus on four or five themes agreed upon in advance by the student and the examiner, and are defined by their area of teaching interest. Work is done in consultation with HTC faculty, in accordance with the HTC PhD Degree Program Guidelines. Restricted to HTC PhD students."}, "Preparation for HTC Minor Exam": {"title": "Preparation for HTC Minor Exam", "number": "4.685", "description": "Required of doctoral students in HTC as a prerequisite for work on the doctoral dissertation. The Minor Exam focuses on a specific area of specialization through which the student might develop their particular zone of expertise. Work is done in consultation with HTC faculty, in accordance with the HTC PhD Degree Program Guidelines. Restricted to HTC PhD students."}, "Preparation for History, Theory, and Criticism - Ph.D. Thesis": {"title": "Preparation for History, Theory, and Criticism - Ph.D. Thesis", "number": "4.689", "description": "Required for doctoral students in HTC as a prerequisite for work on the doctoral dissertation. Prior to candidacy, doctoral students are required to write and orally defend a proposal laying out the scope of their thesis, its significance, a survey of existing research and literature, the methods of research to be adopted, a bibliography and plan of work. Work is done in consultation with HTC Faculty, in accordance with the HTC PhD Degree Program guidelines. Restricted to HTC PhD students."}, "Special Subject: History, Theory and Criticism of Architecture and Art": {"title": "Special Subject: History, Theory and Criticism of Architecture and Art", "number": "4.S63", "description": "Seminar or lecture on a topic in the history, theory and criticism of architecture and art that is not covered in the regular curriculum. Requires original research and presentation of oral and written reports and/or design projects, varying at the discretion of the instructor."}, "Special Subject: History, Theory and Criticism of Art": {"title": "Special Subject: History, Theory and Criticism of Art", "number": "4.S66", "description": "Seminar or lecture on a topic in the history, theory and criticism of art that is not covered in the regular curriculum. Requires original research and presentation of oral and written reports and/or design projects, varying at the discretion of the instructor."}, "Special Subject: Study in Modern Art": {"title": "Special Subject: Study in Modern Art", "number": "4.S67", "description": "Seminar or lecture on a topic in the history, theory and criticism of modern art that is not covered in the regular curriculum. Requires original research and presentation of oral and written reports and/or design projects, varying at the discretion of the instructor."}, "Special Subject: Study in Modern Architecture": {"title": "Special Subject: Study in Modern Architecture", "number": "4.S68", "description": "Seminar or lecture on a topic in the history, theory and criticism of modern architecture that is not covered in the regular curriculum. Requires original research and presentation of oral and written reports and/or design projects, varying at the discretion of the instructor."}, "Special Subject: Advanced Study in the History of Urban Form": {"title": "Special Subject: Advanced Study in the History of Urban Form", "number": "4.S69", "description": "Seminar or lecture on a topic in the history, theory and criticism of urban form that is not covered in the regular curriculum. Requires original research and presentation of oral and written reports and/or design projects, varying at the discretion of the instructor."}}