{"Energy Technology and Policy:  From Principles to Practice": {"title": "Energy Technology and Policy:  From Principles to Practice", "number": "5.00[J]", "description": "Develops analytical skills to lead a successful technology implementation with an integrated approach that combines technical, economical and social perspectives. Considers corporate and government viewpoints as well as international aspects, such as nuclear weapons proliferation and global climate issues.  Discusses technologies such as oil and gas, nuclear, solar, and energy efficiency. Limited to 100."}, "Frontiers in Molecular and Materials Science": {"title": "Frontiers in Molecular and Materials Science", "number": "5.001", "description": "Provides an interactive forum for students who want to know more about the cutting edge of chemistry. Explores how chemistry unlocks the secrets of life and the world around us, saves lives, changes the environment, and fits into the tech startup ecosystem. Emphasizes modern illustrations of the power and wonder of chemistry."}, "Principles of Inorganic Chemistry II": {"title": "Principles of Inorganic Chemistry II", "number": "5.04", "description": "Systematic presentation of the chemical applications of group theory. Emphasis on the formal development of the subject and its applications to the physical methods of inorganic chemical compounds. Against the backdrop of electronic structure, the electronic, vibrational, and magnetic properties of transition metal complexes are presented and their investigation by the appropriate spectroscopy described."}, "Principles of Bioinorganic Chemistry": {"title": "Principles of Bioinorganic Chemistry", "number": "5.062", "description": "Delineates principles that form the basis for understanding how metal ions function in biology. Examples chosen from recent literature on a range of topics, including the global biogeochemical cycles of the elements; choice, uptake and assembly of metal-containing units; structure, function and biosynthesis of complex metallocofactors; electron-transfer and redox chemistry; atom and group transfer chemistry; protein tuning of metal properties; metalloprotein engineering and design; and applications to diagnosis and treatment of disease."}, "Physical Inorganic Chemistry": {"title": "Physical Inorganic Chemistry", "number": "5.068", "description": "Discusses the physical methods used to probe the electronic and geometric structures of inorganic compounds, with additional techniques employed in the characterization of inorganic solids and surfaces. Includes vibrational spectroscopy, solid state and solution magnetochemical methods, Mössbauer spectroscopy, electron paramagnetic resonance spectroscopy, electrochemical methods, and a brief survey of surface techniques. Applications to current research problems in inorganic and solid-state chemistry."}, "Crystal Structure Analysis": {"title": "Crystal Structure Analysis", "number": "5.069", "description": "Introduction to X-ray crystallography: symmetry in real and reciprocal space, space and Laue groups, geometry of diffraction, structure factors, phase problem, direct and Patterson methods, electron density maps, structure refinement, crystal growth, powder methods, limits of diffraction methods, structure data bases."}, "Biological Chemistry I": {"title": "Biological Chemistry I", "number": "5.07[J]", "description": "Chemical and physical properties of the cell and its building blocks. Structures of proteins and principles of catalysis. The chemistry of organic/inorganic cofactors required for chemical transformations within the cell. Basic principles of metabolism and regulation in pathways, including glycolysis, gluconeogenesis, fatty acid synthesis/degradation, pentose phosphate pathway, Krebs cycle and oxidative phosphorylation, DNA replication, and transcription and translation."}, "Biological Chemistry II": {"title": "Biological Chemistry II", "number": "5.08[J]", "description": "More advanced treatment of biochemical mechanisms that underlie biological processes. Topics include macromolecular machines such as the ribosome, the proteosome, fatty acid synthases as a paradigm for polyketide synthases and non-ribosomal polypeptide synthases, and polymerases. Emphasis is on experimental methods used to unravel these processes and how these processes fit into the cellular context and coordinate regulation."}, "Principles of Chemical Science": {"title": "Principles of Chemical Science", "number": "5.112", "description": "Introduction to chemistry for students with an unusually strong background in chemistry. Knowledge of calculus equivalent to 18.01 is recommended. Emphasis on basic principles of atomic and molecular electronic structure, thermodynamics, acid-base and redox equilibria, chemical kinetics, and catalysis. Applications of basic principles to problems in metal coordination chemistry, organic chemistry, and biological chemistry."}, "Archaeological Science": {"title": "Archaeological Science", "number": "5.24[J]", "description": "Pressing issues in archaeology as an anthropological science. Stresses the natural science and engineering methods archaeologists use to address these issues. Reconstructing time, space, and human ecologies provides one focus; materials technologies that transform natural materials to material culture provide another. Topics include 14C dating, ice core and palynological analysis, GIS and other remote sensing techniques for site location, organic residue analysis, comparisons between Old World and New World bronze production, invention of rubber by Mesoamerican societies, analysis and conservation of Dead Sea Scrolls."}, "Introduction to Experimental Chemistry": {"title": "Introduction to Experimental Chemistry", "number": "5.302", "description": "Illustrates fundamental principles of chemical science through practical experience with chemical phenomena. Students explore the theoretical concepts of chemistry through the experiments which informed their discovery, and make chemistry happen with activities that are intellectually stimulating and fun. Preference to first-year students."}, "Laboratory Chemistry": {"title": "Laboratory Chemistry", "number": "5.310", "description": "Introduces experimental chemistry for students who are not majoring in Course 5. Principles and applications of chemical laboratory techniques, including preparation and analysis of chemical materials, measurement of pH, gas and liquid chromatography, visible-ultraviolet spectrophotometry, infrared spectroscopy, kinetics, data analysis, and elementary synthesis. Enrollment limited."}, "Fundamentals of Spectroscopy": {"title": "Fundamentals of Spectroscopy", "number": "5.351", "description": "Students carry out an experiment that introduces fundamental principles of the most common types of spectroscopy, including UV-visible absorption and fluorescence, infrared, and nuclear magnetic resonance. Emphasizes principles of how light interacts with matter, a fundamental and hands-on understanding of how spectrometers work, and what can be learned through spectroscopy about prototype molecules and materials. Students record and analyze spectra of small organic molecules, native and denatured proteins, semiconductor quantum dots, and laser crystals. Satisfies 4 units of Institute Laboratory credit."}, "Synthesis of Coordination Compounds and Kinetics": {"title": "Synthesis of Coordination Compounds and Kinetics", "number": "5.352", "description": "Students carry out an experiment that provides an introduction to the synthesis of simple coordination compounds and chemical kinetics. Illustrates cobalt coordination chemistry and its transformations as detected by visible spectroscopy. Students observe isosbestic points in visible spectra, determine the rate and rate law, measure the rate constant at several temperatures, and derive the activation energy for the aquation reaction. Satisfies 5 units of Institute Laboratory credit."}, "Macromolecular Prodrugs": {"title": "Macromolecular Prodrugs", "number": "5.353", "description": "Students carry out an experiment that builds skills in how to rationally design macromolecules for drug delivery based on fundamental principles of physical organic chemistry. Begins with conjugation of a drug molecule to a polymerizable group through a cleavable linker to generate a prodrug monomer. Continues with polymerization of monomer to produce macromolecular (i.e., polymer) prodrug; monomer and polymer prodrugs are fully characterized. Rate of drug release is measured and correlated to the size of the macromolecule as well as the structure of the cleavable linker. Satisfies 4 units of Institute Laboratory credit."}, "Expression and Purification of Enzyme Mutants": {"title": "Expression and Purification of Enzyme Mutants", "number": "5.361", "description": "Students use biochemical techniques for protein expression and DNA manipulation of Bcr-Abl kinase, which is inhibited by the blockbuster drug Gleevec in the treatment of chronic myelogenous leukemia. Uses various standard bioanalytical and biochemical methods in lab to characterize and produce this protein."}, "Kinetics of Enzyme Inhibition": {"title": "Kinetics of Enzyme Inhibition", "number": "5.362", "description": "Students study the activity and structure of the domains developed in 5.361 to understand the role of mutations in the development of resistance to Gleevec. Students assay both mutant and wild-type Abl kinase domains for phosphorylation activity to determine enzyme kinetics and the inhibition efficacy of Gleevec. They conduct additional testing on kinase activity of Gleevec-resistant mutants in the presence of other potential inhibitors. Uses structure-viewing programs to enable analysis of the mechanistic basis of Bcr-Abl inhibition and Gleevec-resistance."}, "Organic Structure Determination": {"title": "Organic Structure Determination", "number": "5.363", "description": "Introduces modern methods for the elucidation of the structure of organic compounds. Students carry out transition metal-catalyzed coupling reactions, based on chemistry developed in the Buchwald laboratory, using reactants of unknown structure. Students also perform full spectroscopic characterization - by proton and carbon NMR, IR, and mass spectrometry of the reactants - and carry out coupling products in order to identify the structures of each compound. Other techniques include transfer and manipulation of organic and organometallic reagents and compounds, separation by extraction, and purification by column chromatography. Satisfies 4 units of Institute Laboratory credit."}, "Continuous Flow Chemistry:  Sustainable Conversion of Reclaimed Vegetable Oil into Biodiesel": {"title": "Continuous Flow Chemistry:  Sustainable Conversion of Reclaimed Vegetable Oil into Biodiesel", "number": "5.371", "description": "Presents the theoretical and practical fundamentals of continuous flow synthesis, wherein pumps, tubes, and connectors are used to conduct chemical reactions instead of flasks, beakers, etc. Focuses on a catalytic reaction that converts natural vegetable oil into biodiesel that can be used in a variety of combustion engines. Provides instruction in several important organic chemistry experimental techniques, including purification by extraction, rotary evaporation, acid-base titration, gas chromatography (GC), and"}, "Chemistry of Renewable Energy": {"title": "Chemistry of Renewable Energy", "number": "5.372", "description": "Introduces the electrochemical processes that underlie renewable energy storage and recovery. Students investigate charge transfer reactions at electrode surfaces that are critical to the operation of advanced batteries, fuel cells, and electrolyzers. Develops basic theory behind inner- and outer-sphere charge transfer reactions at interfaces and applies this theory to construct mechanistic models for important energy conversion reactions including the reduction of O"}, "Dinitrogen Cleavage": {"title": "Dinitrogen Cleavage", "number": "5.373", "description": "Introduces the research area of small-molecule activation by transition-element complexes. Covers techniques such as glove-box methods for synthesis for exclusion of oxygen and water; filtration, reaction mixture concentration, and recrystallization under a dinitrogen atmosphere and under static vacuum. Characterization methods include proton NMR spectroscopy of both paramagnetic and diamagnetic systems, Evans method magnetic susceptibility measurement, UV-Vis spectroscopy, and infrared spectroscopy of a metal-nitrogen triple bond system."}, "Quantum Dots": {"title": "Quantum Dots", "number": "5.381", "description": "Covers synthesis of a discrete size series of quantum dots, followed by synthesis of a single size of core/shell quantum dots utilizing air-free Schlenk manipulation of precursors. Uses characterization by absorption and fluorescence spectroscopies to rationalize the compositional/size dependence of the shell on the electronic structure of the quantum dots. Students acquire time traces of the fluorescence of single core and core/shell quantum dots using single molecule spectroscopic tools. The fluorescence on/off blinking distribution observed will be fit to a standard model. Students use Matlab for computational modeling of the electron and hole wavefunction in core and core/shell quantum dots. Analyzes several commercial applications of quantum dot technologies."}, "Fast-flow Peptide and Protein Synthesis": {"title": "Fast-flow Peptide and Protein Synthesis", "number": "5.383", "description": "Develops understanding of both the theory and practice of fundamental techniques in biological chemistry, including chemical reactivity (amide-bond formation, solid phase synthesis, disulfide bond formation, and protecting group chemistry); separation science for purification and analysis, such as preparative HPLC and MALDI-TOF MS; and protein structure-function relationships (protein folding and binding). Periodically, guest lecturers from the local biotech research community will describe practical applications in industry."}, "Research and Communication in Chemistry": {"title": "Research and Communication in Chemistry", "number": "5.39", "description": "Independent research under the direction of a member of the Chemistry Department faculty. Allows students with a strong interest in independent research to fulfill  part of the laboratory requirement for the Chemistry Department Program in the context of a research laboratory at MIT. The research must be conducted on the MIT campus and be a continuation of a previous 12-unit UROP project or full-time work over the summer. Instruction and practice in written and oral communication is provided, culminating in a poster presentation of the work at the annual departmental UROP symposium and a research publication-style writeup of the results.  Permission of the faculty research supervisor and the Chemistry Education Office must be obtained in advance."}, "Frontiers in Chemical Biology": {"title": "Frontiers in Chemical Biology", "number": "5.54[J]", "description": "Introduction to current research at the interface of chemistry, biology, and bioengineering. Topics include imaging of biological processes, metabolic pathway engineering, protein engineering, mechanisms of DNA damage, RNA structure and function, macromolecular machines, protein misfolding and disease, metabolomics, and methods for analyzing signaling network dynamics. Lectures are interspersed with class discussions and student presentations based on current literature."}, "Thermodynamics and Kinetics": {"title": "Thermodynamics and Kinetics", "number": "5.60", "description": "Equilibrium properties of macroscopic systems. Basic thermodynamics: state of a system, state variables. Work, heat, first law of thermodynamics, thermochemistry. Second and third law of thermodynamics: entropy and free energy, including the molecular basis for these thermodynamic functions. Phase equilibrium and properties of solutions. Chemical equilibrium of reactions in gas and solution phases. Rates of chemical reactions. Special attention to thermodynamics related to global energy issues. Meets with 5.601 first half of term and 5.602 second half of term.  Credit cannot also be received for 5.601 or 5.602."}, "Thermodynamics I": {"title": "Thermodynamics I", "number": "5.601", "description": "Basic thermodynamics: state of a system, state variables. Work, heat, first law of thermodynamics, thermochemistry. Second and third law of thermodynamics: entropy and free energy, including the molecular basis for these thermodynamic functions. Equilibrium properties of macroscopic systems. Special attention to thermodynamics related to global energy issues and biological systems. Credit cannot also be received for 5.60. Combination of 5.601 and 5.602 counts as a REST subject."}, "Thermodynamics II and Kinetics": {"title": "Thermodynamics II and Kinetics", "number": "5.602", "description": "Free energy and chemical potential. Phase equilibrium and properties of solutions. Chemical equilibrium of reactions. Rates of chemical reactions. Special attention to thermodynamics related to global energy issues and biological systems. Credit cannot also be received for 5.60. Combination of 5.601 and 5.602 counts as a REST subject."}, "Physical Chemistry": {"title": "Physical Chemistry", "number": "5.61", "description": "Introductory quantum chemistry; particles and waves; wave mechanics; atomic structure and the Periodic Table; valence and molecular orbital theory; molecular structure; and photochemistry.  Meets with 5.611 first half of term and 5.612 second half of term.  Credit cannot also be received for 5.611 or 5.612."}, "Frontiers of Interdisciplinary Science in Human Health and Disease": {"title": "Frontiers of Interdisciplinary Science in Human Health and Disease", "number": "5.64[J]", "description": "Introduces major principles, concepts, and clinical applications of biophysics, biophysical chemistry, and systems biology. Emphasizes biological macromolecular interactions, biochemical reaction dynamics, and genomics. Discusses current technological frontiers and areas of active research at the interface of basic and clinical science. Provides integrated, interdisciplinary training and core experimental and computational methods in molecular biochemistry and genomics."}, "Kinetics of Chemical Reactions": {"title": "Kinetics of Chemical Reactions", "number": "5.68[J]", "description": "Experimental and theoretical aspects of chemical reaction kinetics, including transition-state theories, molecular beam scattering, classical techniques, quantum and statistical mechanical estimation of rate constants, pressure-dependence and chemical activation, modeling complex reacting mixtures, and uncertainty/ sensitivity analyses. Reactions in the gas phase, liquid phase, and on surfaces are discussed with examples drawn from atmospheric, combustion, industrial, catalytic, and biological chemistry."}, "Computational Chemistry": {"title": "Computational Chemistry", "number": "5.697[J]", "description": "Addresses both the theory and application of first-principles computer simulations methods (i.e., quantum, chemical, or electronic structure), including Hartree-Fock theory, density functional theory, and correlated wavefunction methods. Covers enhanced sampling, ab initio molecular dynamics, and transition-path-finding approaches as well as errors and accuracy in total and free energies. Discusses applications such as the study and prediction of properties of chemical systems, including heterogeneous, molecular, and biological catalysts (enzymes), and physical properties of materials. Students taking graduate version complete additional assignments."}, "Quantum Chemical Simulation": {"title": "Quantum Chemical Simulation", "number": "5.698[J]", "description": "Addresses both the theory and application of first-principles computer simulations methods (i.e., quantum, chemical, or electronic structure), including Hartree-Fock theory, density functional theory, and correlated wavefunction methods. Covers enhanced sampling, ab initio molecular dynamics, and transition-path-finding approaches as well as errors and accuracy in total and free energies. Discusses applications such as the study and prediction of properties of chemical systems, including heterogeneous, molecular, and biological catalysts (enzymes), and physical properties of materials. Students taking graduate version complete additional assignments."}, "Statistical Thermodynamics": {"title": "Statistical Thermodynamics", "number": "5.70[J]", "description": "Develops classical equilibrium statistical mechanical concepts for application to chemical physics problems. Basic concepts of ensemble theory formulated on the basis of thermodynamic fluctuations. Examples of applications include Ising models, lattice models of binding, ionic and non-ionic solutions, liquid theory, polymer and protein conformations, phase transition, and pattern formation. Introduces computational techniques with examples of liquid and polymer simulations."}, "Introductory Quantum Mechanics I": {"title": "Introductory Quantum Mechanics I", "number": "5.73", "description": "Presents the fundamental concepts of quantum mechanics: wave properties, uncertainty principles, Schrodinger equation, and operator and matrix methods. Includes applications to one-dimensional potentials (harmonic oscillator), three-dimensional centrosymetric potentials (hydrogen atom), and angular momentum and spin. Approximation methods include WKB, variational principle, and perturbation theory."}, "Biophysical Chemistry Techniques": {"title": "Biophysical Chemistry Techniques", "number": "5.78", "description": "Presents principles of macromolecular crystallography that are essential for structure determinations. Topics include crystallization, diffraction theory, symmetry and space groups, data collection, phase determination methods, model building, and refinement. Discussion of crystallography theory complemented with exercises such as crystallization, data processing, and model building. Meets with 7.71 when offered concurrently. Enrollment limited."}, "Advanced NMR Spectroscopy": {"title": "Advanced NMR Spectroscopy", "number": "5.83", "description": "Offers a classical and quantum mechanical description of nuclear magnetic resonance (NMR) spectroscopy. The former includes key concepts such as nuclear spin magnetic moment, Larmor precession, Bloch equations, the rotating frame, radio-frequency pulses, vector model of pulsed NMR, Fourier transformation in 1D and nD NMR, orientation dependence of nuclear spin frequencies, and NMR relaxation. The latter covers nuclear spin Hamiltonians, density operator and its time evolution, the interaction representation, Average Hamiltonian Theory for multi-pulse experiments, and analysis of some common pulse sequences in solution and solid-state NMR."}, "Teaching College-Level Science and Engineering": {"title": "Teaching College-Level Science and Engineering", "number": "5.95[J]", "description": "Participatory seminar focuses on the knowledge and skills necessary for teaching science and engineering in higher education. Topics include theories of adult learning; course development; promoting active learning, problemsolving, and critical thinking in students; communicating with a diverse student body; using educational technology to further learning; lecturing; creating effective tests and assignments; and assessment and evaluation. Students research and present a relevant topic of particular interest. Appropriate for both novices and those with teaching experience."}}