{"Introduction to Computer Science and Programming": {"title": "Introduction to Computer Science and Programming", "number": "6.00", "description": "Introduction to computer science and programming for students with little or no programming experience. Students learn how to program and how to use computational techniques to solve problems. Topics include software design, algorithms, data analysis, and simulation techniques. Assignments are done using the Python programming language. Meets with 6.0001 first half of term and 6.0002 second half of term. Credit cannot also be received for 6.0001 or 6.0002."}, "Introduction to Computer Science Programming in Python": {"title": "Introduction to Computer Science Programming in Python", "number": "6.0001", "description": "Introduction to computer science and programming for students with little or no programming experience. Students develop skills to program and use computational techniques to solve problems. Topics include the notion of computation, Python, simple algorithms and data structures, testing and debugging, and algorithmic complexity. Meets with 6.00 first half of term. Credit cannot also be received for 6.00. Combination of 6.0001 and 6.0002 counts as REST subject. Final given in the seventh week of the term."}, "Introduction to Computational Thinking and Data Science": {"title": "Introduction to Computational Thinking and Data Science", "number": "6.0002", "description": "Provides an introduction to using computation to understand real-world phenomena. Topics include plotting, stochastic programs, probability and statistics, random walks, Monte Carlo simulations, modeling data, optimization problems, and clustering. Meets with 6.00 second half of term. Credit cannot also be received for 6.00. Combination of 6.0001 and 6.0002 counts as REST subject."}, "Circuits and Electronics": {"title": "Circuits and Electronics", "number": "6.002", "description": "Fundamentals of the lumped circuit abstraction. Resistive elements and networks, independent and dependent sources, switches and MOS devices, digital abstraction, amplifiers, and energy storage elements. Dynamics of first- and second-order networks; design in the time and frequency domains; analog and digital circuits and applications. Design exercises. Occasional laboratory."}, "Signals and Systems": {"title": "Signals and Systems", "number": "6.003", "description": "Presents the fundamentals of signal and system analysis. Topics include discrete-time and continuous-time signals, Fourier series and transforms, Laplace and Z transforms, and analysis of linear, time-invariant systems. Applications drawn broadly from engineering and physics, including audio and image processing, communications, and automatic control."}, "Computation Structures": {"title": "Computation Structures", "number": "6.004", "description": "Introduces architecture of digital systems, emphasizing structural principles common to a wide range of technologies. Multilevel implementation strategies; definition of new primitives (e.g., gates, instructions, procedures, and processes) and their mechanization using lower-level elements. Analysis of potential concurrency; precedence constraints and performance measures; pipelined and multidimensional systems. Instruction set design issues; architectural support for contemporary software structures."}, "Introduction to Inference": {"title": "Introduction to Inference", "number": "6.008", "description": "Introduces probabilistic modeling for problems of inference and machine learning from data, emphasizing analytical and computational aspects. Distributions, marginalization, conditioning, and structure; graphical representations. Belief propagation, decision-making, classification, estimation, and prediction. Sampling methods and analysis. Introduces asymptotic analysis and information measures. Computational laboratory component explores the concepts introduced in class in the context contemporary applications. Students design inference algorithms, investigate their behavior on real data, and discuss experimental results."}, "Fundamentals of Programming": {"title": "Fundamentals of Programming", "number": "6.009", "description": "Introduces fundamental concepts of programming. Designed to develop skills in applying basic methods from programming languages to abstract problems. Topics include programming and Python basics, computational concepts, software engineering, algorithmic techniques, data types, and recursion.  Lab component consists of software design, construction, and implementation of design. Enrollment may be limited."}, "Introduction to EECS via Robotics": {"title": "Introduction to EECS via Robotics", "number": "6.01", "description": "An integrated introduction to electrical engineering and computer science, taught using substantial laboratory experiments with mobile robots. Key issues in the design of engineered artifacts operating in the natural world: measuring and modeling system behaviors; assessing errors in sensors and effectors; specifying tasks; designing solutions based on analytical and computational models; planning, executing, and evaluating experimental tests of performance; refining models and designs. Issues addressed in the context of computer programs, control systems, probabilistic inference problems, circuits and transducers, which all play important roles in achieving robust operation of a large variety of engineered systems."}, "Signals, Systems and Inference": {"title": "Signals, Systems and Inference", "number": "6.011", "description": "Covers signals, systems and inference in communication, control and signal processing. Topics include input-output and state-space models of linear systems driven by deterministic and random signals; time- and transform-domain representations in discrete and continuous time; and group delay. State feedback and observers. Probabilistic models; stochastic processes, correlation functions, power spectra, spectral factorization. Least-mean square error estimation; Wiener filtering. Hypothesis testing; detection; matched filters."}, "Nanoelectronics and Computing Systems": {"title": "Nanoelectronics and Computing Systems", "number": "6.012", "description": "Studies interaction between materials, semiconductor physics, electronic devices, and computing systems. Develops intuition of how transistors operate. Topics range from introductory semiconductor physics to modern state-of-the-art nano-scale devices. Considers how innovations in devices have driven historical progress in computing, and explores ideas for further improvements in devices and computing. Students apply material to understand how building improved computing systems requires knowledge of devices, and how making the correct device requires knowledge of computing systems. Includes a design project for practical application of concepts, and labs for experience building silicon transistors and devices."}, "Electromagnetics and Applications": {"title": "Electromagnetics and Applications", "number": "6.013", "description": "Analysis and design of modern applications that employ electromagnetic phenomena for signals and power transmission in RF, microwaves, optical and wireless communication systems. Fundamentals include dynamic solutions for Maxwell's equations; electromagnetic power and energy, waves in media, metallic and dielectric waveguides, radiation, and diffraction; resonance; filters; and acoustic analogs. Labs activities range from building to testing of devices and systems (e.g., antenna arrays, radars, dielectric waveguides). Students work in teams on self-proposed maker-style design projects with a focus on fostering creativity, teamwork, and debugging skills. 6.002 and 6.003 are recommended but not required."}, "Electromagnetic Fields, Forces and Motion": {"title": "Electromagnetic Fields, Forces and Motion", "number": "6.640", "description": "Study of electromagnetics and electromagnetic energy conversion leading to an understanding of devices, including electromagnetic sensors, actuators, motors and generators. Quasistatic Maxwell's equations and the Lorentz force law. Studies of the quasistatic fields and their sources through solutions of Poisson's and Laplace's equations. Boundary conditions and multi-region boundary-value problems. Steady-state conduction, polarization, and magnetization. Charge conservation and relaxation, and magnetic induction and diffusion. Extension to moving materials. Electric and magnetic forces and force densities derived from energy, and stress tensors. Extensive use of engineering examples. Students taking graduate version complete additional assignments."}, "Introduction to EECS via Communication Networks": {"title": "Introduction to EECS via Communication Networks", "number": "6.02", "description": "Studies key concepts, systems, and algorithms to reliably communicate data in settings ranging from the cellular phone network and the Internet to deep space. Weekly laboratory experiments explore these areas in depth. Topics presented in three modules - bits, signals, and packets - spanning the multiple layers of a communication system. Bits module includes information, entropy, data compression algorithms, and error correction with block and convolutional codes. Signals module includes modeling physical channels and noise, signal design, filtering and detection, modulation, and frequency-division multiplexing. Packets module includes switching and queuing principles, media access control, routing protocols, and data transport protocols."}, "Cellular Neurophysiology and Computing": {"title": "Cellular Neurophysiology and Computing", "number": "6.521[J]", "description": "Integrated overview of the biophysics of cells from prokaryotes to neurons, with a focus on mass transport and electrical signal generation across cell membrane. First third of course focuses on mass transport through membranes: diffusion, osmosis, chemically mediated, and active transport. Second third focuses on electrical properties of cells: ion transport to action potential generation and propagation in electrically excitable cells. Synaptic transmission. Electrical properties interpreted via kinetic and molecular properties of single voltage-gated ion channels. Final third focuses on biophysics of synaptic transmission and introduction to neural computing. Laboratory and computer exercises illustrate the concepts. Students taking graduate version complete different assignments."}, "Quantitative Systems Physiology": {"title": "Quantitative Systems Physiology", "number": "6.022[J]", "description": "Application of the principles of energy and mass flow to major human organ systems. Anatomical, physiological and clinical features of the cardiovascular, respiratory and renal systems. Mechanisms of regulation and homeostasis. Systems, features and devices that are most illuminated by the methods of physical sciences and engineering models. Required laboratory work includes animal studies. Students taking graduate version complete additional assignments."}, "Fields, Forces and Flows in Biological Systems": {"title": "Fields, Forces and Flows in Biological Systems", "number": "6.023[J]", "description": "Introduction to electric fields, fluid flows, transport phenomena and their application to biological systems. Flux and continuity laws, Maxwell's equations, electro-quasistatics, electro-chemical-mechanical driving forces, conservation of mass and momentum, Navier-Stokes flows, and electrokinetics. Applications include biomolecular transport in tissues, electrophoresis, and microfluidics."}, "Molecular, Cellular, and Tissue Biomechanics": {"title": "Molecular, Cellular, and Tissue Biomechanics", "number": "6.524[J]", "description": "Develops and applies scaling laws and the methods of continuum mechanics to biomechanical phenomena over a range of length scales. Topics include structure of tissues and the molecular basis for macroscopic properties; chemical and electrical effects on mechanical behavior; cell mechanics, motility and adhesion; biomembranes; biomolecular mechanics and molecular motors. Experimental methods for probing structures at the tissue, cellular, and molecular levels."}, "Medical Device Design": {"title": "Medical Device Design", "number": "6.525[J]", "description": "Provides an intense project-based learning experience around the design of medical devices with foci ranging from mechanical to electro mechanical to electronics.  Projects motivated by real-world clinical challenges provided by sponsors and clinicians who also help mentor teams. Covers the design process, project management, and fundamentals of mechanical and electrical circuit and sensor design. Students work in small teams to execute a substantial term project, with emphasis placed upon developing creative designs - via a deterministic design process - that are developed and optimized using analytical techniques. Instruction and practice in written and oral communication provided. Students taking graduate version complete additional assignments. Enrollment limited."}, "Biomedical Signal and Image Processing": {"title": "Biomedical Signal and Image Processing", "number": "6.555[J]", "description": "Fundamentals of digital signal processing with emphasis on problems in biomedical research and clinical medicine. Basic principles and algorithms for processing both deterministic and random signals. Topics include data acquisition, imaging, filtering, coding, feature extraction, and modeling. Lab projects, performed in MATLAB, provide practical experience in processing physiological data, with examples from cardiology, speech processing, and medical imaging. Lectures cover signal processing topics relevant to the lab exercises, as well as background on the biological signals processed in the labs. Students taking graduate version complete additional assignments."}, "Biomolecular Feedback Systems": {"title": "Biomolecular Feedback Systems", "number": "6.557[J]", "description": "Comprehensive introduction to dynamics and control of biomolecular systems with emphasis on design/analysis techniques from control theory. Provides a review of biology concepts, regulation mechanisms, and models. Covers basic enabling technologies, engineering principles for designing biological functions, modular design techniques, and design limitations. Students taking graduate version complete additional assignments."}, "Introduction to EECS via Medical Technology": {"title": "Introduction to EECS via Medical Technology", "number": "6.03", "description": "Explores biomedical signals generated from electrocardiograms, glucose detectors or ultrasound images, and magnetic resonance images. Topics include physical characterization and modeling of systems in the time and frequency domains; analog and digital signals and noise; basic machine learning including decision trees, clustering, and classification; and introductory machine vision. Labs designed to strengthen background in signal processing and machine learning. Students design and run structured experiments, and develop and test procedures through further experimentation."}, "Elements of Software Construction": {"title": "Elements of Software Construction", "number": "6.031", "description": "Introduces fundamental principles and techniques of software development: how to write software that is safe from bugs, easy to understand, and ready for change. Topics include specifications and invariants; testing, test-case generation, and coverage; abstract data types and representation independence; design patterns for object-oriented programming; concurrent programming, including message passing and shared memory concurrency, and defending against races and deadlock; and functional programming with immutable data and higher-order functions. Includes weekly programming exercises and larger group programming projects."}, "Computer Systems Engineering": {"title": "Computer Systems Engineering", "number": "6.033", "description": "Topics on the engineering of computer software and hardware systems: techniques for controlling complexity; strong modularity using client-server design, operating systems; performance, networks; naming; security and privacy; fault-tolerant systems, atomicity and coordination of concurrent activities, and recovery; impact of computer systems on society. Case studies of working systems and readings from the current literature provide comparisons and contrasts. Includes a single, semester-long design project. Students engage in extensive written communication exercises. Enrollment may be limited."}, "Artificial Intelligence": {"title": "Artificial Intelligence", "number": "6.034", "description": "Introduces representations, methods, and architectures used to build applications and to account for human intelligence from a computational point of view. Covers applications of rule chaining, constraint propagation, constrained search, inheritance, statistical inference, and other problem-solving paradigms. Also addresses applications of identification trees, neural nets, genetic algorithms, support-vector machines, boosting, and other learning paradigms. Considers what separates human intelligence from that of other animals."}, "Introduction to Machine Learning": {"title": "Introduction to Machine Learning", "number": "6.036", "description": "Introduces principles, algorithms, and applications of machine learning from the point of view of modeling and prediction; formulation of learning problems; representation, over-fitting, generalization; clustering, classification, probabilistic modeling; and methods such as support vector machines, hidden Markov models, and neural networks. Students taking graduate version complete additional assignments. Meets with 6.862 when offered concurrently. Recommended prerequisites: 6.006 and 18.06. Enrollment may be limited; no listeners."}, "Introduction to Probability I": {"title": "Introduction to Probability I", "number": "6.041A", "description": "Provides an introduction to probability theory and the modeling and analysis of probabilistic systems. Probabilistic models, conditional probability. Discrete and continuous random variables. Expectation and conditional expectation. Limit Theorems. Students taking graduate version complete additional assignments. Combination of 6.041A and 6.041B counts as a REST subject."}, "Introduction to Probability II": {"title": "Introduction to Probability II", "number": "6.041B", "description": "Continuation of 6.041A. Further topics about random variables. Bayesian estimation and hypothesis testing. Elements of statistical inference. Bernoulli and Poisson processes. Markov chains. Students taking graduate version complete additional assignments.  Combination of 6.041A and 6.041B counts as a REST subject."}, "Mathematics for Computer Science": {"title": "Mathematics for Computer Science", "number": "6.042[J]", "description": "Elementary discrete mathematics for computer science and engineering. Emphasis on mathematical definitions and proofs as well as on applicable methods. Topics include formal logic notation, proof methods; induction, well-ordering; sets, relations; elementary graph theory; asymptotic notation and growth of functions; permutations and combinations, counting principles; discrete probability. Further selected topics include recursive definition and structural induction, state machines and invariants, integer congruences, recurrences, generating functions."}, "Automata, Computability, and Complexity": {"title": "Automata, Computability, and Complexity", "number": "6.045[J]", "description": "Mathematical introduction to questions concerning the definition of computation, and what problems can be solved by computers. Considers what problems can be efficiently solved by way of finite automata, circuits, Turing machines, and communication complexity. Provides complete, rigorous answers to the questions in some cases; others are major open problems. Builds skills in classifying computational problems in terms of their difficulty. Discusses other fundamental issues, including the Church-Turing Thesis, the P versus NP problem, and the power of randomness."}, "Design and Analysis of Algorithms": {"title": "Design and Analysis of Algorithms", "number": "6.046[J]", "description": "Techniques for the design and analysis of efficient algorithms, emphasizing methods useful in practice. Topics include sorting; search trees, heaps, and hashing; divide-and-conquer; dynamic programming; greedy algorithms; amortized analysis; graph algorithms; and shortest paths. Advanced topics may include network flow; computational geometry; number-theoretic algorithms; polynomial and matrix calculations; caching; and parallel computing."}, "Computational Biology: Genomes, Networks, Evolution": {"title": "Computational Biology: Genomes, Networks, Evolution", "number": "6.047", "description": "Covers the algorithmic and machine learning foundations of computational biology, combining theory with practice. Principles of algorithm design, influential problems and techniques, and analysis of large-scale biological datasets. Topics include (a) genomes: sequence analysis, gene finding, RNA folding, genome alignment and assembly, database search; (b) networks: gene expression analysis, regulatory motifs, biological network analysis; (c) evolution: comparative genomics, phylogenetics, genome duplication, genome rearrangements, evolutionary theory.  These are coupled with fundamental algorithmic techniques including: dynamic programming, hashing, Gibbs sampling, expectation maximization, hidden Markov models, stochastic context-free grammars, graph clustering, dimensionality reduction, Bayesian networks."}, "Evolutionary Biology:  Concepts, Models and Computation": {"title": "Evolutionary Biology:  Concepts, Models and Computation", "number": "6.049[J]", "description": "Explores and illustrates how evolution explains biology, with an emphasis on computational model building for analyzing evolutionary data.  Covers key concepts of biological evolution, including adaptive evolution, neutral evolution, evolution of sex, genomic conflict, speciation, phylogeny and comparative methods, life's history, coevolution, human evolution, and evolution of disease."}, "Information, Entropy, and Computation": {"title": "Information, Entropy, and Computation", "number": "6.050[J]", "description": "Explores the ultimate limits to communication and computation, with an emphasis on the physical nature of information and information processing. Topics include information and computation, digital signals, codes, and compression. Biological representations of information. Logic circuits, computer architectures, and algorithmic information. Noise, probability, and error correction. The concept of entropy applied to channel capacity and to the second law of thermodynamics. Reversible and irreversible operations and the physics of computation. Quantum computation."}, "Introduction to Electric Power Systems": {"title": "Introduction to Electric Power Systems", "number": "6.690", "description": "Electric circuit theory with application to power handling electric circuits. Modeling and behavior of electromechanical devices, including magnetic circuits, motors, and generators. Operational fundamentals of synchronous. Interconnection of generators and motors with electric power transmission and distribution circuits. Power generation, including alternative and sustainable sources. Incorporation of energy storage in power systems. Students taking graduate version complete additional assignments."}, "Electronics Project Laboratory": {"title": "Electronics Project Laboratory", "number": "6.070[J]", "description": "Intuition-based introduction to electronics, electronic components and test equipment such as oscilloscopes, meters (voltage, resistance inductance, capacitance, etc.), and signal generators. Emphasizes individual instruction and development of skills, such as soldering, assembly, and troubleshooting. Students design, build, and keep a small electronics project to put their new knowledge into practice. Intended for students with little or no previous background in electronics. Enrollment may be limited."}, "Introduction to Digital Electronics": {"title": "Introduction to Digital Electronics", "number": "6.072[J]", "description": "Design your own circuits for times when off-the-shelf solutions are not available. Seminar begins with assembly of a utility board. Weekly labs cover digital logic gates, memory elements, and finite-state machine design. Seminar concludes with a team-based design project. Preference given to freshmen. Maximum of 10 students per term, lottery at the first class session if oversubscribed."}, "Creating Video Games": {"title": "Creating Video Games", "number": "6.073[J]", "description": "Introduces students to the complexities of working in small, multidisciplinary teams to develop video games. Covers creative design and production methods, stressing design iteration and regular testing across all aspects of game development (design, visual arts, music, fiction, and programming). Assumes a familiarity with current video games, and the ability to discuss games critically. Previous experience in audio design, visual arts, or project management recommended. Limited to 24."}, "Introduction to EECS via Interconnected Embedded Systems": {"title": "Introduction to EECS via Interconnected Embedded Systems", "number": "6.08", "description": "Introduction to embedded systems in the context of connected devices, wearables and the \"Internet of Things\" (IoT). Topics include microcontrollers, energy utilization, algorithmic efficiency, interfacing with sensors, networking, cryptography, and local versus distributed computation. Students design, make, and program an internet-connected wearable or handheld device. In final project, student teams design and demo their own cloud-connected IoT system. Enrollment limited; preference to first- and second-year students."}, "Introductory Analog Electronics Laboratory": {"title": "Introductory Analog Electronics Laboratory", "number": "6.101", "description": "Introductory experimental laboratory explores the design, construction, and debugging of analog electronic circuits. Lectures and laboratory projects in the first half of the course investigate the performance characteristics of semiconductor devices (diodes, BJTs, and MOSFETs) and functional analog building blocks, including single-stage amplifiers, op amps, small audio amplifier, filters, converters, sensor circuits, and medical electronics (ECG, pulse-oximetry). Projects involve design, implementation, and presentation in an environment similar to that of industry engineering design teams. Instruction and practice in written and oral communication provided. Opportunity to simulate real-world problems and solutions that involve tradeoffs and the use of engineering judgment."}, "Introductory Digital Systems Laboratory": {"title": "Introductory Digital Systems Laboratory", "number": "6.111", "description": "Introduces digital systems with lectures and labs on logic, flip flops,  FPGAs, counters, timing, synchronization, and finite-state machines. Includes overview of accelerometers, gyros, time of light and other modern sensors.  Prepares students for the design and implementation of a final project of their choice: games, music, digital filters, wireless communications, video, or graphics.  Extensive use of Verilog for describing and implementing digital logic designs."}, "Microcomputer Project Laboratory": {"title": "Microcomputer Project Laboratory", "number": "6.115", "description": "Introduces analysis and design of embedded systems. Microcontrollers provide adaptation, flexibility, and real-time control. Emphasizes construction of complete systems, including a five-axis robot arm, a fluorescent lamp ballast, a tomographic imaging station (e.g., a CAT scan), and a simple calculator. Presents a wide range of basic tools, including software and development tools, programmable system on chip, peripheral components such as A/D converters, communication schemes, signal processing techniques, closed-loop digital feedback control, interface and power electronics, and modeling of electromechanical systems. Includes a sequence of assigned projects, followed by a final project of the student's choice, emphasizing creativity and uniqueness. Provides instruction in written and oral communication. To satisfy the independent inquiry component of this subject, students expand the scope of their laboratory project."}, "Microcomputer Project Laboratory - Independent Inquiry": {"title": "Microcomputer Project Laboratory - Independent Inquiry", "number": "6.1151", "description": "Introduces analysis and design of embedded systems. Microcontrollers provide adaptation, flexibility, and real-time control. Emphasizes construction of complete systems, including a five-axis robot arm, a fluorescent lamp ballast, a tomographic imaging station (e.g., a CAT scan), and a simple calculator. Presents a wide range of basic tools, including software and development tools, programmable system on chip, peripheral components such as A/D converters, communication schemes, signal processing techniques, closed-loop digital feedback control, interface and power electronics, and modeling of electromechanical systems. Includes a sequence of assigned projects, followed by a final project of the student's choice, emphasizing creativity and uniqueness. Provides instruction in written and oral communication. Students taking independent inquiry version 6.1151 expand the scope of their laboratory project."}, "Introduction to Electrical Engineering Lab Skills": {"title": "Introduction to Electrical Engineering Lab Skills", "number": "6.117", "description": "Introduces basic electrical engineering concepts, components, and laboratory techniques. Covers analog integrated circuits, power supplies, and digital circuits. Lab exercises provide practical experience in constructing projects using multi-meters, oscilloscopes, logic analyzers, and other tools. Includes a project in which students build a circuit to display their own EKG. Enrollment limited."}, "Bioinstrumentation Project Lab": {"title": "Bioinstrumentation Project Lab", "number": "6.123[J]", "description": "In-depth examination of instrumentation design, principles and techniques for studying biological systems, from single molecules to entire organisms. Lectures cover optics, advanced microscopy techniques, electronics for biological measurement, magnetic resonance imaging, computed tomography, MEMs, microfluidic devices, and limits of detection. Students select two lab exercises during the first half of the semester and complete a final design project in the second half. Lab emphasizes design process and skillful realization of a robust system. Enrollment limited; preference to Course 20 majors and minors."}, "Biological Circuit Engineering Laboratory": {"title": "Biological Circuit Engineering Laboratory", "number": "6.129[J]", "description": "Students assemble individual genes and regulatory elements into larger-scale circuits; they experimentally characterize these circuits in yeast cells using quantitative techniques, including flow cytometry, and model their results computationally. Emphasizes concepts and techniques to perform independent experimental and computational synthetic biology research. Discusses current literature and ongoing research in the field of synthetic biology. Instruction and practice in oral and written communication provided. Enrollment limited."}, "Power Electronics Laboratory": {"title": "Power Electronics Laboratory", "number": "6.131", "description": "Introduces the design and construction of power electronic circuits and motor drives. Laboratory exercises include the construction of drive circuitry for an electric go-cart, flash strobes, computer power supplies, three-phase inverters for AC motors, and resonant drives for lamp ballasts and induction heating. Basic electric machines introduced include DC, induction, and permanent magnet motors, with drive considerations. Provides instruction in written and oral communication. Students taking independent inquiry version 6.1131 expand the scope of their laboratory project."}, "Power Electronics Laboratory - Independent Inquiry": {"title": "Power Electronics Laboratory - Independent Inquiry", "number": "6.1311", "description": "Introduces the design and construction of power electronic circuits and motor drives. Laboratory exercises include the construction of drive circuitry for an electric go-cart, flash strobes, computer power supplies, three-phase inverters for AC motors, and resonant drives for lamp ballasts and induction heating. Basic electric machines introduced include DC, induction, and permanent magnet motors, with drive considerations. Provides instruction in written and oral communication. To satisfy the independent inquiry component of this subject, students expand the scope of their laboratory project."}, "Robotics: Science and Systems": {"title": "Robotics: Science and Systems", "number": "6.141[J]", "description": "Presents concepts, principles, and algorithmic foundations for robots and autonomous vehicles operating in the physical world. Topics include sensing, kinematics and dynamics, state estimation, computer vision, perception, learning, control, motion planning, and embedded system development. Students design and implement advanced algorithms on complex robotic platforms capable of agile autonomous navigation and real-time interaction with the physical word. Students engage in extensive written and oral communication exercises. Enrollment limited."}, "Mobile Autonomous Systems Laboratory: MASLAB": {"title": "Mobile Autonomous Systems Laboratory: MASLAB", "number": "6.146", "description": "Autonomous robotics contest emphasizing technical AI, vision, mapping and navigation from a robot-mounted camera. Few restrictions are placed on materials, sensors, and/or actuators enabling teams to build robots very creatively. Teams should have members with varying engineering, programming and mechanical backgrounds. Culminates with a robot competition at the end of IAP. Enrollment limited."}, "Web Lab: A Web Programming Class and Competition": {"title": "Web Lab: A Web Programming Class and Competition", "number": "6.148", "description": "Student teams design and build web applications. Lectures cover version control, HTML, CSS, and JavaScript. Prior experience unnecessary as instructors and industry professionals teach both basic and advanced material. Teams present their projects in competition for prizes awarded by a judging panel of industry experts."}, "Mobile Applications Competition": {"title": "Mobile Applications Competition", "number": "6.150", "description": "Student teams design and build an Android application based on a given theme. Lectures and labs led by experienced students and leading industry experts, covering the basics of Android development, concepts and tools to help participants build great apps. Contest culminates with a public presentation in front of a judging panel comprised of professional developers and MIT faculty. Prizes awarded. Enrollment limited."}, "iOS Game Design and Development Competition": {"title": "iOS Game Design and Development Competition", "number": "6.151", "description": "Introduction to iOS game design and development for students already familiar with object-oriented programming. Provides a set of basic tools (Objective-C and Cocos2D) and exposure to real-world issues in game design. Working in small teams, students complete a final project in which they create their own iPhone game. At the end of IAP, teams present their games in competition for prizes awarded by a judging panel of gaming experts."}, "Micro/Nano Processing Technology": {"title": "Micro/Nano Processing Technology", "number": "6.152[J]", "description": "Introduces the theory and technology of micro/nano fabrication. Includes lectures and laboratory sessions on basic processing techniques such as vacuum processes, lithography, diffusion, oxidation, and pattern transfer. Students fabricate solar cells, MEMS cantilevers, and microfluidic mixers. Emphasizes interrelationships between material properties and processing, device structure, and the electrical, mechanical, optical, chemical or biological behavior of devices. Provides background for thesis work in micro/nano fabrication. Students engage in extensive written and oral communication exercises."}, "Modern Optics Project Laboratory": {"title": "Modern Optics Project Laboratory", "number": "6.161", "description": "Lectures, laboratory exercises and projects on optical signal generation, transmission, detection, storage, processing and display. Topics include polarization properties of light; reflection and refraction; coherence and interference; Fraunhofer and Fresnel diffraction; holography; Fourier optics; coherent and incoherent imaging and signal processing systems; optical properties of materials; lasers and LEDs; electro-optic and acousto-optic light modulators; photorefractive and liquid-crystal light modulation; display technologies; optical waveguides and fiber-optic communication systems; photodetectors. Students may use this subject to find an advanced undergraduate project. Students engage in extensive oral and written communcation exercises. Recommended prerequisite: 8.03."}, "Strobe Project Laboratory": {"title": "Strobe Project Laboratory", "number": "6.163", "description": "Application of electronic flash sources to measurement and   photography. First half covers fundamentals of photography and   electronic flashes, including experiments on application of electronic   flash to photography, stroboscopy, motion analysis, and high-speed   videography. Students write four extensive lab reports.  In the second half, students work in small groups to select, design,   and execute independent projects in measurement or photography that apply learned techniques. Project planning and execution skills are discussed and developed over the term.  Students engage in extensive written and oral communication exercises. Enrollment limited."}, "Constructive Computer Architecture": {"title": "Constructive Computer Architecture", "number": "6.175", "description": "Illustrates a constructive (as opposed to a descriptive) approach to computer architecture. Topics include combinational and pipelined arithmetic-logic units (ALU), in-order pipelined microarchitectures, branch prediction, blocking and unblocking caches, interrupts, virtual memory support, cache coherence and multicore architectures. Labs in a modern Hardware Design Language (HDL) illustrate various aspects of microprocessor design, culminating in a term project in which students present a multicore design running on an FPGA board."}, "Pokerbots Competition": {"title": "Pokerbots Competition", "number": "6.176", "description": "Build autonomous poker players and aquire the knowledge of the game of poker. Showcase decision making skills, apply concepts in mathematics, computer science and economics.  Provides instruction in programming, game theory, probability and statistics and machine learning. Concludes with a final competition and prizes. Enrollment limited"}, "Psychoacoustics Project Laboratory": {"title": "Psychoacoustics Project Laboratory", "number": "6.182", "description": "Introduces the methods used to measure human auditory abilities. Discusses auditory function, principles of psychoacoustic measurement, models for psychoacoustic performance, and experimental techniques. Project topics: absolute and differential auditory sensitivity, operating characteristics of human observers, span of auditory judgment, adaptive measurement procedures, and scaling sensory magnitudes. Knowledge of probability helpful. Students engage in extensive written and oral communication exercises."}, "Undergraduate Advanced Project": {"title": "Undergraduate Advanced Project", "number": "6.UAP", "description": "Research project for those students completing the SB degree, to be arranged by the student and an appropriate MIT faculty member.  Students who register for this subject must consult the department undergraduate office. Students engage in extensive written communications exercises."}, "Seminar in Undergraduate Advanced Research": {"title": "Seminar in Undergraduate Advanced Research", "number": "6.UAR", "description": "Instruction in effective undergraduate research, including choosing and developing a research topic, surveying previous work and publications, research topics in EECS, industry best practices, design for robustness, technical presentation, authorship and collaboration, and ethics.  Students engage in extensive written and oral communication exercises, in the context of an approved advanced research project. A total of 12 units of credit is awarded for completion of the Fall and subsequent Spring term offerings. Application required; consult EECS SuperUROP website for more information."}, "Oral Communication": {"title": "Oral Communication", "number": "6.UAT", "description": "Provides instruction in aspects of effective technical oral presentations and exposure to communication skills useful in a workplace setting. Students create, give and revise a number of presentations of varying length targeting a range of different audiences. Enrollment may be limited."}, "Networks": {"title": "Networks", "number": "6.207[J]", "description": "Highlights common principles that permeate the functioning of diverse technological, economic and social networks. Utilizes three sets of tools for analyzing networks--random graph models, optimization, and game theory--to study informational and learning cascades; economic and financial networks; social influence networks; formation of social groups; communication networks and the Internet; consensus and gossiping; spread and control of epidemics; control and use of energy networks; and biological networks."}, "Optimization Methods": {"title": "Optimization Methods", "number": "6.255[J]", "description": "Introduces the principal algorithms for linear, network, discrete, robust, nonlinear, and dynamic optimization. Emphasizes methodology and the underlying mathematical structures. Topics include the simplex method, network flow methods, branch and bound and cutting plane methods for discrete optimization, optimality conditions for nonlinear optimization, interior point methods for convex optimization, Newton's method, heuristic methods, and dynamic programming and optimal control methods. Expectations and evaluation criteria differ for students taking graduate version; consult syllabus or instructor for specific details."}, "Dynamic Programming and Stochastic Control": {"title": "Dynamic Programming and Stochastic Control", "number": "6.231", "description": "Sequential decision-making via dynamic programming. Unified approach to optimal control of stochastic dynamic systems and Markovian decision problems. Applications in linear-quadratic control, inventory control, resource allocation, scheduling, and planning. Optimal decision making under perfect and imperfect state information. Certainty equivalent, open loop-feedback control, rollout, model predictive control, aggregation, and other suboptimal control methods. Infinite horizon problems: discounted, stochastic shortest path, average cost, and semi-Markov models. Value and policy iteration. Abstract models in dynamic programming. Approximate/neurodynamic programming. Simulation based methods. Discussion of current research on the solution of large-scale problems."}, "Dynamic Systems and Control": {"title": "Dynamic Systems and Control", "number": "6.241[J]", "description": "Linear, discrete- and continuous-time, multi-input-output systems in control, related areas. Least squares and matrix perturbation problems. State-space models, modes, stability, controllability, observability, transfer function matrices, poles and zeros, and minimality. Internal stability of interconnected systems, feedback compensators, state feedback, optimal regulation, observers, and observer-based compensators. Measures of control performance, robustness issues using singular values of transfer functions. Introductory ideas on nonlinear systems. Recommended prerequisite: 6.302."}, "Graphical Models: A Geometric, Algebraic, and Combinatorial Perspective": {"title": "Graphical Models: A Geometric, Algebraic, and Combinatorial Perspective", "number": "6.244[J]", "description": "Provides instruction in the geometric, algebraic and combinatorial perspective on graphical models. Presents methods for learning the underlying graph and inferring its parameters. Topics include exponential families, duality theory, conic duality, polyhedral geometry, undirected graphical models, Bayesian networks, Markov properties, total positivity of distributions, hidden variables, and tensor decompositions."}, "Multivariable Control Systems": {"title": "Multivariable Control Systems", "number": "6.245", "description": "Computer-aided design methodologies for synthesis of multivariable feedback control systems. Performance and robustness trade-offs. Model-based compensators; Q-parameterization; ill-posed optimization problems; dynamic augmentation; linear-quadratic optimization of controllers; H-infinity controller design; Mu-synthesis; model and compensator simplification; nonlinear effects. Computer-aided (MATLAB) design homework using models of physical processes."}, "Introduction to Mathematical Programming": {"title": "Introduction to Mathematical Programming", "number": "6.251[J]", "description": "Introduction to linear optimization and its extensions emphasizing both methodology and the underlying mathematical structures and geometrical ideas. Covers classical theory of linear programming as well as some recent advances in the field. Topics: simplex method; duality theory; sensitivity analysis; network flow problems; decomposition; integer programming; interior point algorithms for linear programming; and introduction to combinatorial optimization and NP-completeness."}, "Nonlinear Optimization": {"title": "Nonlinear Optimization", "number": "6.252[J]", "description": "Unified analytical and computational approach to nonlinear optimization problems. Unconstrained optimization methods include gradient, conjugate direction, Newton, sub-gradient and first-order methods. Constrained optimization methods include feasible directions, projection, interior point methods, and Lagrange multiplier methods. Convex analysis, Lagrangian relaxation, nondifferentiable optimization, and applications in integer programming. Comprehensive treatment of optimality conditions and Lagrange multipliers. Geometric approach to duality theory. Applications drawn from control, communications, power systems, and resource allocation problems."}, "Game Theory with Engineering Applications": {"title": "Game Theory with Engineering Applications", "number": "6.254", "description": "Introduction to fundamentals of game theory and mechanism design with motivations for each topic drawn from engineering applications (including distributed control of wireline/wireless communication networks, transportation networks, pricing). Emphasis on the foundations of the theory, mathematical tools, as well as modeling and the equilibrium notion in different environments. Topics include normal form games, supermodular games, dynamic games, repeated games, games with incomplete/imperfect information, mechanism design, cooperative game theory, and network games."}, "Algebraic Techniques and Semidefinite Optimization": {"title": "Algebraic Techniques and Semidefinite Optimization", "number": "6.256[J]", "description": "Theory and computational techniques for optimization problems involving polynomial equations and inequalities with particular, emphasis on the connections with semidefinite optimization. Develops algebraic and numerical approaches of general applicability, with a view towards methods that simultaneously incorporate both elements, stressing convexity-based ideas, complexity results, and efficient implementations. Examples from several engineering areas, in particular systems and control applications. Topics include semidefinite programming, resultants/discriminants, hyperbolic polynomials, Groebner bases, quantifier elimination, and sum of squares."}, "Discrete Stochastic Processes": {"title": "Discrete Stochastic Processes", "number": "6.262", "description": "Review of probability and laws of large numbers; Poisson counting process and renewal processes; Markov chains (including Markov decision theory), branching processes, birth-death processes, and semi-Markov processes; continuous-time Markov chains and reversibility; random walks, martingales, and large deviations; applications from queueing, communication, control, and operations research."}, "Discrete Probability and Stochastic Processes": {"title": "Discrete Probability and Stochastic Processes", "number": "6.265[J]", "description": "Provides an introduction to tools used for probabilistic reasoning in the context of discrete systems and processes. Tools such as the probabilistic method, first and second moment method, martingales, concentration and correlation inequalities, theory of random graphs, weak convergence, random walks and Brownian motion, branching processes, Markov chains, Markov random fields, correlation decay method, isoperimetry, coupling, influences and other basic tools of modern research in probability will be presented. Algorithmic aspects and connections to statistics and machine learning will be emphasized."}, "Heterogeneous Networks: Architecture, Transport, Proctocols, and Management": {"title": "Heterogeneous Networks: Architecture, Transport, Proctocols, and Management", "number": "6.267", "description": "Introduction to modern heterogeneous networks and the provision of heterogeneous services. Architectural principles, analysis, algorithmic techniques, performance analysis, and existing designs are developed and applied to understand current problems in network design and architecture. Begins with basic principles of networking. Emphasizes development of mathematical and algorithmic tools; applies them to understanding network layer design from the performance and scalability viewpoint. Concludes with network management and control, including the architecture and performance analysis of interconnected heterogeneous networks. Provides background and insight to understand current network literature and to perform research on networks with the aid of network design projects."}, "Network Science and Models": {"title": "Network Science and Models", "number": "6.268", "description": "Introduces the main mathematical models used to describe large networks and dynamical processes that evolve on networks. Static models of random graphs, preferential attachment, and other graph evolution models.  Epidemic propagation, opinion dynamics, social learning, and inference in networks. Applications drawn from social, economic, natural, and infrastructure networks, as well as networked decision systems such as sensor networks."}, "Solid-State Circuits": {"title": "Solid-State Circuits", "number": "6.301", "description": "Analysis and design of transistor circuits, based directly on the semiconductor physics and transistor circuit models developed in 6.012. High-frequency and low-frequency design calculations and simulation of multistage transistor circuits. Trans-linear circuits. Introduction to operational-amplifier design and application. Some previous laboratory experience assumed."}, "Feedback System Design": {"title": "Feedback System Design", "number": "6.320", "description": "Learn-by-design introduction to continuous and discrete-time system modeling and feedback control. Topics include performance metrics; time- and frequency-domain model extraction: classical control topics, such as dominant pole, PID, and lead-lag compensation; and state-space control topics, such as eigenvalue assignment, linear-quadratic regulators, and observer systems. In lab, students combine circuits, sensors, actuators, algorithms, and a high-performance micro-controller to address problems such as controlling the angle of a propeller-levitated robot arm, stabilizing magnetic levitation, accelerating scans in a tilted-mirror laser imager, eliminating interference in a PWM-based audio amplifier, balancing a two-wheel vehicle, or multi-axis positioning."}, "Power Electronics": {"title": "Power Electronics", "number": "6.334", "description": "The application of electronics to energy conversion and control.  Modeling, analysis, and control techniques.  Design of power circuits including inverters, rectifiers, and dc-dc converters.  Analysis and design of magnetic components and filters.  Characteristics of power semiconductor devices.  Numerous application examples, such as motion control systems, power supplies, and radio-frequency power amplifiers."}, "Fast Methods for Partial Differential and Integral Equations": {"title": "Fast Methods for Partial Differential and Integral Equations", "number": "6.335[J]", "description": "Unified introduction to the theory and practice of modern, near linear-time, numerical methods for large-scale partial-differential and integral equations. Topics include preconditioned iterative methods; generalized Fast Fourier Transform and other butterfly-based methods; multiresolution approaches, such as multigrid algorithms and hierarchical low-rank matrix decompositions; and low and high frequency Fast Multipole Methods. Example applications include aircraft design, cardiovascular system modeling, electronic structure computation, and tomographic imaging."}, "Introduction to Numerical Simulation": {"title": "Introduction to Numerical Simulation", "number": "6.336[J]", "description": "Introduction to computational techniques for modeling and simulation of a variety of large and complex engineering, science, and socio-economical systems. Prepares students for practical use and development of computational engineering in their own research and future work. Topics include mathematical formulations (e.g., automatic assembly of constitutive and conservation principles); linear system solvers (sparse and iterative); nonlinear solvers (Newton and homotopy); ordinary, time-periodic and partial differential equation solvers; and model order reduction. Students develop their own models and simulators for self-proposed applications, with an emphasis on creativity, teamwork, and communication. Prior basic linear algebra and programming (e.g., MATLAB or Python) helpful."}, "Introduction to Numerical Methods": {"title": "Introduction to Numerical Methods", "number": "6.337[J]", "description": "Advanced introduction to numerical analysis: accuracy and efficiency of numerical algorithms. In-depth coverage of sparse-matrix/iterative and dense-matrix algorithms in numerical linear algebra (for linear systems and eigenproblems). Floating-point arithmetic, backwards error analysis, conditioning, and stability. Other computational topics (e.g., numerical integration or nonlinear optimization) may also be surveyed.  Final project involves some programming."}, "Numerical Computing and Interactive Software": {"title": "Numerical Computing and Interactive Software", "number": "6.338[J]", "description": "Interdisciplinary introduction to computing with Julia. Covers scientific computing and data analysis problems.  Combines knowledge from computer science and computational science illustrating Julia's approach to scientific computing.  Sample scientific computing topics include dense and sparse linear algebra, Fourier transforms, data handling, machine learning, and N-body problems. Provides direct experience with the modern realities of programming supercomputers, GPUs, and multicores in a high-level language."}, "Numerical Methods for Partial Differential Equations": {"title": "Numerical Methods for Partial Differential Equations", "number": "6.339[J]", "description": "Covers the fundamentals of modern numerical techniques for a wide range of linear and nonlinear elliptic, parabolic, and hyperbolic partial differential and integral equations. Topics include mathematical formulations; finite difference, finite volume, finite element, and boundary element discretization methods; and direct and iterative solution techniques. The methodologies described form the foundation for computational approaches to engineering systems involving heat transfer, solid mechanics, fluid dynamics, and electromagnetics. Computer assignments requiring programming."}, "Discrete-Time Signal Processing": {"title": "Discrete-Time Signal Processing", "number": "6.341", "description": "Representation, analysis, and design of discrete time signals and systems. Decimation, interpolation, and sampling rate conversion. Noise shaping. Flowgraph structures for DT systems. IIR and FIR filter design techniques. Parametric signal modeling, linear prediction, and lattice filters. Discrete Fourier transform, DFT computation, and FFT algorithms. Spectral analysis, time-frequency analysis, relation to filter banks. Multirate signal processing, perfect reconstruction filter banks, and connection to wavelets."}, "Digital Image Processing": {"title": "Digital Image Processing", "number": "6.344", "description": "Digital images as two-dimensional signals. Digital signal processing theories used for digital image processing, including one-dimensional and two-dimensional convolution, Fourier transform, discrete Fourier transform, and discrete cosine transform. Image processing basics. Image enhancement. Image restoration. Image coding and compression. Video processing including video coding and compression. Additional topics including digital high-definition television systems."}, "Automatic Speech Recognition": {"title": "Automatic Speech Recognition", "number": "6.345[J]", "description": "Introduces the rapidly developing fields of automatic speech recognition and spoken language processing. Topics include acoustic theory of speech production, acoustic-phonetics, signal representation, acoustic and language modeling, search, hidden Markov modeling, neural networks models, adaptation, and other related speech processing topics. Lecture material intersperses theory with practice.  Includes problem sets, laboratory exercises, and opened-ended term project."}, "Analysis and Design of Digital Integrated Circuits": {"title": "Analysis and Design of Digital Integrated Circuits", "number": "6.374", "description": "Device and circuit level optimization of digital building blocks. MOS device models including Deep Sub-Micron effects. Circuit design styles for logic, arithmetic, and sequential blocks. Estimation and minimization of energy consumption. Interconnect models and parasitics, device sizing and logical effort, timing issues (clock skew and jitter), and active clock distribution techniques. Memory architectures, circuits (sense amplifiers), and devices. Testing of integrated circuits. Extensive custom and standard cell layout and simulation in design projects and software labs."}, "Complex Digital Systems Design": {"title": "Complex Digital Systems Design", "number": "6.375", "description": "Introduction to the design and implementation of large-scale digital systems using hardware description languages and high-level synthesis tools in conjunction with standard commercial electronic design automation (EDA) tools. Emphasizes modular and robust designs, reusable modules, correctness by construction, architectural exploration, meeting area and timing constraints, and developing functional field-programmable gate array (FPGA) prototypes. Extensive use of CAD tools in weekly labs serve as preparation for a multi-person design project on multi-million gate FPGAs. Enrollment may be limited."}, "Statistics, Computation and Applications": {"title": "Statistics, Computation and Applications", "number": "6.439[J]", "description": "Hands-on analysis of data demonstrates the interplay between statistics and computation. Includes four modules, each centered on a specific data set, and introduced by a domain expert. Provides instruction in specific, relevant analysis methods and corresponding algorithmic aspects. Potential modules may include medical data, gene regulation, social networks, finance data (time series), traffic, transportation, weather forecasting, policy, or industrial web applications. Projects address a large-scale data analysis question. Students taking graduate version complete additional assignments. Limited enrollment; priority to Statistics and Data Science minors and to juniors and seniors."}, "Bayesian Modeling and Inference": {"title": "Bayesian Modeling and Inference", "number": "6.435", "description": "Covers Bayesian modeling and inference at an advanced graduate level. Topics include de Finetti's theorem, decision theory, approximate inference (modern approaches and analysis of Monte Carlo, variational inference, etc.), hierarchical modeling, (continuous and discrete) nonparametric Bayesian approaches, sensitivity and robustness, and evaluation."}, "Fundamentals of Probability": {"title": "Fundamentals of Probability", "number": "6.436[J]", "description": "Introduction to probability theory. Probability spaces and measures. Discrete and continuous random variables. Conditioning and independence. Multivariate normal distribution. Abstract integration, expectation, and related convergence results. Moment generating and  characteristic functions. Bernoulli and Poisson process. Finite-state  Markov chains. Convergence notions and their relations. Limit theorems. Familiarity with elementary notions in probability and real analysis is desirable."}, "Inference and Information": {"title": "Inference and Information", "number": "6.437", "description": "Introduction to principles of Bayesian and non-Bayesian statistical inference. Hypothesis testing and parameter estimation, sufficient statistics; exponential families. EM agorithm. Log-loss inference criterion, entropy and model capacity. Kullback-Leibler distance and information geometry. Asymptotic analysis and large deviations theory. Model order estimation; nonparametric statistics. Computational issues and approximation techniques; Monte Carlo methods. Selected topics such as universal inference and learning, and universal features and neural networks."}, "Algorithms for Inference": {"title": "Algorithms for Inference", "number": "6.438", "description": "Introduction to statistical inference with probabilistic graphical models.  Directed and undirected graphical models, and factor graphs, over discrete and Gaussian distributions; hidden Markov models, linear dynamical systems.  Sum-product and junction tree algorithms; forward-backward algorithm, Kalman filtering and smoothing.  Min-sum and Viterbi algorithms.  Variational methods, mean-field theory, and loopy belief propagation.  Particle methods and filtering.  Building graphical models from data, including parameter estimation and structure learning; Baum-Welch and Chow-Liu algorithms.   Selected special topics."}, "Essential Coding Theory": {"title": "Essential Coding Theory", "number": "6.440", "description": "Introduces the theory of error-correcting codes. Focuses on the essential results in the area, taught from first principles. Special focus on results of asymptotic or algorithmic significance. Principal topics include construction and existence results for error-correcting codes; limitations on the combinatorial performance of error-correcting codes; decoding algorithms; and applications to other areas of mathematics and computer science."}, "Information Theory": {"title": "Information Theory", "number": "6.441", "description": "Mathematical definitions of information measures, convexity, continuity, and variational properties. Lossless source coding; variable-length and block compression; Slepian-Wolf theorem; ergodic sources and Shannon-McMillan theorem. Hypothesis testing, large deviations and I-projection. Fundamental limits of block coding for noisy channels: capacity, dispersion, finite blocklength bounds. Coding with feedback. Joint source-channel problem. Rate-distortion theory, vector quantizers. Advanced topics include Gelfand-Pinsker problem, multiple access channels, broadcast channels  (depending on available time)."}, "Optical Networks": {"title": "Optical Networks", "number": "6.442", "description": "Introduces the fundamental and practical aspects of optical network technology, architecture, design and analysis tools and techniques.  The treatment of optical networks are from the architecture and system design points of view. Optical hardware technologies are introduced and characterized as fundamental network building blocks on which optical transmission systems and network architectures are based. Beyond the Physical Layer, the higher network layers (Media Access Control, Network and Transport Layers) are treated together as integral parts of network design. Performance metrics, analysis and optimization techniques are developed to help guide the creation of high performance complex optical networks."}, "Quantum Information Science": {"title": "Quantum Information Science", "number": "6.443[J]", "description": "Examines quantum computation and quantum information. Topics include quantum circuits, the quantum Fourier transform and search algorithms, the quantum operations formalism, quantum error correction, Calderbank-Shor-Steane and stabilizer codes, fault tolerant quantum computation, quantum data compression, quantum entanglement, capacity of quantum channels, and quantum cryptography and the proof of its security. Prior knowledge of quantum mechanics required."}, "Principles of Digital Communication": {"title": "Principles of Digital Communication", "number": "6.450", "description": "Communication sources and channels; data compression; entropy and the AEP; Lempel-Ziv universal coding; scalar and vector quantization; L2 waveforms; signal space and its representation by sampling and other expansions; aliasing; the Nyquist criterion; PAM and QAM modulation; Gaussian noise and random processes; detection and optimal receivers; fading channels and wireless communication; introduction to communication system design."}, "Principles of Wireless Communication": {"title": "Principles of Wireless Communication", "number": "6.452", "description": "Introduction to design, analysis, and fundamental limits of wireless transmission systems.  Wireless channel and system models; fading and diversity; resource management and power control; multiple-antenna and MIMO systems; space-time codes and decoding algorithms; multiple-access techniques and multiuser detection; broadcast codes and precoding; cellular and ad-hoc network topologies; OFDM and ultrawideband systems; architectural issues."}, "Quantum Optical Communication": {"title": "Quantum Optical Communication", "number": "6.453", "description": "Quantum optics: Dirac notation quantum mechanics; harmonic oscillator quantization; number states, coherent states, and squeezed states; radiation field quantization and quantum field propagation; P-representation and classical fields. Linear loss and linear amplification: commutator preservation and the Uncertainty Principle; beam splitters; phase-insensitive and phase-sensitive amplifiers. Quantum photodetection: direct detection, heterodyne detection, and homodyne detection. Second-order nonlinear optics: phasematched interactions; optical parametric amplifiers; generation of squeezed states, photon-twin beams, non-classical fourth-order interference, and polarization entanglement. Quantum systems theory: optimum binary detection; quantum precision measurements; quantum cryptography; and quantum teleportation."}, "Graduate Seminar in Area I": {"title": "Graduate Seminar in Area I", "number": "6.454", "description": "Student-run advanced graduate seminar with focus on topics in  communications, control, signal processing, optimization. Participants give presentations outside of their own research to expose colleagues to topics not covered in the usual curriculum. Recent topics have included compressed sensing, MDL principle, communication complexity, linear programming decoding, biology in EECS, distributed hypothesis testing, algorithms for random satisfaction problems, and cryptogaphy.  Open to advanced students from all areas of EECS. Limited to 12."}, "Array Processing": {"title": "Array Processing", "number": "6.456", "description": "Adaptive and non-adaptive processing of signals received at arrays of sensors. Deterministic beamforming, space-time random processes, optimal and adaptive algorithms, and the sensitivity of algorithm performance to modeling errors and limited data. Methods of improving the robustness of algorithms to modeling errors and limited data are derived. Advanced topics include an introduction to matched field processing and physics-based methods of estimating signal statistics. Homework exercises providing the opportunity to implement and analyze the performance of algorithms in processing data supplied during the course."}, "Quantitative Physiology: Organ Transport Systems": {"title": "Quantitative Physiology: Organ Transport Systems", "number": "6.522[J]", "description": "Application of the principles of energy and mass flow to major human organ systems. Anatomical, physiological and clinical features of the cardiovascular, respiratory and renal systems. Mechanisms of regulation and homeostasis. Systems, features and devices that are most illuminated by the methods of physical sciences and engineering models. Required laboratory work includes animal studies. Students taking graduate version complete additional assignments."}, "Laboratory on the Physiology, Acoustics, and Perception of Speech": {"title": "Laboratory on the Physiology, Acoustics, and Perception of Speech", "number": "6.542[J]", "description": "Experimental investigations of speech processes. Topics include computer-aided waveform analysis and spectral analysis of speech; synthesis of speech; perception and discrimination of speech-like sounds; speech prosody; models of speech recognition; speech development; analysis of atypical speech; and others. Recommended prerequisite: 6.002, 18.03, or 24.900."}, "Signal Processing by the Auditory System: Perception": {"title": "Signal Processing by the Auditory System: Perception", "number": "6.552[J]", "description": "Studies information processing performance of the human auditory system in relation to current physiological knowledge. Examines mathematical models for the quantification of auditory-based behavior and the relation between behavior and peripheral physiology, reflecting the tono-topic organization and stochastic responses of the auditory system. Mathematical models of psychophysical relations, incorporating quantitative knowledge of physiological transformations by the peripheral auditory system."}, "Data Acquisition and Image Reconstruction in MRI": {"title": "Data Acquisition and Image Reconstruction in MRI", "number": "6.556[J]", "description": "Applies analysis of signals and noise in linear systems, sampling, and Fourier properties to magnetic resonance (MR) imaging acquisition and reconstruction. Provides adequate foundation for MR physics to enable study of RF excitation design, efficient Fourier sampling, parallel encoding, reconstruction of non-uniformly sampled data, and the impact of hardware imperfections on reconstruction performance. Surveys active areas of MR research. Assignments include Matlab-based work with real data. Includes visit to a scan site for human MR studies."}, "Fields, Forces, and Flows in Biological Systems": {"title": "Fields, Forces, and Flows in Biological Systems", "number": "6.561[J]", "description": "Molecular diffusion, diffusion-reaction, conduction, convection in biological systems; fields in heterogeneous media; electrical double layers; Maxwell stress tensor, electrical forces in physiological systems. Fluid and solid continua: equations of motion useful for porous, hydrated biological tissues. Case studies of membrane transport, electrode interfaces, electrical, mechanical, and chemical transduction in tissues, convective-diffusion/reaction, electrophoretic, electroosmotic flows in tissues/MEMs, and ECG. Electromechanical and physicochemical interactions in cells and biomaterials; musculoskeletal, cardiovascular, and other biological and clinical examples. Prior undergraduate coursework in transport recommended."}, "Principles of Synthetic Biology": {"title": "Principles of Synthetic Biology", "number": "6.589[J]", "description": "Introduces the basics of synthetic biology, including quantitative cellular network characterization and modeling. Considers the discovery and genetic factoring of useful cellular activities into reusable functions for design. Emphasizes the principles of biomolecular system design and diagnosis of designed systems. Illustrates cutting-edge applications in synthetic biology and enhances skills in analysis and design of synthetic biological applications. Students taking graduate version complete additional assignments."}, "Fundamentals of Photonics": {"title": "Fundamentals of Photonics", "number": "6.621", "description": "Covers the fundamentals of optics and the interaction of light and matter, leading to devices such as light emitting diodes, optical amplifiers, and lasers. Topics include classical ray, wave, beam, and Fourier optics; Maxwell's electromagnetic waves; resonators; quantum theory of photons; light-matter interaction; laser amplification; lasers; and semiconductors optoelectronics. Students taking graduate version complete additional assignments."}, "Electromagnetics": {"title": "Electromagnetics", "number": "6.630", "description": "Explores electromagnetic phenomena in modern applications, including wireless and optical communications, circuits, computer interconnects and peripherals, microwave communications and radar, antennas, sensors, micro-electromechanical systems, and power generation and transmission. Fundamentals include quasistatic and dynamic solutions to Maxwell's equations; waves, radiation, and diffraction; coupling to media and structures; guided and unguided waves; modal expansions; resonance; acoustic analogs; and forces, power, and energy."}, "Optics and Photonics": {"title": "Optics and Photonics", "number": "6.631", "description": "Introduction to fundamental concepts and techniques of optics, photonics, and fiber optics. Review of Maxwell's equations, light propagation, and reflection from dielectrics mirrors and filters. Interferometers, filters, and optical imaging systems.  Fresnel and Fraunhoffer diffraction theory. Propagation of Gaussian beams and laser resonator design. Optical waveguides and optical fibers. Optical waveguide and photonic devices."}, "Electromagnetic Wave Theory": {"title": "Electromagnetic Wave Theory", "number": "6.632", "description": "Solutions to Maxwell equations and physical interpretation. Topics include waves in media, equivalence principle, duality and complementarity, Huygens' principle, Fresnel and Fraunhofer diffraction, radiation and dyadic Green's functions, scattering, metamaterials, and plasmonics, mode theory, dielectric waveguides, and resonators. Examples deal with limiting cases of electromagnetic theory, multi-port elements, filters and antennas. Discusses current topics in microwave and photonic devices."}, "Nonlinear Optics": {"title": "Nonlinear Optics", "number": "6.634[J]", "description": "Techniques of nonlinear optics with emphasis on fundamentals for research and engineering in optics, photonics, and spectroscopy. Electro optic modulators, harmonic generation, and frequency conversion devices. Nonlinear effects in optical fibers including self-phase modulation, nonlinear wave propagation, and solitons. Interaction of light with matter, laser operation, density matrix techniques, nonlinear spectroscopies, and femtosecond optics."}, "Optical Imaging Devices, and Systems": {"title": "Optical Imaging Devices, and Systems", "number": "6.637", "description": "Principles of operation and applications of optical imaging devices and systems (includes optical signal generation, transmission, detection, storage, processing and display). Topics include review of the basic properties of electromagnetic waves; coherence and interference; diffraction and holography; Fourier optics; coherent and incoherent imaging and signal processing systems; optical properties of materials; lasers and LEDs; electro-optic and acousto-optic light modulators; photorefractive and liquid-crystal light modulation; spatial light modulators and displays; near-eye and projection displays, holographic and other 3-D display schemes, photodetectors; 2-D and 3-D optical storage technologies; adaptive optical systems; role of optics in next-generation computers. Requires a research paper on a specific contemporary optical imaging topic. Recommended prerequisite: 8.03."}, "Electric Machines": {"title": "Electric Machines", "number": "6.685", "description": "Treatment of electromechanical transducers, rotating and linear electric machines. Lumped-parameter electromechanics. Power flow using Poynting's theorem, force estimation using the Maxwell stress tensor and Principle of virtual work.  Development of analytical techniques for predicting device  characteristics: energy conversion density, efficiency; and of system interaction characteristics: regulation, stability, controllability, and response. Use of electric machines in drive systems. Problems taken from current research."}, "Engineering, Economics and Regulation of the Electric Power Sector": {"title": "Engineering, Economics and Regulation of the Electric Power Sector", "number": "6.695[J]", "description": "Provides an in-depth and interdisciplinary look at electric power systems, focusing on regulation as the link among engineering, economic, legal, and environmental viewpoints. Topics include electricity markets, incentive regulation of network utilities, retail competition, tariff design, distributed generation, rural electrification, multinational electricity markets, environmental impacts, and the future of utilities and strategic sustainability issues under both traditional and competitive regulatory frameworks. Background in policy, microeconomics, or engineering desirable. Students taking graduate version complete additional assignments."}, "Introduction to Nanoelectronics": {"title": "Introduction to Nanoelectronics", "number": "6.701", "description": "Transistors at the nanoscale. Quantization, wavefunctions, and Schrodinger's equation. Introduction to electronic properties of molecules, carbon nanotubes, and crystals. Energy band formation and the origin of metals, insulators and semiconductors. Ballistic transport, Ohm's law, ballistic versus traditional MOSFETs, fundamental limits to computation."}, "Design and Fabrication of Microelectromechanical Systems": {"title": "Design and Fabrication of Microelectromechanical Systems", "number": "6.777[J]", "description": "Provides an introduction to microsystem design. Covers material properties, microfabrication technologies, structural behavior, sensing methods, electromechanical actuation, thermal actuation and control, multi-domain modeling, noise, and microsystem packaging. Applies microsystem modeling, and manufacturing principles to the design and analysis a variety of microscale sensors and actuators (e.g., optical MEMS, bioMEMS, and inertial sensors). Emphasizes modeling and simulation in the design process. Students taking the graduate version complete additional assignments."}, "Integrated Microelectronic Devices": {"title": "Integrated Microelectronic Devices", "number": "6.720[J]", "description": "Covers physics of microelectronic semiconductor devices for integrated circuit applications. Topics include semiconductor fundamentals, p-n junction, metal-oxide semiconductor structure, metal-semiconductor junction, MOS field-effect transistor, and bipolar junction transistor.  Emphasizes physical understanding of device operation through energy band diagrams and short-channel MOSFET device design and modern device scaling. Familiarity with MATLAB recommended."}, "Applied Quantum and Statistical Physics": {"title": "Applied Quantum and Statistical Physics", "number": "6.728", "description": "Elementary quantum mechanics and statistical physics. Introduces applied quantum physics. Emphasizes experimental basis for quantum mechanics. Applies Schrodinger's equation to the free particle, tunneling, the harmonic oscillator, and hydrogen atom. Variational methods. Elementary statistical physics; Fermi-Dirac, Bose-Einstein, and Boltzmann distribution functions. Simple models for metals, semiconductors, and devices such as electron microscopes, scanning tunneling microscope, thermonic emitters, atomic force microscope, and more."}, "Physics for Solid-State Applications": {"title": "Physics for Solid-State Applications", "number": "6.730", "description": "Classical and quantum models of electrons and lattice vibrations in solids, emphasizing physical models for elastic properties, electronic transport, and heat capacity. Crystal lattices, electronic energy band structures, phonon dispersion relations, effective mass theorem, semiclassical equations of motion, electron scattering and semiconductor optical properties. Band structure and transport properties of selected semiconductors. Connection of quantum theory of solids with quasi-Fermi levels and Boltzmann transport used in device modeling."}, "Semiconductor Optoelectronics: Theory and Design": {"title": "Semiconductor Optoelectronics: Theory and Design", "number": "6.731", "description": "Focuses on the physics of the interaction of photons with semiconductor materials. Uses the band theory of solids to calculate the absorption and gain of semiconductor media; and uses rate equation formalism to develop the concepts of laser threshold, population inversion, and modulation response. Presents theory and design for photodetectors, solar cells, modulators, amplifiers, and lasers. Introduces noise models for semiconductor devices, and applications of optoelectronic devices to fiber optic communications."}, "Physics of Solids": {"title": "Physics of Solids", "number": "6.732", "description": "Continuation of 6.730 emphasizing applications-related physical issues in solids. Topics include: electronic structure and energy band diagrams of semiconductors, metals, and insulators; Fermi surfaces; dynamics of electrons under electric and magnetic fields; classical diffusive transport phenomena such as electrical and thermal conduction and thermoelectric phenomena; quantum transport in tunneling and ballistic devices; optical properties of metals, semiconductors, and insulators; impurities and excitons; photon-lattice interactions; Kramers-Kronig relations; optoelectronic devices based on interband and intersubband transitions; magnetic properties of solids; exchange energy and magnetic ordering; magneto-oscillatory phenomena; quantum Hall effect; superconducting phenomena and simple models."}, "Physics of Microfabrication: Front End Processing": {"title": "Physics of Microfabrication: Front End Processing", "number": "6.774", "description": "Presents advanced physical models and practical aspects of front-end microfabrication processes, such as oxidation, diffusion, ion implantation, chemical vapor deposition, atomic layer deposition, etching, and epitaxy. Covers topics relevant to CMOS, bipolar, and optoelectronic device fabrication, including high k gate dielectrics, gate etching, implant-damage enhanced diffusion, advanced metrology, stress effects on oxidation, non-planar and nanowire device fabrication, SiGe and fabrication of process-induced strained Si. Exposure to CMOS process integration concepts, and impacts of processing on device characteristics. Students use modern process simulation tools."}, "CMOS Analog and Mixed-Signal Circuit Design": {"title": "CMOS Analog and Mixed-Signal Circuit Design", "number": "6.775", "description": "A detailed exposition of the principles involved in designing and optimizing analog and mixed-signal circuits in CMOS technologies. Small-signal and large-signal models. Systemic methodology for device sizing and biasing. Basic circuit building blocks. Operational amplifier design. Large signal considerations. Principles of switched capacitor networks including switched-capacitor and continuous-time integrated filters. Basic and advanced A/D and D/A converters, delta-sigma modulators, RF and other signal processing circuits. Design projects on op amps and subsystems are a required part of the subject."}, "High Speed Communication Circuits": {"title": "High Speed Communication Circuits", "number": "6.776", "description": "Principles and techniques of high-speed integrated circuits used in wireless/wireline data links and remote sensing. On-chip passive component design of inductors, capacitors, and antennas. Analysis of distributed effects, such as transmission line modeling, S-parameters, and Smith chart. Transceiver architectures and circuit blocks, which include low-noise amplifiers, mixers, voltage-controlled oscillators, power amplifiers, and frequency dividers. Involves IC/EM simulation and laboratory projects."}, "Control of Manufacturing Processes": {"title": "Control of Manufacturing Processes", "number": "6.780[J]", "description": "Statistical modeling and control in manufacturing processes. Use of experimental design and response surface modeling to understand manufacturing process physics. Defect and parametric yield modeling and optimization. Forms of process control, including statistical process control, run by run and adaptive control, and real-time feedback control. Application contexts include semiconductor manufacturing, conventional metal and polymer processing, and emerging micro-nano manufacturing processes."}, "Nanostructure Fabrication": {"title": "Nanostructure Fabrication", "number": "6.781[J]", "description": "Describes current techniques used to analyze and fabricate nanometer-length-scale structures and devices. Emphasizes imaging and patterning of nanostructures, including fundamentals of optical, electron (scanning, transmission, and tunneling), and atomic-force microscopy; optical, electron, ion, and nanoimprint lithography, templated self-assembly, and resist technology. Surveys substrate characterization and preparation, facilities, and metrology requirements for nanolithography. Addresses nanodevice processing methods, such as liquid and plasma etching, lift-off, electroplating, and ion-implant. Discusses applications in nanoelectronics, nanomaterials, and nanophotonics."}, "Machine Vision": {"title": "Machine Vision", "number": "6.866", "description": "Intensive introduction to the process of generating a symbolic description of the environment from an image. Students expected to attend the 6.801 lectures as well as occasional seminar meetings on special topics. Material presented in 6.801 is supplemented by reading from the literature. Students required to implement a project on a topic of their choice from the material covered."}, "Foundations of Computational and Systems Biology": {"title": "Foundations of Computational and Systems Biology", "number": "6.802[J]", "description": "Provides an introduction to computational and systems biology. Includes units on the analysis of protein and nucleic acid sequences, protein structures, and biological networks. Presents principles and methods used for sequence alignment, motif finding, expression array analysis, structural modeling, structure design and prediction, and network analysis and modeling. Techniques include dynamic programming, Markov and hidden Markov models, Bayesian networks, clustering methods, and energy minimization approaches. Exposes students to emerging research areas. Designed for students with strong backgrounds in either molecular biology or computer science. Some foundational material covering basic programming skills, probability and statistics is provided for students with less quantitative backgrounds. Students taking graduate version complete additional assignments."}, "The Human Intelligence Enterprise": {"title": "The Human Intelligence Enterprise", "number": "6.833", "description": "Analyzes seminal work directed at the development of a computational understanding of human intelligence, such as work on learning, language, vision, event representation, commonsense reasoning, self reflection, story understanding, and analogy. Reviews visionary ideas of Turing, Minsky, and other influential thinkers. Examines the implications of work on brain scanning, developmental psychology, and cognitive psychology. Emphasis on discussion and analysis of original papers. Requires the completion of additional exercises and a substantial term project. Enrollment limited."}, "Computational Cognitive Science": {"title": "Computational Cognitive Science", "number": "6.804[J]", "description": "Introduction to computational theories of human cognition. Focus on principles of inductive learning and inference, and the representation of knowledge. Computational frameworks covered include Bayesian and hierarchical Bayesian models; probabilistic graphical models; nonparametric statistical models and the Bayesian Occam's razor; sampling algorithms for approximate learning and inference; and probabilistic models defined over structured representations such as first-order logic, grammars, or relational schemas. Applications to understanding core aspects of cognition, such as concept learning and categorization, causal reasoning, theory formation, language acquisition, and social inference. Graduate students complete a final project."}, "Foundations of Information Policy": {"title": "Foundations of Information Policy", "number": "6.805[J]", "description": "Studies the growth of computer and communications technology and the new legal and ethical challenges that reflect tensions between individual rights and societal needs. Topics include computer crime; intellectual property restrictions on software; encryption, privacy, and national security; academic freedom and free speech. Students meet and question technologists, activists, law enforcement agents, journalists, and legal experts. Instruction and practice in oral and written communication provided. Students taking graduate version complete additional assignments. Enrollment limited."}, "Advanced Natural Language Processing": {"title": "Advanced Natural Language Processing", "number": "6.864", "description": "Introduces the study of human language from a computational perspective, including syntactic, semantic and discourse processing models. Emphasizes machine learning methods and algorithms. Uses these methods and models in applications such as syntactic parsing, information extraction, statistical machine translation, dialogue systems, and summarization. Students taking graduate version complete additional assignments."}, "Computational Fabrication": {"title": "Computational Fabrication", "number": "6.807", "description": "Introduces computational aspects of computer-aided design and manufacturing. Explores relevant methods in the context of additive manufacturing (e.g., 3D printing). Topics include computer graphics (geometry modeling, solid modeling, procedural modeling), physically-based simulation (kinematics, finite element method), 3D scanning/geometry processing, and an overview of 3D fabrication methods. Exposes students to the latest research in computational fabrication."}, "Mobile and Sensor Computing": {"title": "Mobile and Sensor Computing", "number": "6.808[J]", "description": "Explores fundamental design and implementation issues in the engineering of mobile and sensor computing systems. Focuses on the sensing, computing, and communication software technologies at the core of the \"Internet of Things\" (IoT). Topics include positioning technologies, including GPS and wireless localization, inertial sensing (accelerometers, gyroscopes, inertial measurement units, dead-reckoning), sensing with radio signals, sensing with microphones and cameras, wireless sensor networks, embedded and distributed system architectures, mobile libraries and APIs to sensors, and application case studies. Includes readings from research literature, as well as laboratory assignments and a significant term project."}, "Interactive Music Systems": {"title": "Interactive Music Systems", "number": "6.809[J]", "description": "Explores audio synthesis, musical structure, human computer interaction (HCI), and visual presentation for the creation of interactive musical experiences. Topics include audio synthesis; mixing and looping; MIDI sequencing; generative composition; motion sensors; music games; and graphics for UI, visualization, and aesthetics. Includes weekly programming assignments in python. Teams build an original, dynamic, and engaging interactive music system for their final project. Limited to 18."}, "Engineering Interactive Technologies": {"title": "Engineering Interactive Technologies", "number": "6.810", "description": "Provides instruction in building cutting-edge interactive technologies, explains the underlying engineering concepts, and shows how those technologies evolved over time. Students use a studio format (i.e., extended periods of time) for constructing software and hardware prototypes. Topics include interactive technologies, such as multi-touch, augmented reality, haptics, wearables, and shape-changing interfaces. In a group project, students build their own interactive hardware/software prototypes and present them in a live demo at the end of term. Enrollment may be limited."}, "Principles and Practice of Assistive Technology": {"title": "Principles and Practice of Assistive Technology", "number": "6.811[J]", "description": "Students work closely with people with disabilities to develop assistive and adaptive technologies that help them live more independently. Covers design methods and problem-solving strategies; human factors; human-machine interfaces; community perspectives; social and ethical aspects; and assistive technology for motor, cognitive, perceptual, and age-related impairments. Prior knowledge of one or more of the following areas useful: software; electronics; human-computer interaction; cognitive science; mechanical engineering; control; or MIT hobby shop, MIT PSC, or other relevant independent project experience."}, "User Interface Design and Implementation": {"title": "User Interface Design and Implementation", "number": "6.831", "description": "Examines human-computer interaction in the context of graphical user interfaces. Covers human capabilities, design principles, prototyping techniques, evaluation techniques, and the implementation of graphical user interfaces. Includes short programming assignments and a semester-long group project. Students taking the graduate version also have readings from current literature and additional assignments. Enrollment limited."}, "Database Systems": {"title": "Database Systems", "number": "6.830", "description": "Topics related to the engineering and design of database systems, including data models; database and schema design; schema normalization and integrity constraints; query processing; query optimization and cost estimation; transactions; recovery; concurrency control; isolation and consistency; distributed, parallel and heterogeneous databases; adaptive databases; trigger systems; pub-sub systems; semi structured data and XML querying. Lecture and readings from original research papers. Semester-long project and paper. Students taking graduate version complete different assignments. Enrollment may be limited."}, "Digital and Computational Photography": {"title": "Digital and Computational Photography", "number": "6.815", "description": "Presents fundamentals and applications of hardware and software techniques used in digital and computational photography, with an emphasis on software methods. Provides sufficient background to implement solutions to photographic challenges and opportunities. Topics include cameras and image formation, image processing and image representations, high-dynamic-range imaging, human visual perception and color, single view 3-D model reconstruction, morphing, data-rich photography, super-resolution, and image-based rendering. Students taking graduate version complete additional assignments."}, "Multicore Programming": {"title": "Multicore Programming", "number": "6.836", "description": "Introduces principles and core techniques for programming multicore machines. Topics include locking, scalability, concurrent data structures, multiprocessor scheduling, load balancing, and state-of-the-art synchronization techniques, such as transactional memory.  Includes sequence of programming assignments on a large multicore machine, culminating with the design of a highly concurrent  application. Students taking graduate version complete additional assignments."}, "Advances in Computer Vision": {"title": "Advances in Computer Vision", "number": "6.869", "description": "Advanced topics in computer vision with a focus on the use of machine learning techniques and applications in graphics and human-computer interface. Covers image representations, texture models, structure-from-motion algorithms, Bayesian techniques, object and scene recognition, tracking, shape modeling, and image databases. Applications may include face recognition, multimodal interaction, interactive systems, cinematic special effects, and photorealistic rendering. Covers topics complementary to 6.866. Students taking graduate version complete additional assignments."}, "Foundations of Program Analysis": {"title": "Foundations of Program Analysis", "number": "6.820", "description": "Presents major principles and techniques for program analysis. Includes formal semantics, type systems and type-based program analysis, abstract interpretation and model checking and synthesis. Emphasis on Haskell and Ocaml, but no prior experience in these languages is assumed.  Student assignments include implementing of techniques covered in class, including building simple verifiers."}, "Formal Reasoning About Programs": {"title": "Formal Reasoning About Programs", "number": "6.822", "description": "Surveys techniques for rigorous mathematical reasoning about correctness of software, emphasizing commonalities across approaches. Introduces interactive computer theorem proving with the Coq proof assistant, which is used for all assignments, providing immediate feedback on soundness of logical arguments. Covers common program-proof techniques, including operational semantics, model checking, abstract interpretation, type systems, program logics, and their applications to functional, imperative, and concurrent programs. Develops a common conceptual framework based on invariants, abstraction, and modularity applied to state and labeled transition systems."}, "Computer System Architecture": {"title": "Computer System Architecture", "number": "6.823", "description": "Introduction to the principles underlying modern computer architecture. Emphasizes the relationship among technology, hardware organization, and programming systems in the evolution of computer architecture. Topics include pipelined, out-of-order, and speculative execution; caches, virtual memory and exception handling, superscalar, very long instruction word (VLIW), vector, and multithreaded processors; on-chip networks, memory models, synchronization, and cache coherence protocols for multiprocessors."}, "Distributed Computer Systems Engineering": {"title": "Distributed Computer Systems Engineering", "number": "6.824", "description": "Abstractions and implementation techniques for engineering distributed  systems: remote procedure call, threads and locking, client/server,  peer-to-peer, consistency, fault tolerance, and security.  Readings  from current literature. Individual laboratory assignments culminate  in the construction of a fault-tolerant and scalable network file  system. Programming experience with C/C++ required. Enrollment limited."}, "Principles of Computer Systems": {"title": "Principles of Computer Systems", "number": "6.826", "description": "Introduction to the basic principles of computer systems with emphasis on the use of rigorous techniques as an aid to understanding and building modern computing systems. Particular attention paid to concurrent and distributed systems. Topics include: specification and verification, concurrent algorithms, synchronization, naming, Networking, replication techniques (including distributed cache management), and principles and algorithms for achieving reliability."}, "Operating System Engineering": {"title": "Operating System Engineering", "number": "6.828", "description": "Fundamental design and implementation issues in the engineering of operating systems.  Lectures based on the study of a symmetric multiprocessor version of UNIX version 6 and research papers. Topics include virtual memory; file system; threads; context switches; kernels; interrupts; system calls; interprocess communication; coordination, and interaction between software and hardware. Individual laboratory assignments accumulate in the construction of a minimal operating system (for an x86-based personal computer) that implements the basic operating system abstractions and a shell. Knowledge of programming in the C language is a prerequisite."}, "Computer Networks": {"title": "Computer Networks", "number": "6.829", "description": "Topics on the engineering and analysis of network protocols and architecture, including architectural principles for designing heterogeneous networks; transport protocols; Internet routing; router design; congestion control and network resource management; wireless networks; network security; naming; overlay and peer-to-peer networks. Readings from original research papers. Semester-long project and paper."}, "Underactuated Robotics": {"title": "Underactuated Robotics", "number": "6.832", "description": "Covers nonlinear dynamics and control of underactuated mechanical systems, with an emphasis on computational methods. Topics include the nonlinear dynamics of robotic manipulators, applied optimal and robust control and motion planning. Discussions include examples from biology and applications to legged locomotion, compliant manipulation, underwater robots, and flying machines."}, "Cognitive Robotics": {"title": "Cognitive Robotics", "number": "6.834[J]", "description": "Highlights algorithms and paradigms for creating human-robot systems that act intelligently and robustly, by reasoning from models of themselves, their counterparts and their world. Examples include space and undersea explorers, cooperative vehicles, manufacturing robot teams and everyday embedded devices. Themes include architectures for goal-directed systems; decision-theoretic programming and robust execution; state-space programming, activity and path planning; risk-bounded programming and risk-bounded planners; self-monitoring and self-diagnosing systems, and human-robot collaboration. Student teams explore recent advances in cognitive robots through delivery of advanced lectures and final projects, in support of a class-wide grand challenge. Enrollment may be limited."}, "Intelligent Multimodal User Interfaces": {"title": "Intelligent Multimodal User Interfaces", "number": "6.835", "description": "Implementation and evaluation of intelligent multi-modal user interfaces, taught from a combination of hands-on exercises and papers from the original literature. Topics include basic technologies for handling speech, vision, pen-based interaction, and other modalities, as well as various techniques for combining modalities. Substantial readings and a term project, where students build an interface to illustrate one or more themes of the course."}, "Shape Analysis": {"title": "Shape Analysis", "number": "6.838", "description": "Introduces mathematical, algorithmic, and statistical tools needed to analyze geometric data, with applications to computer graphics, computer vision, medical imaging, machine learning, architecture, and other fields.  Potential topics include applied introduction to differential geometry, discrete notions of curvature, PDE on geometric domains via the finite element method (FEM) and discrete exterior calculus (DEC), computational spectral geometry, correspondence and mapping, metric geometry, level set methods, descriptors, shape collections, and vector field design."}, "Theory of Computation": {"title": "Theory of Computation", "number": "6.840[J]", "description": "A more extensive and theoretical treatment of the material in 6.045J/18.400J, emphasizing computability and computational complexity theory. Regular and context-free languages. Decidable and undecidable problems, reducibility, recursive function theory. Time and space measures on computation, completeness, hierarchy theorems, inherently complex problems, oracles, probabilistic computation, and interactive proof systems. Students in Course 18 must register for the undergraduate version, 18.404."}, "Advanced Complexity Theory": {"title": "Advanced Complexity Theory", "number": "6.841[J]", "description": "Current research topics in computational complexity theory. Nondeterministic, alternating, probabilistic, and parallel computation models. Boolean circuits. Complexity classes and complete sets. The polynomial-time hierarchy. Interactive proof systems. Relativization. Definitions of randomness. Pseudo-randomness and derandomizations. Interactive proof systems and probabilistically checkable proofs."}, "Randomness and Computation": {"title": "Randomness and Computation", "number": "6.842", "description": "The power and sources of randomness in computation. Connections and applications to computational complexity, computational learning theory, cryptography and combinatorics. Topics include: probabilistic proofs, uniform generation and approximate counting, Fourier analysis of Boolean functions, computational learning theory, expander graphs, pseudorandom generators, derandomization."}, "Quantum Complexity Theory": {"title": "Quantum Complexity Theory", "number": "6.845", "description": "Introduction to quantum computational complexity theory, the study of the fundamental capabilities and limitations of quantum computers. Topics include complexity classes, lower bounds, communication complexity, proofs and advice, and interactive proof systems in the quantum world; classical simulation of quantum circuits. The objective is to bring students to the research frontier."}, "Parallel Computing": {"title": "Parallel Computing", "number": "6.846", "description": "Introduction to parallel and multicore computer architecture and programming.  Topics include the design and implementation of multicore processors; networking, video, continuum, particle and graph applications for multicores; communication and synchronization algorithms and mechanisms; locality in parallel computations; computational models, including shared memory, streams, message passing, and data parallel; multicore mechanisms for synchronization, cache coherence, and multithreading.  Performance evaluation of multicores; compilation and runtime systems for parallel computing.  Substantial project required."}, "Geometric Folding Algorithms: Linkages, Origami, Polyhedra": {"title": "Geometric Folding Algorithms: Linkages, Origami, Polyhedra", "number": "6.849", "description": "Covers discrete geometry and algorithms underlying the reconfiguration of foldable structures, with applications to robotics, manufacturing, and biology. Linkages made from one-dimensional rods connected by hinges: constructing polynomial curves, characterizing rigidity, characterizing unfoldable versus locked, protein folding. Folding two-dimensional paper (origami): characterizing flat foldability, algorithmic origami design, one-cut magic trick. Unfolding and folding three-dimensional polyhedra: edge unfolding, vertex unfolding, gluings, Alexandrov's Theorem, hinged dissections."}, "Geometric Computing": {"title": "Geometric Computing", "number": "6.850", "description": "Introduction to the design and analysis of algorithms for geometric problems, in low- and high-dimensional spaces. Algorithms: convex hulls, polygon triangulation, Delaunay triangulation, motion planning, pattern matching. Geometric data structures: point location, Voronoi diagrams, Binary Space Partitions. Geometric problems in higher dimensions: linear programming, closest  pair problems. High-dimensional nearest neighbor search and low-distortion embeddings between metric spaces. Geometric algorithms for massive data sets: external memory and streaming algorithms. Geometric optimization."}, "Advanced Data Structures": {"title": "Advanced Data Structures", "number": "6.851", "description": "More advanced and powerful data structures for answering several queries on the same data. Such structures are crucial in particular for designing efficient algorithms. Dictionaries; hashing; search trees. Self-adjusting data structures; linear search; splay trees; dynamic optimality. Integer data structures; word RAM. Predecessor problem; van Emde Boas priority queues; y-fast trees; fusion trees. Lower bounds; cell-probe model; round elimination. Dynamic graphs; link-cut trees; dynamic connectivity. Strings; text indexing; suffix arrays; suffix trees. Static data structures; compact arrays; rank and select. Succinct data structures; tree encodings; implicit data structures. External-memory and cache-oblivious data structures; B-trees; buffer trees; tree layout; ordered-file maintenance. Temporal data structures; persistence; retroactivity."}, "Distributed Algorithms": {"title": "Distributed Algorithms", "number": "6.852[J]", "description": "Design and analysis of concurrent algorithms, emphasizing those suitable for use in distributed networks. Process synchronization, allocation of computational resources, distributed consensus, distributed graph algorithms, election of a leader in a network, distributed termination, deadlock detection, concurrency control, communication, and clock synchronization. Special consideration given to issues of efficiency and fault tolerance. Formal models and proof methods for distributed computation."}, "Topics in Algorithmic Game Theory": {"title": "Topics in Algorithmic Game Theory", "number": "6.853", "description": "Presents research topics at the interface of computer science and game theory, with an emphasis on algorithms and computational complexity. Explores the types of game-theoretic tools that are applicable to computer systems, the loss in system performance due to the conflicts of interest of users and administrators, and the design of systems whose performance is robust with respect to conflicts of interest inside the system. Algorithmic focus is on algorithms for equilibria, the complexity of equilibria and fixed points, algorithmic tools in mechanism design, learning in games, and the price of anarchy."}, "Advanced Algorithms": {"title": "Advanced Algorithms", "number": "6.854[J]", "description": "First-year graduate subject in algorithms. Emphasizes fundamental algorithms and advanced methods of algorithmic design, analysis, and implementation. Surveys a variety of computational models and the algorithms for them. Data structures, network flows, linear programming, computational geometry, approximation algorithms, online algorithms, parallel algorithms, external memory, streaming algorithms."}, "Randomized Algorithms": {"title": "Randomized Algorithms", "number": "6.856[J]", "description": "Studies how randomization can be used to make algorithms simpler and more efficient via random sampling, random selection of witnesses, symmetry breaking, and Markov chains. Models of randomized computation. Data structures: hash tables, and skip lists. Graph algorithms: minimum spanning trees, shortest paths, and minimum cuts. Geometric algorithms: convex hulls, linear programming in fixed or arbitrary dimension. Approximate counting; parallel algorithms; online algorithms; derandomization techniques; and tools for probabilistic analysis of algorithms."}, "Network and Computer Security": {"title": "Network and Computer Security", "number": "6.857", "description": "Emphasis on applied cryptography and may include: basic notion of systems security, crypotographic hash functions, symmetric crypotography (one-time pad, stream ciphers, block ciphers), cryptanalysis, secret-sharing, authentication codes, public-key cryptography (encryption, digital signatures), public-key attacks, web browser security, biometrics, electronic cash, viruses, electronic voting, Assignments include a group final project. Topics may vary year to year."}, "Computer Systems Security": {"title": "Computer Systems Security", "number": "6.858", "description": "Design and implementation of secure computer systems.  Lectures cover attacks that compromise security as well as techniques for achieving security, based on recent research papers.  Topics include operating system security, privilege separation, capabilities, language-based security, cryptographic network protocols, trusted hardware, and security in web applications and mobile phones.  Labs involve implementing and compromising a web application that sandboxes arbitrary code, and a group final project."}, "Statistical Learning Theory and Applications": {"title": "Statistical Learning Theory and Applications", "number": "6.860[J]", "description": "Provides students with the knowledge needed to use and develop advanced machine learning solutions to challenging problems. Covers foundations and recent advances of machine learning in the framework of statistical learning theory. Focuses on regularization techniques key to high-dimensional supervised learning. Starting from classical methods such as regularization networks and support vector machines, addresses state-of-the-art techniques based on principles such as geometry or sparsity, and discusses a variety of algorithms for supervised learning, feature selection, structured prediction, and multitask learning. Also focuses on unsupervised learning of data representations, with an emphasis on hierarchical (deep) architectures."}, "Aspects of a Computational Theory of Intelligence": {"title": "Aspects of a Computational Theory of Intelligence", "number": "6.861[J]", "description": "Integrates neuroscience, cognitive and computer science to explore the nature of intelligence, how it is produced by the brain, and how it can be replicated in machines. Discusses an array of current research connected through an overarching theme of how it contributes to a computational account of how humans analyze dynamic visual imagery to understand objects and actions in the world."}, "Applied Machine Learning": {"title": "Applied Machine Learning", "number": "6.862", "description": "Introduces principles, algorithms, and applications of machine learning from the point of view of modeling and prediction; formulation of learning problems; representation, over-fitting, generalization; classification, regression, reinforcement learning; and methods such as linear classifiers, feed-forward, convolutional, and recurrent networks. Students taking graduate version complete different assignments. Meets with 6.036 when offered concurrently. Recommended prerequisites: 18.06 and 6.006. Enrollment limited; no listeners."}, "Natural Language and the Computer Representation of Knowledge": {"title": "Natural Language and the Computer Representation of Knowledge", "number": "6.863[J]", "description": "Explores the relationship between the computer representation and acquisition of knowledge and the structure of human language, its acquisition, and hypotheses about its differentiating uniqueness.  Emphasizes development of analytical skills necessary to judge the computational implications of grammatical formalisms and their role in connecting human intelligence to computational intelligence. Uses concrete examples to illustrate particular computational issues in this area."}, "Advanced Computational Photography": {"title": "Advanced Computational Photography", "number": "6.865", "description": "Presents fundamentals and applications of hardware and software techniques used in digital and computational photography, with an emphasis on software methods. Provides sufficient background to implement solutions to photographic challenges and opportunities. Topics include cameras and image formation, image processing and image representations, high-dynamic-range imaging, human visual perception and color, single view 3-D model reconstruction, morphing, data-rich photography, super-resolution, and image-based rendering. Students taking graduate version complete additional assignments."}, "Machine Learning": {"title": "Machine Learning", "number": "6.867", "description": "Principles, techniques, and algorithms in machine learning from the point of view of statistical inference; representation, generalization, and model selection; and methods such as linear/additive models, active learning, boosting, support vector machines, non-parametric Bayesian methods, hidden Markov models, Bayesian networks, and convolutional and recurrent neural networks. Recommended prerequisite: 6.036 or other previous experience in machine learning."}, "Advanced Topics in Computer Vision": {"title": "Advanced Topics in Computer Vision", "number": "6.870", "description": "Seminar exploring advanced research topics in the field of computer vision; focus varies with lecturer. Typically structured around discussion of assigned research papers and presentations by students. Example research areas explored in this seminar include learning in vision, computational imaging techniques, multimodal human-computer interaction, biomedical imaging, representation and estimation methods used in modern computer vision."}, "Biomedical Computing": {"title": "Biomedical Computing", "number": "6.872[J]", "description": "Analyzes computational needs of clinical medicine, reviews systems and approaches that have been used to support those needs, and the relationship between clinical data and gene and protein measurements to support precision medicine. Topics include the nature of clinical data, architecture and design of healthcare information systems, privacy and security issues, medical expert systems, predictive models and machine learning from big data in healthcare, and an introduction to bioinformatics. Case studies and guest lectures describe contemporary institutions, systems, and research projects. Term project using large clinical and genomic data sets integrates classroom topics."}, "Computational Systems Biology": {"title": "Computational Systems Biology", "number": "6.874[J]", "description": "Presents advanced machine learning and algorithmic approaches for contemporary problems in biology drawing upon recent advances in the literature.   Topics include biological discovery in heterogeneous cellular populations; single cell data analysis; regulatory factor binding; motif discovery; gene expression analysis; regulatory networks (discovery, validation, data integration, protein-protein interactions, signaling, chromatin accessibility analysis); predicting phenotype from genotype; and experimental design (model validation, interpretation of interventions).  Computational methods presented include deep learning, dimensionality reduction, clustering, directed and undirected graphical models, significance testing, Dirichlet processes, and topic models. Multidisciplinary team-oriented final research project."}, "Innovation Engineering: Moving Ideas to Impact": {"title": "Innovation Engineering: Moving Ideas to Impact", "number": "6.901[J]", "description": "Designed for students to gain the perspective of a Chief Technology Officer of a start-up, large corporation, or a not-for-profit. Details the innovation process, from an idea's inception through impact in the economy, regardless of organizational setting. Explores how solutions are developed to become ready for broader market deployment. Includes testing and development of the problem-solution fit, probing of solutions for robustness, and testing of both technical and operational scaling of proposed solutions. Examines the human aspects of innovation, specifically issues of team building and readiness. Considers the broader system for innovation, including the role of key stakeholders in shaping its success in order to arrive at an impactful solution. Addresses intellectual property, the effect of regulations and social and cultural differences across varied global markets, and the personal skillset necessary to align and manage these issues."}, "Engineering Innovation and Design": {"title": "Engineering Innovation and Design", "number": "6.902", "description": "Project-based seminar in innovative design thinking develops students' ability to conceive, implement, and evaluate successful projects in any engineering discipline. Lectures focus on the iterative design process and techniques to enhance creative analysis. Students use this process to design and implement robust voice recognition applications using a simple web-based system. They also give presentations and receive feedback to sharpen their communication skills for high emotional and intellectual impact. Guest lectures illustrate multidisciplinary approaches to design thinking."}, "Patents, Copyrights, and the Law of Intellectual Property": {"title": "Patents, Copyrights, and the Law of Intellectual Property", "number": "6.903", "description": "Intensive introduction to the US law of intellectual property with major emphasis on patents, including the process of patent application and the remedies for patent infringement.  Also focuses on copyrights and provides a brief look at trademarks and trade secrets. Presents comparisons of what can and cannot be protected, and what rights the owner does and does not obtain. Highlights issues relating to information technology, biogenetic materials, and business methods. Readings include judicial opinions and statutory material. No listeners."}, "Ethics for Engineers": {"title": "Ethics for Engineers", "number": "6.904", "description": "Integrates classical readings that provide an overview of ethics with a survey of case studies that focus on ethical problems arising in the practice of engineering. Readings taken from a variety of sources, such as Aristotle, Machiavelli, Bacon, Hobbes, Locke, the Founding Fathers, and the Bible. Case studies include written analyses and films that address engineering disasters, biotechnology, court cases, ethical codes, and the ultimate scope and aims of engineering. Students taking independent inquiry version 6.9041 expand the scope of their term project. Students taking 20.005 focus their term project on a problem in biological engineering in which there are intertwined ethical and technical issues."}, "Ethics for Engineers - Independent Inquiry": {"title": "Ethics for Engineers - Independent Inquiry", "number": "6.9041", "description": "Explores the ethical principles by which an engineer ought to be guided. Integrates foundational texts in ethics with case studies illustrating ethical problems arising in the practice of engineering. Readings from classic sources including Aristotle, Kant, Machiavelli, Hobbes, Locke, Rousseau, Franklin and Tocqueville. Case studies include articles and films that address engineering disasters, safety, ethical codes, biotechnology, the internet and AI, and the ultimate scope and aims of engineering.  To satisfy the independent inquiry component of this subject, students expand the scope of their term project. Students taking 20.005 focus their term project on a problem in biological engineering in which there are intertwined ethical and technical issues."}, "Large-scale Symbolic Systems": {"title": "Large-scale Symbolic Systems", "number": "6.945", "description": "Concepts and techniques for the design and implementation of large software systems that can be adapted to uses not anticipated by the designer. Applications include compilers, computer-algebra systems, deductive systems, and some artificial intelligence applications. Covers means for decoupling goals from strategy, mechanisms for implementing additive data-directed invocation, work with partially-specified entities, and how to manage multiple viewpoints. Topics include combinators, generic operations, pattern matching, pattern-directed invocation, rule systems, backtracking, dependencies, indeterminacy, memoization, constraint propagation, and incremental refinement. Students taking graduate version complete additional assignments."}, "StartMIT: Workshop for Entrepreneurs and Innovators": {"title": "StartMIT: Workshop for Entrepreneurs and Innovators", "number": "6.936", "description": "Designed for students who are interested in entrepreneurship and want to explore the potential commercialization of their research project. Introduces practices for building a successful company, such as idea creation and validation, defining a value proposition, building a team, marketing, customer traction, and possible funding models. Students taking graduate version complete different assignments."}, "Entrepreneurship in Engineering": {"title": "Entrepreneurship in Engineering", "number": "6.933", "description": "Immerses students in the experience of an engineer who founds a start-up company. Examines leadership, innovation, and creativity through the lens of an entrepreneur. Suitable for students interested in transforming an idea into a business or other realization for wide-scale societal impact. Covers critical aspects of validating ideas and assessing personal attributes needed to activate and lead a growing organization. Teams explore the basics of new venture creation and experimentation. Emphasizes personal skills and practical experiences. Students taking graduate version will complete additional assignments. No listeners."}, "Engineering Leadership Lab": {"title": "Engineering Leadership Lab", "number": "6.913", "description": "Exposes students to leadership frameworks, models and cases within an engineering context, in an interactive, practice-based environment, honing leadership and teamwork skills. Students participate in guided reflections on individual and team successes, and discover opportunities for improvement in controlled settings. Activities include design-implement activities, role-plays, simulations, small group discussions, and performance and peer assessments by and of other students. Content throughout the term is frequently student-driven. First year Gordon Engineering Leadership Program (GEL) students register for 6.911. Second year GEL Program students register for 6.913. Preference to students enrolled in the second year of the Gordon-MIT Engineering Leadership Program."}, "Engineering Leadership": {"title": "Engineering Leadership", "number": "6.912", "description": "Exposes students to the models and methods of engineering leadership within the contexts of conceiving, designing, implementing and operating products, processes and systems. Introduces the Capabilities of Effective Engineering Leaders, and models and theories related to the capabilities. Discusses the appropriate times and reasons to use particular models to deliver engineering success. Includes occasional guest speakers or panel discussions. May be repeated for credit once with permission of instructor. Preference to first-year students in the Gordon Engineering Leadership Program."}, "Project Engineering": {"title": "Project Engineering", "number": "6.914", "description": "Students attend a four-day off-site workshop where an introduction to basic principles, methods, and tools for project management in a realistic context are covered. In teams, students create a plan for a project of their choice in one of several areas, including aircraft modification, factory automation, enterprise software, flood prevention engineering, solar farm engineering, among others. Develops skills applicable to the management of complex development projects. Topics include cost-benefit analysis, resource and cost estimation, and project control and delivery, which are practiced during an experimental, team-based activity. Case studies highlight projects in both hardware/construction and software. Preference to students in the Bernard M. Gordon-MIT Engineering Leadership Program."}, "Leading Innovation in Teams": {"title": "Leading Innovation in Teams", "number": "6.915[J]", "description": "Empowers future innovators in engineering and technology with a foundation of leadership and teamwork skills. Grounded in research but practical in focus, equips students with leadership competencies such as building self-awareness, motivating and developing others, influencing without authority, managing conflict, and communicating effectively.  Teamwork skills include how to convene, launch, and develop various types of teams, including project teams. Reviews recent advances in implementing innovations and building personal capacity for lifelong learning as a leading innovator. Enrollment limited to seating capacity of classroom. Admittance may be controlled by lottery."}, "Practical Internship Experience": {"title": "Practical Internship Experience", "number": "6.920", "description": "For Course 6 students participating in curriculum-related off-campus internship experiences in electrical engineering or computer science. Before enrolling, students must have an employment offer from a company or organization and must find an EECS supervisor. Upon completion of the internship the student must submit a letter from the employer evaluating the work accomplished, a substantive final report from the student, approved by the MIT supervisor. Subject to departmental approval. Consult Department Undergraduate Office for details on procedures and restrictions."}, "Leading Creative Teams": {"title": "Leading Creative Teams", "number": "6.928[J]", "description": "Prepares students to lead teams charged with developing creative solutions in engineering and technical environments. Grounded in research but practical in focus, equips students with leadership competencies such as building self-awareness, motivating and developing others, creative problem solving, influencing without authority, managing conflict, and communicating effectively. Teamwork skills include how to convene, launch, and develop various types of teams, including project teams. Learning methods emphasize personalized and professional skill development."}, "Energy Technology and Policy:  From Principles to Practice": {"title": "Energy Technology and Policy:  From Principles to Practice", "number": "6.929[J]", "description": "Develops analytical skills to lead a successful technology implementation with an integrated approach that combines technical, economical and social perspectives. Considers corporate and government viewpoints as well as international aspects, such as nuclear weapons proliferation and global climate issues.  Discusses technologies such as oil and gas, nuclear, solar, and energy efficiency. Limited to 100."}, "Management in Engineering": {"title": "Management in Engineering", "number": "6.930", "description": "Introduction and overview of engineering management. Financial principles, management of innovation, technical strategy and best management practices. Case study method of instruction emphasizes participation in class discussion. Focus is on the development of individual skills and management tools. Restricted to juniors and seniors."}, "Engineering, Economics and Regulation for Energy Access in Developing Countries": {"title": "Engineering, Economics and Regulation for Energy Access in Developing Countries", "number": "6.934[J]", "description": "Examines the technical, economic, political and social trade-offs inherent in designing energy solutions that can ensure universal access to electricity - as well as modern technologies for heating and cooking - in developing countries. Presents the characteristic features of the power sectors in these countries and how they need specific technical, financial and regulatory approaches. Focuses on the identification and design of viable business models that can attract the large volume of private investment needed to achieve universal energy access. Covers adequate power sector regulation and computer-aided electrification planning techniques in detail. Students make use of these models and discuss practical case examples."}, "Financial Market Dynamics and Human Behavior": {"title": "Financial Market Dynamics and Human Behavior", "number": "6.935[J]", "description": "Gives students a complete understanding of financial markets. Draws on the latest research in psychology, evolutionary biology, and artificial intelligence, as well as in financial economics, to provide new perspectives and insights into the role that human behavior plays in the business environment and the dynamics of financial markets and institutions. Incorporates practical applications from financial markets, the hedge fund industry, private equity, government regulation, and political economy. Students use ideas from this new perspective to formulate original hypotheses regarding real-world challenges involving investment and business strategies, risk management, financial crises, and corporate ethics."}, "Statistics for Research Projects: Statistical Modeling and Experiment Design": {"title": "Statistics for Research Projects: Statistical Modeling and Experiment Design", "number": "6.941", "description": "Practical introduction to data analysis, statistical modeling, and experimental design, intended to provide essential skills for conducting research.   Covers basic techniques such as hypothesis-testing and regression models for both traditional experiments and newer paradignms such as evaluating simulations.  Assignments reinforce techniques through analyzing sample datasets and reading case studies. Students with research projects will be encouraged to share their experiences and project-specific questions."}, "How to Make (Almost) Anything": {"title": "How to Make (Almost) Anything", "number": "6.943[J]", "description": "Provides a practical hands-on introduction to digital fabrication, including CAD/CAM/CAE, NC machining, 3-D printing and scanning, molding and casting, composites, laser and waterjet cutting, PCB design and fabrication; sensors and actuators; mixed-signal instrumentation, embedded processing, and wired and wireless communications. Develops an understanding of these capabilities through projects using them individually and jointly to create functional systems."}, "Classical Mechanics: A Computational Approach": {"title": "Classical Mechanics: A Computational Approach", "number": "6.946[J]", "description": "Classical mechanics in a computational framework, Lagrangian formulation, action, variational principles, and Hamilton's principle. Conserved quantities, Hamiltonian formulation, surfaces of section, chaos, and Liouville's theorem. Poincaré integral invariants, Poincaré-Birkhoff and KAM theorems. Invariant curves and cantori. Nonlinear resonances, resonance overlap and transition to chaos. Symplectic integration. Adiabatic invariants. Applications to simple physical systems and solar system dynamics. Extensive use of computation to capture methods, for simulation, and for symbolic analysis. Programming experience required. Students taking the graduate version complete additional assignments."}, "Graduate 6-A Internship": {"title": "Graduate 6-A Internship", "number": "6.952", "description": "Provides academic credit for graduate students who require an additional term at the company to complete the graduate assignment of the department's 6-A internship program. This academic credit is for registration purposes only and cannot be used toward fulfilling the requirements of any degree program. Limited to graduate students participating in the 6-A internship program."}, "Introductory Research in Electrical Engineering and Computer Science": {"title": "Introductory Research in Electrical Engineering and Computer Science", "number": "6.960", "description": "Enrollment restricted to first-year graduate students in Electrical Engineering and Computer Science who are doing introductory research leading to an SM, EE, ECS, PhD, or ScD thesis. Opportunity to become involved in graduate research, under guidance of a staff member, on a problem of mutual interest to student and supervisor. Individual programs subject to approval of professor in charge."}, "Professional Perspective I": {"title": "Professional Perspective I", "number": "6.994", "description": "Required for Course 6 students in the doctoral program to gain professional perspective in research experiences, academic experiences, and internships in electrical engineering and computer science. Professional perspective options include: internships (with industry, government or academia), industrial colloquia or seminars, research collaboration with industry or government, and professional development for entry into academia or entrepreneurial engagement. For an internship experience, an offer of employment from a company or organization is required prior to enrollment; employers must document work accomplished. A written report is required upon completion of a minimum of 4 weeks of off-campus experiences. Proposals subject to departmental approval."}, "Professional Perspective II": {"title": "Professional Perspective II", "number": "6.995", "description": "Required for Course 6 students in the doctoral program to gain professional perspective in research experiences, academic experiences, and internships in electrical engineering and computer science. Professional perspective options include: internships (with industry, government or academia), industrial colloquia or seminars, research collaboration with industry or government, and professional development for entry into academia or entrepreneurial engagement. For an internship experience, an offer of employment from a company or organization is required prior to enrollment; employers must document work accomplished. A written report is required upon completion of a minimum of 4 weeks of off-campus experiences. Proposals subject to departmental approval."}, "Professional Perspective Internship": {"title": "Professional Perspective Internship", "number": "6.997", "description": "Required for Course 6 students in the MEng program to gain professional perspective in research experiences or internships in electrical engineering or computer science. Before enrolling, students must have an offer of employment from a company or organization. Employers must document the work accomplished. Written report required upon completion of a minimum of four weeks of off-campus experience. Proposals subject to departmental approval. For international students who begin the MEng program in the same summer as the proposed experience, internship may not begin earlier than the first day of the Summer Session."}, "Practical Experience in EECS": {"title": "Practical Experience in EECS", "number": "6.999", "description": "For Course 6 students in the SM/PhD track who seek practical off-campus research experiences or internships in electrical engineering or computer science. Before enrolling, students must have a firm employment offer from a company or organization and secure a research supervisor within EECS. Employers required to document the work accomplished. Research proposals subject to departmental approval; consult departmental Graduate Office."}, "UPOP Engineering Practice Experience": {"title": "UPOP Engineering Practice Experience", "number": "6.EPE", "description": "Provides sophomores with guided practice in finding opportunities and excelling in the world of practice. Building on the skills and relationships acquired in the Engineering Practice Workshop, students receive coaching to articulate goals, invoke the UPOP network of mentors and employers, identify and pursue opportunities and negotiate terms of their summer assignment. Students complete a 10-12 week internship, which includes filing three progress reports, conducting one informational interview, and possibly hosting a site visit by MIT staff. Returning to campus as juniors, UPOP students take part in reflective exercises that aid assimilation of learning objectives and reinforce the cognitive link between all aspects of the UPOP experience and disciplinary fields of study. Sequence begins in the spring of sophomore year and ends in the fall of junior year."}, "UPOP Engineering Practice Workshop": {"title": "UPOP Engineering Practice Workshop", "number": "6.EPW", "description": "Develops foundational skills for the world of practice in science, technology, and engineering. Sophomores receive classroom instruction, and one-on-one and small-group coaching in basics of professional identity building. They attend field trips to local employers and receive job interview practice, coached by industry volunteers. Over IAP, students attend a weeklong Team Training Camp of experiential learning modules - led by MIT faculty with the help of MIT alums and other senior professionals in business, engineering, and science where students participate in creative simulations, team problem-solving challenges, and oral presentations, and practice networking with employers. Enrollment limited."}, "Special Studies: EECS": {"title": "Special Studies: EECS", "number": "6.S963-6.S967", "description": "Opportunity for study of graduate-level topics related to electrical engineering and computer science but not included elsewhere in the curriculum. Registration under this subject normally used for situations involving small study groups. Normal registration is for 12 units. Registration subject to approval of professor in charge.  Consult the department for details."}}