{"Introductory Biology": {"title": "Introductory Biology", "number": "7.016", "description": "Introduction to fundamental principles of biochemistry, molecular biology and genetics for understanding the functions of living systems. Covers examples of the use of chemical biology, the use of genetics in biological discovery, principles of cellular organization and communication, and engineering biological systems.  In addition, includes 21st-century molecular genetics in understanding human health and therapeutic intervention. Enrollment limited to seating capacity of classroom. Admittance may be controlled by lottery."}, "Introduction to Experimental Biology and Communication": {"title": "Introduction to Experimental Biology and Communication", "number": "7.02[J]", "description": "Introduction to the experimental concepts and methods of molecular biology, biochemistry, and genetic analysis. Emphasis on experimental design, critical data analysis, and the development of written communications skills. 12 units may be applied to the General Institute Laboratory Requirement. Enrollment limited."}, "Genetics": {"title": "Genetics", "number": "7.03", "description": "The principles of genetics with application to the study of biological function at the level of molecules, cells, and multicellular organisms, including humans. Structure and function of genes, chromosomes, and genomes. Biological variation resulting from recombination, mutation, and selection. Population genetics. Use of genetic methods to analyze protein function, gene regulation, and inherited disease."}, "General Biochemistry": {"title": "General Biochemistry", "number": "7.05", "description": "Contributions of biochemistry toward an understanding of the structure and functioning of organisms, tissues, and cells. Chemistry and functions of constituents of cells and tissues and the chemical and physical-chemical basis for the structures of nucleic acids, proteins, and carbohydrates. Basic enzymology and biochemical reaction mechanisms involved in macromolecular synthesis and degradation, signaling, transport, and movement. General metabolism of carbohydrates, fats, and nitrogen-containing materials such as amino acids, proteins, and related compounds."}, "Cell Biology": {"title": "Cell Biology", "number": "7.06", "description": "Presents the biology of cells of higher organisms. Studies the structure, function, and biosynthesis of cellular membranes and organelles; cell growth and oncogenic transformation; transport, receptors, and cell signaling; the cytoskeleton, the extracellular matrix, and cell movements; cell division and cell cycle; functions of specialized cell types. Emphasizes the current molecular knowledge of cell biological processes as well as the genetic, biochemical, and other experimental approaches that resulted in these discoveries."}, "Biological Chemistry II": {"title": "Biological Chemistry II", "number": "7.80", "description": "More advanced treatment of biochemical mechanisms that underlie biological processes. Topics include macromolecular machines such as the ribosome, the proteosome, fatty acid synthases as a paradigm for polyketide synthases and non-ribosomal polypeptide synthases, and polymerases. Emphasis is on experimental methods used to unravel these processes and how these processes fit into the cellular context and coordinate regulation.  Students taking the graduate version are expected to explore the subject in greater depth."}, "Quantitative and Computational Biology": {"title": "Quantitative and Computational Biology", "number": "7.09", "description": "Quantitative and computational analysis of biological systems at the molecular and cellular level.  Includes models of biological processes across different time scales, from steady-state to kinetics of gene expression, circadian clock, cell growth, and evolutionary dynamics. Methods include physical, systems, and synthetic biology. Also covers second-generation sequencing technologies, and topics in computational analysis of genomes, including sequence alignment, motif finding, information theory and RNA secondary structure prediction."}, "Laboratory in Molecular Biology": {"title": "Laboratory in Molecular Biology", "number": "7.102", "description": "Designed for first- and second-year students with little or no biology lab experience. Introduces basic methods of experimental molecular biology. Specific experiments vary from year-to-year, but will focus on the identification and characterization of bacteria from the wild using an array of basic methods in molecular biology and microbiology.  Biology GIR or Chemistry GIR recommended. Satisfies 6 units of Institute Laboratory credit. Limited to 24; admittance may be controlled by lottery."}, "Topics in Experimental Biology": {"title": "Topics in Experimental Biology", "number": "7.18", "description": "Independent experimental study under the direction of a member of the Biology Department faculty. Allows students with a strong interest in independent research to fulfill the project laboratory requirement for the Biology Department Program in the context of a research laboratory at MIT. The research must be conducted on the MIT campus and be a continuation of a previous 12-unit UROP project or full-time work over the summer. Written and oral presentation of the research results is required. Journal club discussions are used to help students evaluate and write scientific papers. Instruction and practice in written and oral communication is provided. Permission of the faculty research supervisor and the Biology Education Office must be obtained in advance."}, "Communication in Experimental Biology": {"title": "Communication in Experimental Biology", "number": "7.19", "description": "Students carry out independent literature research. Meets with the seminar and writing tutorial portions of 7.18. Journal club discussions are used to help students evaluate and write scientific papers. Instruction and practice in written and oral communication is provided. Permission of the instructor and the Biology Education Office must be obtained in advance."}, "Human Physiology": {"title": "Human Physiology", "number": "7.20[J]", "description": "Comprehensive exploration of human physiology, emphasizing the molecular basis and applied aspects of organ function and regulation in health and disease. Includes a review of cell structure and function, as well as the mechanisms by which the endocrine and nervous systems integrate cellular metabolism. Special emphasis on examining the cardiovascular, pulmonary, gastrointestinal, and renal systems, as well as liver function, drug metabolism, and pharmacogenetics."}, "Microbial Physiology": {"title": "Microbial Physiology", "number": "7.62", "description": "Biochemical properties of bacteria and other microorganisms that enable them to grow under a variety of conditions. Interaction between bacteria and bacteriophages. Genetic and metabolic regulation of enzyme action and enzyme formation. Structure and function of components of the bacterial cell envelope. Protein secretion with a special emphasis on its various roles in pathogenesis. Additional topics include bioenergetics, symbiosis, quorum sensing, global responses to DNA damage, and biofilms. Students taking the graduate version are expected to explore the subject in greater depth."}, "Developmental Biology": {"title": "Developmental Biology", "number": "7.22", "description": "Topics include development of animal body plans, tissue patterning, cell type determination, organogenesis, morphogenesis, stem cells, and the evolution of developmental diversity and processes. Covers experimental approaches to problems of development and evolution, such as the study of vertebrate (mouse, chick, frog, fish) and invertebrate (fly, worm) models."}, "Immunology": {"title": "Immunology", "number": "7.63[J]", "description": "Comprehensive survey of molecular, genetic, and cellular aspects of the immune system. Topics include innate and adaptive immunity; cells and organs of the immune system; hematopoiesis; immunoglobulin, T cell receptor, and major histocompatibility complex (MHC) proteins and genes; development and functions of B and T lymphocytes; immune responses to infections and tumors; hypersensitivity, autoimmunity, and immunodeficiencies. Particular attention to the development and function of the immune system as a whole, as studied by modern methods and techniques. Students taking graduate version explore the subject in greater depth, including study of recent primary literature."}, "Molecular Basis of Infectious Disease": {"title": "Molecular Basis of Infectious Disease", "number": "7.66", "description": "Focuses on the principles of host-pathogen interactions with an emphasis on infectious diseases of humans. Presents key concepts of pathogenesis through the study of various human pathogens. Includes critical analysis and discussion of assigned readings. Students taking the graduate version are expected to explore the subject in greater depth."}, "Principles of Human Disease": {"title": "Principles of Human Disease", "number": "7.27", "description": "Covers current understanding of and modern approaches to human disease, emphasizing the molecular and cellular basis of both genetic disease and cancer. Topics include the genetics of simple and complex traits; karyotypic analysis and positional cloning; genetic diagnosis; the roles of oncogenes and tumor suppressors in tumor initiation, progression, and treatment; the interaction between genetics and environment; animal models of human disease; cancer; aging and disease; and conventional and gene therapy treatment strategies."}, "Molecular Biology": {"title": "Molecular Biology", "number": "7.58", "description": "Detailed analysis of the biochemical mechanisms that control the maintenance, expression, and evolution of prokaryotic and eukaryotic genomes. Topics covered in lecture and readings of relevant literature include: gene regulation, DNA replication, genetic recombination, and mRNA translation. Logic of experimental design and data analysis emphasized. Presentations include both lectures and group discussions of representative papers from the literature. Students taking the graduate version are expected to explore the subject in greater depth."}, "Cellular and Molecular Neurobiology": {"title": "Cellular and Molecular Neurobiology", "number": "7.29[J]", "description": "Introduction to the structure and function of the nervous system. Emphasizes the cellular properties of neurons and other excitable cells. Includes the structure and biophysical properties of excitable cells, synaptic transmission, neurochemistry, neurodevelopment, integration of information in simple systems, and detection and information coding during sensory transduction."}, "Fundamentals of Ecology I": {"title": "Fundamentals of Ecology I", "number": "7.30A[J]", "description": "Fundamentals of ecology, considering Earth as an integrated dynamic living system. Coevolution of the biosphere and geosphere, biogeochemical cycles, metabolic diversity, primary productivity, competition and the niche, trophic dynamics and food webs, population growth and limiting factors. Combination of 1.018A and 1.018B counts as REST subject."}, "Current Topics in Mammalian Biology: Medical Implications": {"title": "Current Topics in Mammalian Biology: Medical Implications", "number": "7.31", "description": "Covers recent advances in mammalian cell and developmental biology with particular emphasis on approaches that utilize mouse genetics. Combines formal lectures on selected topics with readings of original papers which are discussed in class. Major emphasis on the implications of mechanisms of human genetic diseases. Topics include early mammalian development; genomic imprinting; X inactivation; embryonic stem cells; nuclear reprogramming of somatic cells; cell migration; nervous system development; and central nervous system degenerative diseases such as Alzheimer's and Huntington's disease. Limited to 20."}, "Systems Biology": {"title": "Systems Biology", "number": "7.81[J]", "description": "Introduction to cellular and population-level systems biology with an emphasis on synthetic biology, modeling of genetic networks, cell-cell interactions, and evolutionary dynamics.  Cellular systems include genetic switches and oscillators, network motifs, genetic network evolution, and cellular decision-making.  Population-level systems include models of pattern formation, cell-cell communication, and evolutionary systems biology. Students taking graduate version explore the subject in more depth."}, "Evolutionary Biology:  Concepts, Models and Computation": {"title": "Evolutionary Biology:  Concepts, Models and Computation", "number": "7.33[J]", "description": "Explores and illustrates how evolution explains biology, with an emphasis on computational model building for analyzing evolutionary data.  Covers key concepts of biological evolution, including adaptive evolution, neutral evolution, evolution of sex, genomic conflict, speciation, phylogeny and comparative methods, life's history, coevolution, human evolution, and evolution of disease."}, "Advanced Undergraduate Seminar": {"title": "Advanced Undergraduate Seminar", "number": "7.345-7.349", "description": "Seminars covering topics of current interest in biology with a focus on how to understand experimental methods and design and how to critically read the primary research literature. Small class size facilitates discussions and interactions with an active research scientist. Students visit research laboratories to see firsthand how biological research is conducted. Contact Biology Education Office for topics."}, "Molecular and Engineering Aspects of Biotechnology": {"title": "Molecular and Engineering Aspects of Biotechnology", "number": "7.37[J]", "description": "Covers biological and bioengineering principles underlying the development and therapeutic use of recombinant proteins and stem cells; glycoengineering of recombinant proteins; normal and pathological signaling by growth factors and their receptors; receptor trafficking; monoclonal antibodies as therapeutics; protein pharmacology and delivery; stem cell-derived tissues as therapeutics; RNA therapeutics; combinatorial protein engineering; and new antitumor drugs."}, "Biological and Engineering Principles Underlying Novel Biotherapeutics": {"title": "Biological and Engineering Principles Underlying Novel Biotherapeutics", "number": "7.371", "description": "Covers biological and bioengineering principles underlying the development and therapeutic use of recombinant proteins and immune cells. Special attention to monoclonal antibodies and engineered immune system cells as therapeutics; protein- and glyco- engineering to enhance protein function; protein pharmacology and delivery; nucleic acid- based biotherapeutics; generation of functional cells and tissues from embryonic stem cells and iPS cells; and immune cell-cancer cell interactions in cancer immunotherapy."}, "Principles of Chemical Biology": {"title": "Principles of Chemical Biology", "number": "7.73", "description": "Spanning the fields of biology, chemistry and engineering, class addresses the principles of chemical biology and its application of chemical and physical methods and reagents to the study and manipulation of biological systems. Topics include bioorthogonal reactions and activity-based protein profiling, small molecule inhibitors and chemical genetics, fluorescent probes for biological studies, and unnatural amino acid mutagenesis. Also covers chemical biology approaches for studying dynamic post-translational modification reactions, natural product biosynthesis and mutasynthesis, and high-throughput drug screening.  Students taking the graduate version are expected to explore the subject in greater depth."}, "The Hallmarks of Cancer": {"title": "The Hallmarks of Cancer", "number": "7.85", "description": "Provides a comprehensive introduction to the fundamentals of cancer biology and cancer treatment. Topics include cancer genetics, genomics, and epigenetics; familial cancer syndromes; signal transduction, cell cycle control, and apoptosis; cancer metabolism; stem cells and cancer; metastasis; cancer immunology and immunotherapy; conventional and molecularly-targeted therapies; and early detection and prevention. Students taking graduate version complete additional assignments."}, "Advances in Biomanufacturing": {"title": "Advances in Biomanufacturing", "number": "7.548[J]", "description": "Seminar examines how biopharmaceuticals, an increasingly important class of pharmaceuticals, are manufactured. Topics range from fundamental bioprocesses to new technologies to the economics of biomanufacturing. Also covers the impact of globalization on regulation and quality approaches as well as supply chain integrity. Students taking graduate version complete additional assignments."}, "Developmental Neurobiology": {"title": "Developmental Neurobiology", "number": "7.69[J]", "description": "Considers molecular control of neural specification, formation of neuronal connections, construction of neural systems, and the contributions of experience to shaping brain structure and function. Topics include: neural induction and pattern formation, cell lineage and fate determination, neuronal migration, axon guidance, synapse formation and stabilization, activity-dependent development and critical periods, development of behavior. In addition to final exam, analysis and presentation of  research papers required for final grade. Students taking graduate version complete additional assignments. Students taking graduate version complete additional readings that will be addressed in their mid-term and final exams."}, "An Introduction to Mathematical Ecology": {"title": "An Introduction to Mathematical Ecology", "number": "7.440", "description": "Covers the basic models of population growth, demography, population interaction (competition, predation, mutualism), food webs, harvesting, and infectious disease, and the mathematical tools required for their analysis. Because these tools are also basic to the analysis of models in biochemistry, physiology, and behavior, subject also broadly relevant to students whose interests are not limited to ecological problems."}, "Biological Oceanography": {"title": "Biological Oceanography", "number": "7.470", "description": "Intended for students with advanced training in biology. Intensive overview of biological oceanography. Major paradigms discussed, and dependence of biological processes in the ocean on physical and chemical aspects of the environment examined. Surveys the diversity of marine habitats, major groups of taxa inhabiting those habitats, and the general biology of the various taxa: the production and consumption of organic material in the ocean, as well as factors controlling those processes. Species diversity, structure of marine food webs, and the flow of energy within different marine habitats are detailed and contrasted."}, "Research Rotations in Microbiology": {"title": "Research Rotations in Microbiology", "number": "7.499", "description": "Introduces students to faculty participating in the interdepartmental Microbiology graduate program through a series of three lab rotations, which provide broad exposure to microbiology research at MIT. Students select a lab for thesis research by the end of their first year. Given the interdisciplinary nature of the program and the many research programs available, students may be able to work jointly with more than one research supervisor. Limited to students in the Microbiology graduate program."}, "Method and Logic in Molecular Biology": {"title": "Method and Logic in Molecular Biology", "number": "7.50", "description": "Logic, experimental design and methods in biology, using discussions of the primary literature to discern the principles of biological investigation in making discoveries and testing hypotheses. In collaboration with faculty, students also apply those principles to generate a potential research project, presented in both written and oral form. Limited to Course 7 graduate students."}, "Frontiers in Chemical Biology": {"title": "Frontiers in Chemical Biology", "number": "7.540[J]", "description": "Introduction to current research at the interface of chemistry, biology, and bioengineering. Topics include imaging of biological processes, metabolic pathway engineering, protein engineering, mechanisms of DNA damage, RNA structure and function, macromolecular machines, protein misfolding and disease, metabolomics, and methods for analyzing signaling network dynamics. Lectures are interspersed with class discussions and student presentations based on current literature."}, "Science and Business of Biotechnology": {"title": "Science and Business of Biotechnology", "number": "7.546[J]", "description": "Covers the new types of drugs and other therapeutics in current practice and under development, the financing and business structures of early-stage biotechnology companies, and the evaluation of their risk/reward profiles. Includes a series of live case studies with industry leaders of both established and emerging biotechnology companies as guest speakers, focusing on the underlying science and engineering as well as core financing and business issues. Students must possess a basic background in cellular and molecular biology."}, "Principles and Practice of Drug Development": {"title": "Principles and Practice of Drug Development", "number": "7.547[J]", "description": "Description and critical assessment of the major issues and stages of developing a pharmaceutical or biopharmaceutical. Drug discovery, preclinical development, clinical investigation, manufacturing and regulatory issues considered for small and large molecules. Economic and financial considerations of the drug development process. Multidisciplinary perspective from faculty in clinical; life; and management sciences; as well as industry guests."}, "Case Studies and Strategies in Drug Discovery and Development": {"title": "Case Studies and Strategies in Drug Discovery and Development", "number": "7.549[J]", "description": "Aims to develop appreciation for the stages of drug discovery and development, from target identification, to the submission of preclinical and clinical data to regulatory authorities for marketing approval. Following introductory lectures on the process of drug development, students working in small teams analyze how one of four new drugs or drug candidates traversed the discovery/development landscape. For each case, an outside expert from the sponsoring drug company or pivotal clinical trial principal investigator provides guidance and critiques the teams' presentations to the class."}, "Case Studies in Modern Experimental Design": {"title": "Case Studies in Modern Experimental Design", "number": "7.55", "description": "Focuses on enhancing students' ability to analyze, design and present experiments, emphasizing modern techniques. Class discussions begin with papers that developed or utilized contemporary approaches (e.g., quantitative microscopy, biophysical and molecular genetic methods) to address important problems in biology. Each student prepares one specific aim of a standard research proposal for a project that emphasizes research strategy, experimental design, and writing."}, "Quantitative Biology for Graduate Students": {"title": "Quantitative Biology for Graduate Students", "number": "7.57", "description": "Introduces the fundamental concepts and tools of quantitative approaches to molecular and cellular biology. Covers a wide range of mathematical, computational, and statistical methods, although no previous expertise in these areas is required. Focuses on understanding quantitative approaches through the analysis of particular problems and examples drawn from classical genetics, molecular biology, cell biology, genomics, and systems biology."}, "Teaching College-Level Science and Engineering": {"title": "Teaching College-Level Science and Engineering", "number": "7.59[J]", "description": "Participatory seminar focuses on the knowledge and skills necessary for teaching science and engineering in higher education. Topics include theories of adult learning; course development; promoting active learning, problemsolving, and critical thinking in students; communicating with a diverse student body; using educational technology to further learning; lecturing; creating effective tests and assignments; and assessment and evaluation. Students research and present a relevant topic of particular interest. Appropriate for both novices and those with teaching experience."}, "Cell Biology: Structure and Functions of the Nucleus": {"title": "Cell Biology: Structure and Functions of the Nucleus", "number": "7.60", "description": "Eukaryotic genome structure, function, and expression, processing of RNA, and regulation of the cell cycle. Emphasis on the techniques and logic used to address important problems in nuclear cell biology. Lectures on broad topic areas in nuclear cell biology and discussions on representative recent papers."}, "Eukaryotic Cell Biology: Principles and Practice": {"title": "Eukaryotic Cell Biology: Principles and Practice", "number": "7.61", "description": "Emphasizes methods and logic used to analyze structure and function of eukaryotic cells in diverse systems (e.g., yeast, fly, worm, mouse, human; development, stem cells, neurons). Combines lectures and in-depth roundtable discussions of literature readings with the active participation of faculty experts. Focuses on membranes (structure, function, traffic), organelles, the cell surface, signal transduction, cytoskeleton, cell motility and extracellular matrix. Ranges from basic studies to applications to human disease, while stressing critical analysis of experimental approaches. Enrollment limited."}, "Molecular Mechanisms, Pathology and Therapy of Human Neuromuscular Disorders": {"title": "Molecular Mechanisms, Pathology and Therapy of Human Neuromuscular Disorders", "number": "7.64", "description": "Investigates the molecular and clinical basis of central nervous system and neuromuscular disorders with particular emphasis on strategies for therapeutic intervention. Considers the in-depth analysis of clinical features, pathological mechanisms, and responses to current therapeutic interventions. Covers neurodegenerative diseases, such as Huntington's disease, Parkinson's disease, Alzheimer's disease, Amyotropic Lateral Schlerosis, Frontal Temporal Dementia, and neuromuscular disorders, such as Myotonic Dystrophy, Facio Scapular Humoral Dystrophy, and Duchenne Muscular Dystrophy."}, "Molecular and Cellular Neuroscience Core I": {"title": "Molecular and Cellular Neuroscience Core I", "number": "7.65[J]", "description": "Survey and primary literature review of major topic areas in molecular and cellular neurobiology. Covers neurogenomics, nervous system formation, axonal pathfinding, cytoskeletal regulation, synapse formation, neurotransmitter release, and cellular neurophysiology. Includes lectures and weekly paper write-ups, together with student presentations and discussion of primary literature. A final two-page research write-up is also due at the end of the term."}, "Molecular and Cellular Neuroscience Core II": {"title": "Molecular and Cellular Neuroscience Core II", "number": "7.68[J]", "description": "Survey and primary literature review of major areas in molecular and cellular neurobiology. Covers genetic neurotrophin signaling, adult neurogenesis, G-protein coupled receptor signaling, glia function, epigenetics, neuronal and homeostatic plasticity, neuromodulators of circuit function, and neurological/psychiatric disease mechanisms. Includes lectures and exams, and involves presentation and discussion of primary literature. 9.015 recommended, though the core subjects can be taken in any sequence."}, "Regulation of Gene Expression": {"title": "Regulation of Gene Expression", "number": "7.70", "description": "Seminar examines basic principles of biological regulation of gene expression. Focuses on examples that underpin these principles, as well as those that challenge certain long-held views. Topics covered may include the role of transcription factors, enhancers, DNA modifications, non-coding RNAs, and chromatin structure in the regulation of gene expression and mechanisms for epigenetic inheritance of transcriptional states. Limited to 40."}, "Structural and Biophysical Analysis of Biological Macromolecules": {"title": "Structural and Biophysical Analysis of Biological Macromolecules", "number": "7.71", "description": "Studies theory and practice of 3-D analysis of macromolecules, using X-ray crystallography and EM analysis. Covers biophysical methods to characterize molecular properties and interactions. Includes discussion of current literature and, importantly, practical exercises in crystallization, model building, and the use of shared instrumentation available at MIT. Meets with 5.78 when offered concurrently."}, "Stem Cells, Regeneration, and Development": {"title": "Stem Cells, Regeneration, and Development", "number": "7.72", "description": "Topics include diverse stem cells, such as muscle, intestine, skin, hair and hematopoietic stem cells, as well as pluripotent stem cells. Topics address cell polarity and cell fate; positional information and patterning of development and regeneration; limb, heart and whole body regeneration; stem cell renewal; progenitor cells in development; responses to wounding; and applications of stem cells in development of therapies. Discussions of papers supplement lectures."}, "Topics in Biophysics and Physical Biology": {"title": "Topics in Biophysics and Physical Biology", "number": "7.74[J]", "description": "Provides broad exposure to research in biophysics and physical biology, with emphasis on the critical evaluation of scientific literature. Weekly meetings include in-depth discussion of scientific literature led by distinct faculty on active research topics. Each session also includes brief discussion of non-research topics including effective presentation skills, writing papers and fellowship proposals, choosing scientific and technical research topics, time management, and scientific ethics."}, "Nucleic Acids, Structure, Function, Evolution and Their Interactions with Proteins": {"title": "Nucleic Acids, Structure, Function, Evolution and Their Interactions with Proteins", "number": "7.77", "description": "Surveys primary literature, focusing on biochemical, biophysical, genetic, and combinatorial approaches for understanding nucleic acids.  Topics include the general properties, functions, and structural motifs of DNA and RNA; RNAs as catalysts and as regulators of gene expression; RNA editing and surveillance, and the interaction of nucleic acids with proteins, such as zinc-finger proteins, modification enzymes, aminoacyl-tRNA synthetases and other proteins of the translational machinery. Includes some lectures but is mostly analysis and discussion of current literature in the context of student presentations."}, "Topics in Computational and Systems Biology": {"title": "Topics in Computational and Systems Biology", "number": "7.89[J]", "description": "Seminar based on research literature. Papers covered are selected to illustrate important problems and varied approaches in the field of computational and systems biology, and to provide students a framework from which to evaluate new developments. Preference to first-year CSB PhD students."}, "Research Experience in Biopharma": {"title": "Research Experience in Biopharma", "number": "7.930[J]", "description": "Provides exposure to industrial science and develops skills necessary for success in such an environment. Under the guidance of an industrial mentor, students participate in on-site research at a local biopharmaceutical company where they observe and participate in industrial science. Serves as a real-time case study to internalize the factors that shape R&D in industry, including the purpose and scope of a project, key decision points in the past and future, and strategies for execution. Students utilize company resources and work with a scientific team to contribute to the goals of their assigned project; they then present project results to the company and class, emphasizing the logic that dictated their work and their ideas for future directions. Lecture component focuses on professional development."}, "Research Rotations in Biology": {"title": "Research Rotations in Biology", "number": "7.933", "description": "Introduces students to faculty participating in the Biology graduate program through a series of lab rotations, which provide broad exposure to biology research at MIT. Students select a lab for thesis research by the end of their first year. Limited to students in the Biology graduate program."}, "Responsible Conduct in Biology": {"title": "Responsible Conduct in Biology", "number": "7.935", "description": "Sessions focus on the responsible conduct of science. Considers recordkeeping and reporting; roles of mentor and mentee; authorship, review, and confidentiality; resolving conflicts; misfeasance and malfeasance; collaborations, competing interests, and intellectual property; and proper practices in the use of animal and human subjects. Limited to second-year graduate students in Biology."}, "Cancer Biology": {"title": "Cancer Biology", "number": "7.95", "description": "Advanced seminar involving intensive analysis of historical and current developments in cancer biology. Topics address principles of apoptosis, principles of cancer biology, cancer genetics, cancer cell metabolism, tumor immunology, and therapy. Detailed analysis of research literature, including important reports published in recent years. Enrollment limited."}, "Neural Plasticity in Learning and Memory": {"title": "Neural Plasticity in Learning and Memory", "number": "7.98[J]", "description": "Examination of the role of neural plasticity during learning and memory of invertebrates and mammals. Detailed critical analysis of the current literature of molecular, cellular, genetic, electrophysiological, and behavioral studies. Student-directed presentations and discussions of original papers supplemented by introductory lectures. Juniors and seniors require instructor's permission."}}