{"Introduction to Psychological Science": {"title": "Introduction to Psychological Science", "number": "9.00", "description": "A survey of the scientific study of human nature, including how the mind works, and how the brain supports the mind.  Topics include the mental and neural bases of perception, emotion, learning, memory, cognition, child development, personality, psychopathology, and social interaction.  Consideration of how such knowledge relates to debates about nature and nurture, free will, consciousness, human differences, self, and society."}, "Systems Neuroscience": {"title": "Systems Neuroscience", "number": "9.011", "description": "Survey of brain and behavioral studies. Examines principles underlying the structure and function of the nervous system, with a focus on systems approaches. Topics include development of the nervous system and its connections, sensory systems of the brain, the motor system, higher cortical functions, and behavioral and cellular analyses of learning and memory. Preference to first-year graduate students in BCS."}, "Molecular and Cellular Neuroscience Core II": {"title": "Molecular and Cellular Neuroscience Core II", "number": "9.013[J]", "description": "Survey and primary literature review of major areas in molecular and cellular neurobiology. Covers genetic neurotrophin signaling, adult neurogenesis, G-protein coupled receptor signaling, glia function, epigenetics, neuronal and homeostatic plasticity, neuromodulators of circuit function, and neurological/psychiatric disease mechanisms. Includes lectures and exams, and involves presentation and discussion of primary literature. 9.015 recommended, though the core subjects can be taken in any sequence."}, "Quantitative Methods and Computational Models in Neurosciences": {"title": "Quantitative Methods and Computational Models in Neurosciences", "number": "9.014", "description": "Provides theoretical background and practical skills needed to analyze and model neurobiological observations at the molecular, systems and cognitive levels. Develops an intuitive understanding of mathematical tools and computational techniques which students apply to analyze, visualize and model research data using MATLAB programming. Topics include linear systems and operations, dimensionality reduction (e.g., PCA), Bayesian approaches, descriptive and generative models, classification and clustering, and dynamical systems. Limited to 18; priority to current BCS Graduate students"}, "Molecular and Cellular Neuroscience Core I": {"title": "Molecular and Cellular Neuroscience Core I", "number": "9.015[J]", "description": "Survey and primary literature review of major topic areas in molecular and cellular neurobiology. Covers neurogenomics, nervous system formation, axonal pathfinding, cytoskeletal regulation, synapse formation, neurotransmitter release, and cellular neurophysiology. Includes lectures and weekly paper write-ups, together with student presentations and discussion of primary literature. A final two-page research write-up is also due at the end of the term."}, "Acoustics, Production and Perception of Speech": {"title": "Acoustics, Production and Perception of Speech", "number": "9.016[J]", "description": "Reviews the physical processes involved in the production and propagation of sound, and acoustics related to hearing.  Particular attention to how the acoustics and mechanics of the speech and auditory system define what sounds we are capable of producing and how we sense sound. Introduces acoustic theory of speech production, digital speech processing, and neural mechanisms of speech production and perception. Exposes students to applications around acoustics, recognition, and speech disorders. Also introduces analysis of various types of sounds. Includes take-home laboratory assignments and discussions of classic papers."}, "Neural Mechanisms of Cognitive Computations": {"title": "Neural Mechanisms of Cognitive Computations", "number": "9.017", "description": "Focuses on forebrain systems that are most closely associated with cognition (cortex, thalamus, and basal ganglia) as well as on describing neural circuits as parametric objects that are hierarchical in nature, and whose operations can have biophysical interpretations. Uses parametric behavior to discover circuit parameters and define circuit form in a cognitive context. Divided into five modules in the following order: sensory systems, motor systems, associative systems (memory and decision making), basal ganglia loops, and single neuron computations (dendritic integration, plasticity rules). Discusses biophysical mechanisms in the first half of the term and problem sets/student-led discussions in the second half."}, "Cellular Neurophysiology and Computing": {"title": "Cellular Neurophysiology and Computing", "number": "9.21[J]", "description": "Integrated overview of the biophysics of cells from prokaryotes to neurons, with a focus on mass transport and electrical signal generation across cell membrane. First third of course focuses on mass transport through membranes: diffusion, osmosis, chemically mediated, and active transport. Second third focuses on electrical properties of cells: ion transport to action potential generation and propagation in electrically excitable cells. Synaptic transmission. Electrical properties interpreted via kinetic and molecular properties of single voltage-gated ion channels. Final third focuses on biophysics of synaptic transmission and introduction to neural computing. Laboratory and computer exercises illustrate the concepts. Students taking graduate version complete different assignments. Preference to juniors and seniors."}, "Sensory Systems": {"title": "Sensory Systems", "number": "9.04", "description": "Examines the neural bases of sensory perception. Focuses on physiological and anatomical studies of the mammalian nervous system as well as behavioral studies of animals and humans. Topics include visual pattern, color and depth perception, auditory responses and sound localization, olfactory and somatosensory perception."}, "Statistics for Brain and Cognitive Science": {"title": "Statistics for Brain and Cognitive Science", "number": "9.07", "description": "Provides students with the basic tools for analyzing experimental data, properly interpreting statistical reports in the literature, and reasoning under uncertain situations. Topics organized around three key theories: probability, statistical, and the linear model. Probability theory covers axioms of probability, discrete and continuous probability models, law of large numbers, and the Central Limit Theorem. Statistical theory covers estimation, likelihood theory, Bayesian methods, bootstrap and other Monte Carlo methods, as well as hypothesis testing, confidence intervals, elementary design of experiments principles and goodness-of-fit. The linear model theory covers the simple regression model and the analysis of variance. Places equal emphasis on theory, data analyses, and simulation studies."}, "Statistics for Neuroscience Research": {"title": "Statistics for Neuroscience Research", "number": "9.073[J]", "description": "A survey of statistical methods for neuroscience research. Core topics include introductions to the theory of point processes, the generalized linear model, Monte Carlo methods, Bayesian methods, multivariate methods, time-series analysis, spectral analysis and state-space modeling. Emphasis on developing a firm conceptual understanding of the statistical paradigm and statistical methods primarily through analyses of actual experimental data."}, "Cellular and Molecular Neurobiology": {"title": "Cellular and Molecular Neurobiology", "number": "9.09[J]", "description": "Introduction to the structure and function of the nervous system. Emphasizes the cellular properties of neurons and other excitable cells. Includes the structure and biophysical properties of excitable cells, synaptic transmission, neurochemistry, neurodevelopment, integration of information in simple systems, and detection and information coding during sensory transduction."}, "Cognitive Neuroscience": {"title": "Cognitive Neuroscience", "number": "9.10", "description": "Explores the cognitive and neural processes that support attention, vision, language, social cognition, music understanding, emotion, motor control, and memory. Begins with the fundamental behavioral phenomena, then progresses to models based on brain systems in humans and animals, and ultimately models based on populations of neurons. Includes examples of clinical conditions and case studies in patients. Students prepare presentations summarizing journal articles."}, "Nonlinear Control": {"title": "Nonlinear Control", "number": "9.110[J]", "description": "Introduction to nonlinear control and estimation in physical and biological systems. Nonlinear stability theory, Lyapunov analysis, Barbalat's lemma. Feedback linearization, differential flatness, internal dynamics. Sliding surfaces. Adaptive nonlinear control and estimation. Multiresolution bases, nonlinear system identification. Contraction analysis, differential stability theory. Nonlinear observers. Asynchronous distributed computation and learning. Concurrent synchronization, polyrhythms. Monotone nonlinear systems. Emphasizes application to physical systems (robots, aircraft, spacecraft, underwater vehicles, reaction-diffusion processes, machine vision, oscillators, internet), machine learning, computational neuroscience, and systems biology. Includes term projects."}, "Experimental Molecular Neurobiology": {"title": "Experimental Molecular Neurobiology", "number": "9.12", "description": "Experimental techniques in cellular and molecular neurobiology. Designed for students without previous experience in techniques of cellular and molecular biology. Experimental approaches include DNA manipulation, molecular cloning, protein biochemistry, dissection and culture of brain cells, synaptic protein analysis, immunocytochemistry, and fluorescent microscopy. One lab session plus one paper review session per week. Instruction and practice in written communication provided. Limited to 22 due to lab capacity."}, "Neurotechnology in Action": {"title": "Neurotechnology in Action", "number": "9.123[J]", "description": "Offers a fast-paced introduction to numerous laboratory methods at the forefront of modern neurobiology. Comprises a sequence of modules focusing on neurotechnologies that are developed and used by MIT research groups. Each module consists of a background lecture and 1-2 days of firsthand laboratory experience. Topics typically include optical imaging, optogenetics, high throughput neurobiology, MRI/fMRI, advanced electrophysiology, viral and genetic tools, and connectomics."}, "The Human Brain": {"title": "The Human Brain", "number": "9.13", "description": "Surveys the core perceptual and cognitive abilities of the human mind and asks how these are implemented in the brain. Key themes include the functional organization of the cortex, as well as the representations and computations, developmental origins, and degree of functional specificity of particular cortical regions. Emphasizes the methods available in human cognitive neuroscience, and what inferences can and cannot be drawn from each."}, "Brain Structure and its Origins": {"title": "Brain Structure and its Origins", "number": "9.14", "description": "Provides an introduction to functional neuroanatomy with a focus on mammals, aided by studies of comparative neuroanatomy and evolution and of brain development. Topics include early steps to a central nervous system, basic patterns of brain and spinal cord connections, regional development and differentiation, regeneration, motor and sensory pathways and structures, systems underlying motivations, innate action patterns, formation of habits, and various cognitive functions. Review of lab techniques. Optional brain dissections."}, "Neural Circuits, Neuromodulatory, and Neuroendocrine Systems": {"title": "Neural Circuits, Neuromodulatory, and Neuroendocrine Systems", "number": "9.15", "description": "Studies how neural circuits give rise to behavior, and how neuromodulatory systems and pharmacological intervention can influence these processes. Lectures and selected publications cover the fundamentals of neuropharmacology, neuromodulatory systems, and approaches to understand circuit mechanisms. Provides a historical view of various neurotransmitter or neuromodulatory systems as well as an understanding of how research is conducted at the forefront of neuroscience today. Instruction and practice in oral and written communication provided. Students present a primary research article and also submit a research proposal which they have the opportunity to revise based on feedback."}, "Cellular and Synaptic Neurophysiology": {"title": "Cellular and Synaptic Neurophysiology", "number": "9.160", "description": "Surveys the mechanisms of neuronal communication. Covers ion channels in excitable membrane, single cell computation, synaptic transmission, and synaptic plasticity. Correlates the properties of ion channels and synaptic transmission with their physiological function. Discusses the organizational principles for the formation of functional neural networks at synaptic and cellular levels. Involves discussion of primary literature.  Students taking graduate version complete additional assignments."}, "Systems Neuroscience Laboratory": {"title": "Systems Neuroscience Laboratory", "number": "9.17", "description": "Consists of a series of laboratories designed to give students experience with basic techniques for conducting systems neuroscience research. Includes sessions on anatomical, neurophysiological, and data acquisition and analysis techniques, and how these techniques are used to study nervous system function. Involves the use of experimental animals. Assignments include weekly preparation for lab sessions, two major lab reports and a series of basic computer programming tutorials (MATLAB). Instruction and practice in written communication provided. Enrollment limited."}, "Robotics": {"title": "Robotics", "number": "9.175[J]", "description": "Dynamic analysis, design, and control of robots. Forward and inverse kinematics and dynamics of multi-input, multi-output rigid body systems. Computed torque control. Adaptive control. System identification. Force feedback, adaptive visual servoing. Task planning, teleoperation. Elements of biological planning and control. Motor primitives, entrainment, locomotion, active sensing, binding models. Term projects."}, "Developmental Neurobiology": {"title": "Developmental Neurobiology", "number": "9.18[J]", "description": "Considers molecular control of neural specification, formation of neuronal connections, construction of neural systems, and the contributions of experience to shaping brain structure and function. Topics include: neural induction and pattern formation, cell lineage and fate determination, neuronal migration, axon guidance, synapse formation and stabilization, activity-dependent development and critical periods, development of behavior. Students taking graduate version complete additional readings that will be addressed in their mid-term and final exams."}, "Computational Psycholinguistics": {"title": "Computational Psycholinguistics", "number": "9.190", "description": "Introduces computational approaches to natural language processing and acquisition by humans and machines, combining symbolic and probabilistic modeling techniques. Covers models such as n-grams, finite state automata, and context-free and mildly context-sensitive grammars, for analyzing phonology, morphology, syntax, semantics, pragmatics, and larger document structure. Applications range from accurate document classification and sentence parsing by machine to modeling human language acquisition and real-time understanding. Covers both theory and contemporary computational tools and datasets. Students taking graduate version complete additional assignments."}, "Animal Behavior": {"title": "Animal Behavior", "number": "9.20", "description": "Reviews studies of animal behavior to stress major ideas and principles, with emphasis on concepts developed in ethology and sociobiology. Examines foraging and feeding, defensive and aggressive behavior, courtship and reproduction, migration and navigation, as well as various social activities and communication. Considers inherited abilities, motivational systems and motor patterns, together with influences of various types of learning. Reviews both field and laboratory studies, and considers human behavior in the context of primate studies."}, "Disorders and Diseases of the Nervous System": {"title": "Disorders and Diseases of the Nervous System", "number": "9.24", "description": "Topics examined include regional functional anatomy of the CNS; brain systems and circuits; neurodevelopmental disorders including autism; neuropsychiatric disorders such as schizophrenia; neurodegenerative diseases such as Parkinson's and Alzheimer's; autoimmune disorders such as multiple sclerosis; gliomas. Emphasis on diseases for which a molecular mechanism is understood. Diagnostic criteria, clinical and pathological findings, genetics, model systems, pathophysiology, and treatment are discussed for individual disorders and diseases. Limited to 18."}, "Principles and Applications of Genetic Engineering for Biotechnology and Neuroscience": {"title": "Principles and Applications of Genetic Engineering for Biotechnology and Neuroscience", "number": "9.26[J]", "description": "Covers principles underlying current and future genetic engineering approaches, ranging from single cellular organisms to whole animals. Focuses on development and invention of technologies for engineering biological systems at the genomic level, and applications of engineered biological systems for medical and biotechnological needs, with particular emphasis on genetic manipulation of the nervous system. Design projects by students."}, "Topics in Neural Signal Processing": {"title": "Topics in Neural Signal Processing", "number": "9.272[J]", "description": "Presents signal processing and statistical methods used to study neural systems and analyze neurophysiological data. Topics include state-space modeling formulated using the Bayesian Chapman-Kolmogorov system, theory of point processes, EM algorithm, Bayesian and sequential Monte Carlo methods. Applications include dynamic analyses of neural encoding, neural spike train decoding, studies of neural receptive field plasticity, algorithms for neural prosthetic control, EEG and MEG source localization. Students should know introductory probability theory and statistics."}, "Current Topics in Developmental Neurobiology": {"title": "Current Topics in Developmental Neurobiology", "number": "9.28", "description": "Considers recent advances in the field of developmental neurobiology based on primary research articles that address molecular control of neural specification, formation of neuronal connections, construction of neural systems, and the contributions of experience to shaping brain structure and function. Also considers new techniques and methodologies as applied to the field. Students critically analyze articles and prepare concise and informative presentations based on their content. Instruction and practice in written and oral communication provided. Requires class participation, practice sessions, and presentations."}, "Neural Plasticity in Learning and Memory": {"title": "Neural Plasticity in Learning and Memory", "number": "9.301[J]", "description": "Examination of the role of neural plasticity during learning and memory of invertebrates and mammals. Detailed critical analysis of the current literature of molecular, cellular, genetic, electrophysiological, and behavioral studies. Student-directed presentations and discussions of original papers supplemented by introductory lectures. Juniors and seniors require instructor's permission."}, "Neurobiology of Learning and Memory": {"title": "Neurobiology of Learning and Memory", "number": "9.31", "description": "Surveys the mechanisms supporting plasticity in neurons, focusing on how it contributes to learning in several systems. Examines cellular forms of associative plasticity, including long-term potentiation and depression, homeostatic plasticity, and depotentiation. Relates these phenomena to associative memory in animal systems and humans."}, "Genes, Circuits, and Behavior": {"title": "Genes, Circuits, and Behavior", "number": "9.32", "description": "Focuses on understanding molecular and cellular mechanisms of circuitry development, function and plasticity, and their relevance to normal and abnormal behaviors/psychiatric disorders. Highlights cutting-edge technologies for neuroscience research. Students build professional skills through presentations and critical evaluation of original research papers."}, "Biomechanics and Neural Control of Movement": {"title": "Biomechanics and Neural Control of Movement", "number": "9.34[J]", "description": "Quantitative knowledge of human movement behavior is important in a growing number of engineering applications (medical and rehabilitation technology, athletic and military equipment, human-computer interaction, vehicle performance, etc.). Presents a quantitative, model-based description of how biomechanical and neural factors interact in human sensory-motor behavior, focusing mainly on the upper limbs. Students survey recent literature on how motor behavior is controlled, comparing biological and robotic approaches to similar tasks. Topics may include a review of relevant neural, muscular and skeletal physiology, neural feedback and \"equilibrium-point\" theories, co-contraction strategies, impedance control, kinematic redundancy, optimization, intermittency, contact tasks and tool use. Students taking the graduate version will complete additional assignments."}, "Perception": {"title": "Perception", "number": "9.35", "description": "Studies how the senses work and how physical stimuli are transformed into signals in the nervous system. Examines how the brain uses those signals to make inferences about the world, and uses illusions and demonstrations to gain insight into those inferences. Emphasizes audition and vision, with some discussion of touch, taste, and smell. Provides experience with psychophysical methods."}, "Introduction to Neural Computation": {"title": "Introduction to Neural Computation", "number": "9.40", "description": "Introduces quantitative approaches to understanding brain and cognitive functions. Topics include mathematical description of neurons, the response of neurons to sensory stimuli, simple neuronal networks, statistical inference and decision making. Also covers foundational quantitative tools of data analysis in neuroscience: correlation, convolution, spectral analysis, principal components analysis. Mathematical concepts include simple differential equations and linear algebra."}, "Research and Communication in Neuroscience and Cognitive Science": {"title": "Research and Communication in Neuroscience and Cognitive Science", "number": "9.41", "description": "Emphasizes research and scientific communication. Instruction and practice in written and oral communication provided. Based on results of his/her UROP research, each student creates a full-length paper and a poster as part of an oral presentation at the end of the term. Other assignments include peer editing and reading/critiquing published research papers. Prior to starting class, students must have collected enough data from their UROP research projects to write a paper. Limited to juniors and seniors."}, "Principles of Neuroengineering": {"title": "Principles of Neuroengineering", "number": "9.422[J]", "description": "Covers how to innovate technologies for brain analysis and engineering, for accelerating the basic understanding of the brain, and leading to new therapeutic insight and inventions. Focuses on using physical, chemical and biological principles to understand technology design criteria governing ability to observe and alter brain structure and function. Topics include optogenetics, noninvasive brain imaging and stimulation, nanotechnologies, stem cells and tissue engineering, and advanced molecular and structural imaging technologies. Includes design projects. Designed for students with engineering maturity who are ready for design. Students taking graduate version complete additional assignments."}, "Revolutionary Ventures: How to Invent and Deploy Transformative Technologies": {"title": "Revolutionary Ventures: How to Invent and Deploy Transformative Technologies", "number": "9.455[J]", "description": "Seminar on envisioning and building ideas and organizations to accelerate engineering revolutions. Focuses on emerging technology domains, such as neurotechnology, imaging, cryotechnology, gerontechnology, and bio-and-nano fabrication. Draws on historical examples as well as live case studies of existing or emerging organizations, including labs, institutes, startups, and companies. Goals range from accelerating basic science to developing transformative products or therapeutics. Each class is devoted to a specific area, often with invited speakers, exploring issues from the deeply technical through the strategic. Individually or in small groups, students prototype new ventures aimed at inventing and deploying revolutionary technologies."}, "Neuroscience of Morality": {"title": "Neuroscience of Morality", "number": "9.46", "description": "Advanced seminar that covers both classic and cutting-edge primary literature from psychology and the neuroscience of morality. Addresses questions about how the human brain decides which actions are morally right or wrong (including neural mechanisms of empathy and self-control), how such brain systems develop over childhood and differ across individuals and cultures, and how they are affected by brain diseases (such as psychopathy, autism, tumors, or addiction). Instruction and practice in written and oral communication provided. Limited to 24."}, "Philosophical Issues in Brain Science": {"title": "Philosophical Issues in Brain Science", "number": "9.48[J]", "description": "An introduction to some central philosophical questions about the mind, specifically those intimately connected with contemporary psychology and neuroscience. Discussions focus on arguments over innate concepts; 'mental images' as pictures in the head; whether color is in the mind or in the world; and whether there can be a science of consciousness. Explains the relevant parts of psychology and neuroscience as the subject proceeds."}, "Research in Brain and Cognitive Sciences": {"title": "Research in Brain and Cognitive Sciences", "number": "9.50", "description": "Laboratory research in brain and cognitive science, using physiological, anatomical, pharmacological, developmental, behavioral, and computational methods. Each student carries out an experimental study under the direction of a member of the faculty. Project must be approved in advance by the faculty supervisor and the Director of the Undergraduate Program. Written presentation of results is required."}, "Statistical Learning Theory and Applications": {"title": "Statistical Learning Theory and Applications", "number": "9.520[J]", "description": "Provides students with the knowledge needed to use and develop advanced machine learning solutions to challenging problems. Covers foundations and recent advances of machine learning in the framework of statistical learning theory. Focuses on regularization techniques key to high-dimensional supervised learning. Starting from classical methods such as regularization networks and support vector machines, addresses state-of-the-art techniques based on principles such as geometry or sparsity, and discusses a variety of algorithms for supervised learning, feature selection, structured prediction, and multitask learning. Also focuses on unsupervised learning of data representations, with an emphasis on hierarchical (deep) architectures."}, "Aspects of a Computational Theory of Intelligence": {"title": "Aspects of a Computational Theory of Intelligence", "number": "9.523[J]", "description": "Integrates neuroscience, cognitive and computer science to explore the nature of intelligence, how it is produced by the brain, and how it can be replicated in machines. Discusses an array of current research connected through an overarching theme of how it contributes to a computational account of how humans analyze dynamic visual imagery to understand objects and actions in the world."}, "Emergent Computations Within Distributed Neural Circuits": {"title": "Emergent Computations Within Distributed Neural Circuits", "number": "9.530", "description": "Addresses the fundamental scientific question of how the human brain still outperforms the best computer algorithms in most domains of sensory, motor and cognitive function, as well as the parallel and distributed nature of neural processing (as opposed to the serial organization of computer architectures/algorithms) required to answer it. Explores the biologically plausible computational mechanisms and principles that underlie neural computing, such as competitive and unsupervised learning rules, attractor networks, self-organizing feature maps, content-addressable memory, expansion recoding, the stability-plasticity dilemma, the role of lateral and top-down feedback in neural systems, the role of noise in neural computing. Students taking graduate version complete additional assignments."}, "Functional Magnetic Resonance Imaging: Data Acquisition and Analysis": {"title": "Functional Magnetic Resonance Imaging: Data Acquisition and Analysis", "number": "9.583[J]", "description": "Provides background necessary for designing, conducting, and interpreting fMRI studies in the human brain. Covers in depth the physics of image encoding, mechanisms of anatomical and functional contrasts, the physiological basis of fMRI signals, cerebral hemodynamics, and neurovascular coupling. Also covers design methods for stimulus-, task-driven and resting-state experiments, as well as workflows for model-based and data-driven analysis methods for data. Instruction in brain structure analysis and surface- and region-based analyses. Laboratory sessions include data acquisition sessions at the 3 Tesla MRI scanner at MIT and the Connectom and 7 Tesla scanners at the MGH/HST Martinos Center, as well as hands-on data analysis workshops. Introductory or college-level neurobiology, physics, and signal processing are helpful."}, "Laboratory in Psycholinguistics": {"title": "Laboratory in Psycholinguistics", "number": "9.59[J]", "description": "Hands-on experience designing, conducting, analyzing, and presenting experiments on the structure and processing of human language. Focuses on constructing, conducting, analyzing, and presenting an original and independent experimental project of publishable quality. Develops skills in reading and writing scientific research reports in cognitive science, including evaluating the methods section of a published paper, reading and understanding graphical displays and statistical claims about data, and evaluating theoretical claims based on experimental data.  Instruction and practice in oral and written communication provided."}, "Machine-Motivated Human Vision": {"title": "Machine-Motivated Human Vision", "number": "9.60", "description": "Explores how studies of human vision can be motivated by, and enhance the capabilities of, machine-based systems. Considers the twin questions of how the performance of state-of-the-art machine vision systems compares with that of humans, and what kinds of strategies the human visual system uses in tasks where human performance exceeds that of machines. Includes presentations by engineers from companies with significant engineering efforts in vision. Based on these presentations, students define and conduct studies to address the two aforementioned questions and present their results to the public at the end of the term. Directed towards students interested in exploring vision from computational, experimental and practical perspectives. Provides instruction and practice in written and oral communication."}, "Language Acquisition I": {"title": "Language Acquisition I", "number": "9.601[J]", "description": "Lectures, reading, and discussion of current theory and data concerning the psychology and biology of language acquisition. Emphasizes learning of syntax, semantics, and morphology, together with some discussion of phonology, and especially research relating grammatical theory and learnability theory to empirical studies of children."}, "Natural Language and the Computer Representation of Knowledge": {"title": "Natural Language and the Computer Representation of Knowledge", "number": "9.611[J]", "description": "Explores the relationship between the computer representation and acquisition of knowledge and the structure of human language, its acquisition, and hypotheses about its differentiating uniqueness.  Emphasizes development of analytical skills necessary to judge the computational implications of grammatical formalisms and their role in connecting human intelligence to computational intelligence. Uses concrete examples to illustrate particular computational issues in this area."}, "Computational Cognitive Science": {"title": "Computational Cognitive Science", "number": "9.660", "description": "Introduction to computational theories of human cognition. Focus on principles of inductive learning and inference, and the representation of knowledge. Computational frameworks covered include Bayesian and hierarchical Bayesian models; probabilistic graphical models; nonparametric statistical models and the Bayesian Occam's razor; sampling algorithms for approximate learning and inference; and probabilistic models defined over structured representations such as first-order logic, grammars, or relational schemas. Applications to understanding core aspects of cognition, such as concept learning and categorization, causal reasoning, theory formation, language acquisition, and social inference. Graduate students complete a final project."}, "Functional MRI Investigations of the Human Brain": {"title": "Functional MRI Investigations of the Human Brain", "number": "9.71", "description": "Covers design and interpretation of fMRI experiments, and the relationship between fMRI and other techniques. Focuses on localization of cognitive function in the human brain. Students write papers and give presentations, explain and critique published papers, and design but do not conduct their own fMRI experiments. Upon completion, students should be able to understand and critique published fMRI papers and have a good grasp of what is known about localization of cognitive function from fMRI. Limited to 12."}, "Computational Perception": {"title": "Computational Perception", "number": "9.77", "description": "Begins with a review of the experimental paradigms, findings and theories used to evaluate the capabilities and limits of human visual perception. Assesses how knowledge of human perception may be used to guide machine vision systems. Second part of the subject focuses on models in computational perception. Describes how computer vision systems can perform image analysis and synthesis; face, object and scene perception; texture synthesis, segmentation, and navigation. Introduces various simulation methods. A MATLAB-based project in computational perception is required. Limited to 8."}, "Psychology and Economics": {"title": "Psychology and Economics", "number": "9.822[J]", "description": "Examines \"psychology appreciation\" for economics students. Aims to enhance knowledge and intuition about psychological processes in areas relevant to economics. Increases understanding of psychology as an experimental discipline, with its own distinct rules and style of argument. Topics include self-knowledge, cognitive dissonance, self-deception, emotions, social norms, self-control, learning, mental accounting, memory, individual and group behavior, and some personality and psycho-analytic models. Within each of these topics, we showcase effective and central experiments and discuss their role in the development of psychological theory. Term paper required."}, "Infant and Early Childhood Cognition": {"title": "Infant and Early Childhood Cognition", "number": "9.85", "description": "Introduction to cognitive development focusing on childrens' understanding of objects, agents, and causality. Develops a critical understanding of experimental design. Discusses how developmental research might address philosophical questions about the origins of knowledge, appearance and reality, and the problem of other minds.  Provides instruction and practice in written communication as necessary to research in cognitive science (including critical reviews of journal papers, a literature review and an original research proposal), as well as instruction and practice in oral communication in the form of a poster presentation of a journal paper."}, "Off-Campus Undergraduate Research in Brain and Cognitive Sciences": {"title": "Off-Campus Undergraduate Research in Brain and Cognitive Sciences", "number": "9.89", "description": "For Brain and Cognitive Sciences undergraduates participating in curriculum-related research off-campus. Before enrolling, students must consult the BCS Academic Office for details on procedures and restrictions, and have approval from their faculty advisor. Subject to departmental approval. Upon completion, the off-campus supervisor will provide an evaluation of the student's work.  The student must also submit a write-up of the experience, approved by the MIT supervisor."}, "Practical Experience in Brain and Cognitive Sciences": {"title": "Practical Experience in Brain and Cognitive Sciences", "number": "9.90", "description": "For Brain and Cognitive Sciences undergraduates participating in curriculum-related off-campus professional experiences. Before enrolling, students must consult the BCS Academic Office for details on procedures and restrictions, and have approval from their faculty advisor. Subject to departmental approval. Upon completion, the student must submit a write-up of the experience, approved by the MIT supervisor."}, "Clinical Connection Module": {"title": "Clinical Connection Module", "number": "9.900", "description": "Provides students the opportunity to connect their core neuroscience training to clinical experience (pathogenesis, diagnosis, management and therapeutic clinical trials of nervous system diseases). Students attend, along with Harvard faculty, fellows, residents and medical students at Massachusetts General Hospital, clinical seminars at MGH conducted by clinical and basic science faculty of Harvard Medical School. Each clinical experience is one week in length; students have the option to attend up to four seminars in their individual week chosen from: neuroradiology, neuropathology, neurodegenerative diseases, epilepsy, movement disorders, psychiatry, neuropsychiatric diseases and behavioral neurology, and functional neurosurgery. Seminars are followed by one-on-one discussion with instructor to connect the clinical experience with parallel course material on the neurobiology of disease."}, "Responsible Conduct in Science": {"title": "Responsible Conduct in Science", "number": "9.901", "description": "Provides instruction and dialogue on practical ethical issues relating to the responsible conduct of human and animal research in the brain and cognitive sciences. Specific emphasis on topics relevant to young researchers including data handling, animal and human subjects, misconduct, mentoring, intellectual property, and publication. Preliminary assigned readings and initial faculty lecture followed by discussion groups of four to five students each. A short written summary of the discussions submitted at the end of each class. See IAP Guide for registration information."}}