{"Introduction to Media Studies": {"title": "Introduction to Media Studies", "number": "CMS.100", "description": "Offers an overview of the social, cultural, political, and economic impact of mediated communication on modern culture. Combines critical discussions with experiments working with different media. Media covered include radio, television, film, the printed word, and digital technologies. Topics include the nature and function of media, core media institutions, and media in transition. Enrollment limited."}, "Introduction to Videogame Theory": {"title": "Introduction to Videogame Theory", "number": "CMS.841", "description": "Introduction to the interdisciplinary study of videogames as texts through an examination of their cultural, educational, and social functions in contemporary settings. Students play and analyze videogames while reading current research and theory from a variety of sources in the sciences, social sciences, humanities, and industry. Assignments focus on game analysis in the context of the theories discussed in class. Includes regular reading, writing, and presentation exercises. No prior programming experience required. Students taking graduate version complete additional assignments. Limited to 20."}, "Introduction to Game Design Methods": {"title": "Introduction to Game Design Methods", "number": "CMS.301", "description": "Provides an introduction to the process of designing games and playful experiences. Familiarizes students with concepts, methods, techniques and tools used in the design of a wide variety of games. Focuses on aspects of the process such as rapid prototyping, play testing, and design iteration using a player-centered approach. Students work in project groups where they engage with a series of confined exercises, practice communicating design ideas, and discuss their own and others work in a constructive manner. No prior programming experience required. Limited to 15."}, "Critical Worldbuilding": {"title": "Critical Worldbuilding", "number": "CMS.807", "description": "Studies the design and analysis of invented (or constructed) worlds for narrative media, such as television, films, comics, and literary texts.  Provides the practical, historical and critical tools with which to understand the function and structure of imagined worlds.  Examines world-building strategies in the various media and genres in order to develop a critical and creative repertoire.  Participants create their own invented worlds. Students taking graduate version complete additional assignments. Limited to 13."}, "The Visual Story: Graphic Novel, Type to Tablet": {"title": "The Visual Story: Graphic Novel, Type to Tablet", "number": "CMS.808", "description": "Focuses on the interactions between graphic stories and media technologies from the rotary press of the late 19th century to contemporary touch screens, exploring the changing relations among narrative expression, reader experience and media form. Working with examples from Pulitzers Yellow Kid and McKays Little Nemo, through the classic comics (from DC superheroes to EC horror) and graphic novels to interactive and non-linear texts (Cognitos Operation Ajax), the course examines such elements as graphic design, interface and form as well as the circulation and economies of these various media-based texts."}, "Transmedia Storytelling: Modern Science Fiction": {"title": "Transmedia Storytelling: Modern Science Fiction", "number": "CMS.809", "description": "Explores transmedia storytelling by investigating how science fiction stories are told across different media, such as the short story, the novel, the screenplay, moving image, and games. Students consider issues of aesthetics, authorship, and genre, while also contextualizing discussion within the broader framework of the political issues raised by film, TV, and other kinds of science fiction texts. Students taking graduate version complete additional assignments."}, "Silent Film": {"title": "Silent Film", "number": "CMS.813", "description": "Examines how the key elements of today's films - composition, continuity editing, lighting, narrative structure - were originally created. Studies the history of cinema, from its origins in the late 19th century to the transition to sound in the late 1920s and early 1930s. Students view a range of films (both mainstream and experimental) from all over the world, with a particular focus on US productions. Emphasis on how color, sound, and other developments paved the way for today's technological innovations.   Students taking graduate version complete additional assignments."}, "Phantasmal Media: Computer-Based Art Theory and Practice": {"title": "Phantasmal Media: Computer-Based Art Theory and Practice", "number": "CMS.814", "description": "Engages students in theory and practice of using computational techniques for developing expressive digital media works. Surveys approaches to understanding human imaginative processes, such as constructing concepts, metaphors, and narratives, and applies them to producing and understanding socially, culturally, and critically meaningful works in digital media. Readings engage a variety of theoretical perspectives from cognitive linguistics, literary and cultural theory, semiotics, digital media arts, and computer science. Students produce interactive narratives, games, and related forms of software art. Some programming and/or interactive web scripting experience (e.g., Flash, Javascript) is desirable. Students taking the graduate version complete a project requiring more in-depth theoretical engagement."}, "Production of Educational Videos:  Skills for Communicating Academic and Professional Content": {"title": "Production of Educational Videos:  Skills for Communicating Academic and Professional Content", "number": "CMS.333[J]", "description": "Develops communication and media skills through the production of educational videos. Students conceive, plan, script, shoot and edit video content to teach elements of MIT's curriculum. Each student creates a series of short videos that concisely explains and contextualizes specific problems of importance to disciplines at MIT, especially physics, math, chemistry, biology, or the humanities. The resulting videos present these problems through compelling use of illustrations, demonstrations, animations, and commentary, all from the student's perspective. Empowers students specifically to communicate their MIT expertise to communities of learners and generally to reach broad audiences with quality, accessible online content. Limited to 12; preference to students in ESG."}, "South Asian America: Transnational Media, Culture, and History": {"title": "South Asian America: Transnational Media, Culture, and History", "number": "CMS.334[J]", "description": "Examines the history of South Asian immigration, sojourning, and settlement from the 1880s to the present. Focuses on the US as one node in the global circulation, not only of people, but of media, culture and ideas, through a broader South Asian diaspora. Considers the concept of \"global media\" historically; emphasis on how ideas about, and self-representations of, South Asians have circulated via books, political pamphlets, performance, film, video/cassette tapes, and the internet. Students analyze and discuss scholarly writings, archival documents, memoirs, fiction, blogs and films, and write papers drawing on course materials, lectures, and discussions. Limited to 18."}, "Short Attention Span Documentary": {"title": "Short Attention Span Documentary", "number": "CMS.335[J]", "description": "Focuses on the production of short (1- to 5-minute) digital video documentaries: a form of non-fiction filmmaking that has proliferated in recent years due to the ubiquity of palm-sized and mobile phone cameras and the rise of web-based platforms, such as YouTube. Students shoot, edit, workshop and revise a series of short videos meant to engage audiences in a topic, introduce them to new ideas, and/or persuade them. Screenings and discussions cover key principles of documentary film - narrative, style, pace, point of view, argument, character development - examining how they function and change in short format. Students taking graduate version complete additional assignments. Limited to 16."}, "Social Justice and The Documentary Film": {"title": "Social Justice and The Documentary Film", "number": "CMS.836", "description": "Explores the history and current state of social-issue documentary. Examines how cultural and political upheaval and technological change have converged at different moments to bring about new waves of activist documentary film production. Particular focus on films and other non-fiction media of the present and recent past. Students screen and analyze a series of key films and work in groups to produce their own short documentary using digital video and computer-based editing. Students taking graduate version complete additional assignments. Limited to 18."}, "Innovation in Documentary: Technologies and Techniques": {"title": "Innovation in Documentary: Technologies and Techniques", "number": "CMS.838", "description": "Discusses emerging technologies and techniques available to media-makers (e.g., location-based technologies, transmedia storytelling, crowdsourcing, and interactivity) and their implications on the film and television documentary. Studies the development of these tools and considers the many new directions in which they may take the genre.  Includes screenings, meetings with documentary makers, and an experimental component in which students can explore new approaches to documentary production. Students taking graduate version complete additional assignments."}, "Virtual Reality and Immersive Media Production": {"title": "Virtual Reality and Immersive Media Production", "number": "CMS.839", "description": "Provides an overview of historical developments and current innovations in virtual reality (e.g., gear, software, and storytelling techniques) and looks into new trends in augmented, mixed and holographic reality. Includes practical instruction and a step-by-step exploration of the fundamentals of virtual reality creation - from new visual languages and grammars, to storyboarding, scripting, sound design and editing, to new and innovative ways to capture, scan and reproduce 360-degree images. Students taking graduate version complete additional assignments. Limited to 18."}, "Topics and Methods in 21st-Century Journalism": {"title": "Topics and Methods in 21st-Century Journalism", "number": "CMS.350[J]", "description": "Gives a broad understanding of what it means to produce journalism today. Evaluates the limitations and strengths of specific types of media, ranging from New York Times stories to Twitter feeds. Provides students with tools to effectively communicate their own work and research to non-specialist audiences. Students submit assignments via an online portal, which mimics the style and substance of an online news source. Students taking graduate version complete additional assignments. Limited to 12."}, "Advertising and Media: Comparative Perspectives": {"title": "Advertising and Media: Comparative Perspectives", "number": "CMS.888", "description": "Compares modern and contemporary advertising culture in China, the US, and other emerging markets. First half focuses on branding in the old media environment; second half introduces the changing practice of advertising in the new media environment. Topics include branding and positioning, media planning, social media campaigns, cause marketing 2.0, social TV, and mobility marketing. Required lab work includes interactive sessions in branding a team product for the US (or a European country) and China markets. Taught in English and requires no knowledge of Chinese. Students taking graduate version complete additional assignments."}, "Introduction to Civic Media": {"title": "Introduction to Civic Media", "number": "CMS.860", "description": "Examines civic media in comparative, transnational and historical perspective. Introduces various theoretical tools, research approaches, and project design methods. Students engage with multimedia texts on concepts such as citizen journalism, transmedia activism, media justice, and civic, public, radical, and tactical media. Case studies explore civic media across platforms (print, radio, broadcast, internet), contexts (from local to global, present-day to historical), and use (dialogic, contentious, hacktivist). As a final project, students develop a case study or project proposal. Students taking the graduate version complete additional assignments. Limited to 20."}, "Networked Social Movements: Media and Mobilization": {"title": "Networked Social Movements: Media and Mobilization", "number": "CMS.861", "description": "Provides an overview of social movement studies as a body of theoretical and empirical work, with an emphasis on understanding the relationship between social movements and the media. Explores multiple methods of social movement investigation, including textual and media analysis, surveys, interviews, focus groups, participant observation, and co-research. Covers recent innovations in social movement theory, as well as new data sources and tools for research and analysis. Includes short papers, a literature review, and a final research project. Students taking graduate version complete additional assignments. Limited to 16."}, "Civic Media Collaborative Design Studio": {"title": "Civic Media Collaborative Design Studio", "number": "CMS.862", "description": "Project-based studio focusing on collaborative design of civic media provides a service-learning opportunity for students interested in working with community organizations. Multidisciplinary teams create civic media projects based on real-world community needs. Covers co-design methods and best practices to include the user community in iterative stages of project ideation, design, implementation, testing, and evaluation. Students taking graduate version complete additional assignments. Limited to 16."}, "History of Media and Technology": {"title": "History of Media and Technology", "number": "CMS.876", "description": "Surveys the interrelated histories of communications media and technological development, from the emergence of 19th-century forms of mass print media and telegraphy, to sound capture and image-based forms (e.g., film, radio, and television), to the shift from analog to digital cultures. Examines how new forms of communication exert social, political, and cultural influences in the global context. Explores how technological innovation and accelerating media affect social values and behaviors in the popular and global adoption of a media device. Includes two papers and a research project on aspects of media history. Students taking graduate version complete additional assignments."}, "Media Systems and Texts": {"title": "Media Systems and Texts", "number": "CMS.400", "description": "Explores theoretical, historical and critical approaches to the comparative study of media. Examines media from three perspectives: the historical evolution of particular media forms (media in transition); the migration of particular narratives across different media forms (trans-media texts); and the ways in which media texts and systems cross cultural and national boundaries (global crossings). Instruction and practice in written and oral communication provided."}, "Visual Design": {"title": "Visual Design", "number": "CMS.405", "description": "Examines the process of making and sharing visual artifacts using a trans-cultural, trans-historical, constructionist approach. Explores the relationship between perceived reality and the narrative imagination, how an author's choice of medium and method constrains the work, how desire is integrated into the structure of a work, and how the cultural/economic opportunity for exhibition/distribution affects the realization of a work.  Instruction and practice in written and oral communication provided. Limited to 20."}, "Sound Studies": {"title": "Sound Studies", "number": "CMS.407", "description": "Explores the ways in which humans experience the realm of sound and how perceptions and technologies of sound emerge from cultural, economic, and historical worlds. Examines how environmental, linguistic, and musical sounds are construed cross-culturally. Describes the rise of telephony, architectural acoustics, and sound recording, and the globalized travel of these technologies. Addresses questions of ownership, property, authorship, and copyright in the age of digital file sharing. Particular focus on how the sound/noise boundary is imagined, created and modeled across diverse sociocultural and scientific contexts. Auditory examples--sound art, environmental recordings, music--will be provided and invited. Instruction and practice in written and oral communication provided. Limited to 20."}, "Introduction to Education: Looking Forward and Looking Back on Education": {"title": "Introduction to Education: Looking Forward and Looking Back on Education", "number": "CMS.586[J]", "description": "One of two introductory subjects on teaching and learning science and mathematics in a variety of K-12 settings. Topics include education and media, education reform, the history of education, simulations, games, and the digital divide. Students gain practical experience through weekly visits to schools, classroom discussions, selected readings, and activities to develop a critical and broad understanding of past and current forces that shape the goals and processes of education, and explores the challenges and opportunities of teaching. Students work collaboratively and individually on papers, projects, and in-class presentations. Limited to 25."}, "Introduction to Education: Understanding and Evaluating Education": {"title": "Introduction to Education: Understanding and Evaluating Education", "number": "CMS.587[J]", "description": "One of two introductory subjects on teaching and learning science and mathematics in a variety of K-12 settings. Topics include student misconceptions, formative assessment, standards and standardized testing, multiple intelligences, and educational technology. Students gain practical experience through weekly visits to schools, classroom discussions, selected readings, and activities to develop a critical and broad understanding of past and current forces that shape the goals and processes of education, and explores the challenges and opportunities of teaching. Students work collaboratively and individually on papers, projects, and in-class presentations. Limited to 25."}, "Design and Development of Games for Learning": {"title": "Design and Development of Games for Learning", "number": "CMS.863[J]", "description": "Immerses students in the process of building and testing their own digital and board games in order to better understand how we learn from games.  Explores the design and use of games in the classroom in addition to research and development issues associated with computer-based (desktop and handheld) and non-computer-based media. In developing their own games, students examine what and how people learn from them (including field testing of products), as well as how games can be implemented in educational settings.  All levels of computer experience welcome. Students taking graduate version complete additional assignments."}, "Educational Theory and Practice I": {"title": "Educational Theory and Practice I", "number": "CMS.591[J]", "description": "Concentrates on core set of skills and knowledge necessary for teaching in secondary schools. Topics include classroom management, student behavior and motivation, curriculum design, educational reform, and the teaching profession. Classroom observation is a key component. Assignments include readings from educational literature, written reflections on classroom observations, practice teaching and constructing curriculum. The first of the three-course sequence necessary to complete the Teacher Education Program. Limited to 15; preference to juniors and seniors."}, "Educational Theory and Practice II": {"title": "Educational Theory and Practice II", "number": "CMS.592[J]", "description": "Concentrates on the theory and psychology associated with student learning. Topics include educational theory, educational psychology, and theories of learning. Students assume responsibility for full-time teaching of two or more classes at their designated school. Class sessions focus on debriefing and problem-solving. Second of a three-course sequence necessary to complete the Teacher Education Program."}, "Educational Theory and Practice III": {"title": "Educational Theory and Practice III", "number": "CMS.593[J]", "description": "Students continue their IAP student teaching through mid March. Topics include educational psychology, theories of learning, and using technology and evaluating its effectiveness to enhance student learning. Assignments include readings from educational literature, written reflections on student teaching, presentations on class topics and creating a project that supports student learning at the school where the MIT student is teaching. This is the third of the three-course sequence necessary to complete the Teacher Education Program."}, "Education Technology Studio": {"title": "Education Technology Studio", "number": "CMS.894", "description": "Uses media and technology to develop new forms of learning experiences for schools, workplace, and informal settings. Students participate in a range of projects that hone understanding and skills in learning science, instructional design, development, and evaluation. Topics vary but include developing new media and activities for massive open online courses, creating practice spaces for practitioners in the professions and humanities, and developing new approaches to assessment in complex learning environments. Students taking graduate version complete additional assignments."}, "Learning, Media, and Technology": {"title": "Learning, Media, and Technology", "number": "CMS.895", "description": "Addresses new digital technologies that are transforming learning across the lifespan - from reading apps for toddlers, intelligent tutors for school children, and blended learning for college students, to MOOCs for adults and interest-based learning communities for hobbyists. Focuses on how these technologies shape people's lives and learning. Students explore how education technologies operate in complex social-technical systems, and acquire analytic tools and strategies that can be applied to other complex systems. They also refine their thinking about the opportunities, limits, and tradeoffs of educational technology. Students taking graduate version complete additional assignments."}, "Media Internship": {"title": "Media Internship", "number": "CMS.606", "description": "Part-time internships arranged in Boston and the wider Northeast for students wishing to develop professional experience in a media production organization or industry. Students work with a CMS/W faculty advisor to produce a white paper on a research topic of interest based on their intern experience. Students planning to take this subject must contact the instructor before the end of the preceding term."}, "Game Design": {"title": "Game Design", "number": "CMS.864", "description": "Practical instruction in the design and analysis of non-digital games. Provides students the texts, tools, references, and historical context to analyze and compare game designs across a variety of genres. In teams, students design, develop, and thoroughly test their original games to better understand the interaction and evolution of game rules. Covers various genres and types of games, including sports, game shows, games of chance, card games, schoolyard games, board games, and role-playing games. Students taking the graduate version complete additional assignments. Limited to 20."}, "The Word Made Digital": {"title": "The Word Made Digital", "number": "CMS.846", "description": "Considers the many uses of text, language, and writing in creative digital  media. Focuses on non-narrative uses of text, such as in information  display, visual and lyrical settings, and human-legible computer code.  Considers the use of text within the context of computing and different  computing platforms. Draws on concepts and approaches from poetics, the  material history of texts, and computer science. Assignments include  individual and group writing projects, which involve reading and modifying  computer programs. Previous programming experience and writing coursework  helpful. Students taking graduate version complete additional assignments. Limited to 18."}, "Media Industries and Systems: The Art, Science and Business of Games": {"title": "Media Industries and Systems: The Art, Science and Business of Games", "number": "CMS.922", "description": "Examines the interplay of art, science, law, and commerce in the production, marketing, distribution, and consumption of historic and contemporary videogames. Students create prototypes and develop marketing programs to illustrate the challenges of producing videogames in a professional context. Combines perspectives on media industries and systems with an examination of the creative process, development, and trends that shape content. Includes discussions with industry leaders in various areas. Students taking graduate version complete additional assignments."}, "Creating Video Games": {"title": "Creating Video Games", "number": "CMS.611[J]", "description": "Introduces students to the complexities of working in small, multidisciplinary teams to develop video games. Covers creative design and production methods, stressing design iteration and regular testing across all aspects of game development (design, visual arts, music, fiction, and programming). Assumes a familiarity with current video games, and the ability to discuss games critically. Previous experience in audio design, visual arts, or project management recommended. Limited to 24."}, "Writing for Videogames": {"title": "Writing for Videogames", "number": "CMS.866", "description": "Explores the convergence of fiction, dramatic writing and game design in writing for videogames. Addresses the problematic relationship between storytelling and games, from both an analytical and practical standpoint. Discusses theory and analysis of pre-existing games. Assignments provide students the opportunity to tackle specific writing problems in a creative way. Basic programming knowledge and previous coursework in game design, videogame theory, interactive narrative or play writing is useful but not required. Graduate students complete additional assignments."}, "Network Cultures": {"title": "Network Cultures", "number": "CMS.867", "description": "Focuses on the social and cultural aspects of networked life through internet-related technologies (including computers, mobile devices, entertainment technologies, and emerging media forms). Theories and readings focus on the cultural, social, economic, and political aspects of internet use and design. Topics include online communication and communities, social media, gender and race in network spaces, activism and hacking, networked publics, remix culture and intellectual property. Students taking the graduate version complete additional readings and assignments."}, "Games for Social Change": {"title": "Games for Social Change", "number": "CMS.815", "description": "Students will collaborate in teams to design and prototype games for social change and civic engagement. Run as a workshop in which student teams develop their games and showcase them at a semester-end open house. Features guest speakers from academia and industry as well as the non-profit sector and the gaming community. Readings will explore principals of game design, and the social history of games. Graduate students will complete additional assignments."}, "Games and Culture": {"title": "Games and Culture", "number": "CMS.868", "description": "Examines the social, cultural, economic, and political aspects of digital games. Topics include the culture of gameplay, gaming styles, communities, spectatorship and performance, gender and race within digital gaming, and the politics and economics of production processes, including co-creation and intellectual property. Students taking graduate version complete additional readings and assignments."}, "Advanced Game Studio": {"title": "Advanced Game Studio", "number": "CMS.617", "description": "Students join the class in pre-formed teams, which work under the supervision of experienced mentors to complete a term-long game creation project. Covers management best practices for software engineering teams; creative expression as a collaborative project; developing and evaluating prototypes for potential viability, and translating them into a final polished product; planning and running qualitative testing of design elements; and targeting and selecting an appropriate audience for testing. Includes regular reviews and critiques to discuss progress, design, and work plan. Culminates with public presentation of games. Limited to 15."}, "Interactive Narrative": {"title": "Interactive Narrative", "number": "CMS.845", "description": "Provides a workshop environment for understanding interactive narrative (print and digital) through critical writing, narrative theory, and creative practice. Covers important multisequential books, hypertexts, and interactive fictions. Students write critically, and give presentations, about specific works; write a short multisequential fiction; and develop a digital narrative system, which involves significant writing and either programming or the structuring of text. Programming ability helpful. Graduate students complete additional assignments."}, "Gender and Media Studies": {"title": "Gender and Media Studies", "number": "CMS.619[J]", "description": "Examines representations of race, gender, and sexual identity in the media. Considers issues of authorship, spectatorship, and the ways in which various media (film, television, print journalism, advertising) enable, facilitate, and challenge these social constructions in society. Studies the impact of new media and digital media through analysis of gendered and racialized language and embodiment online in blogs and vlogs, avatars, and in the construction of cyberidentities. Provides introduction to feminist approaches to media studies by drawing from work in feminist film theory, cultural studies, gender and politics, and cyberfeminism."}, "Fans and Fan Cultures": {"title": "Fans and Fan Cultures", "number": "CMS.821", "description": "Examines media audiences - specifically, fans - and the subcultures that evolve around them. Examines the different historical, contemporary and transnational understandings of fans. Explores products of fan culture, i.e., clubs, fiction, \"vids,\" activism, etc. Readings place these products within the context of various disciplines. Students consider the concept of the \"aca-fan\" and reflect on their own \"fannish\" practices. Requires several short papers. Students taking graduate version complete additional assignments. Limited to 20."}, "Applying Media Technologies in the Arts and Humanities": {"title": "Applying Media Technologies in the Arts and Humanities", "number": "CMS.622", "description": "Introduces students to the use of new media technologies to design and develop fresh approaches to creating new content in the arts and humanities.  Students explore the rapidly expanding world of contemporary media technologies through team work in which they choose from a selection of approaches such as mobile data, civic media, digital humanities, and game prototyping to create novel media objects or compositions. Readings include a selection of classic and contemporary critical and design works from the arts and humanities."}, "Imagination, Computation, and Expression Studio": {"title": "Imagination, Computation, and Expression Studio", "number": "CMS.827", "description": "Aims to help students invent and analyze new forms of computer-based art, gaming, social media, interactive narrative, and related technologies. Students participate in a range of new and ongoing projects that are designed to hone skills in research, development, design, and evaluation. Topics vary from year to year; examples include cognitive science and artificial intelligence-based approaches to the arts; social aspects of game design; computing for social empowerment; and game character, avatar, and online profile design. May be repeated for credit with permission of instructor. Students taking graduate version complete additional assignments."}, "Advanced Identity Representation": {"title": "Advanced Identity Representation", "number": "CMS.828", "description": "Studies and develops computational identity systems for games, social media, virtual worlds, and computer-based artwork. An interdisciplinary set of readings (cognitive science, computer science, art, and sociology) looks at both the underlying technology and the social/cultural aspects of identity. Includes topics such as developing improved characters, avatars, agents, social networking profiles, and online accounts. Engages students in on-going research projects. Explores how social categories are formed in digital media, including gender, class, and ethnicity, along with everyday social categories (such as those based on personality or shared media preferences). Experience required in one of the following: computer programming, graphic design, web development, interaction design, or social science research methods. Students taking graduate version complete additional assignments."}, "Data Storytelling Studio": {"title": "Data Storytelling Studio", "number": "CMS.831", "description": "Explores visualization methodologies to conceive and represent systems and data, e.g., financial, media, economic, political, etc. Covers basic methods for research, cleaning, and analysis of datasets. Introduces creative methods of data presentation and storytelling. Considers the emotional, aesthetic, ethical, and practical effects of different presentation methods as well as how to develop metrics for assessing impact. Work centers on readings, visualization exercises, and a final project. Students taking graduate version complete additional assignments."}, "Digital Humanities: Topics, Techniques, and Technologies": {"title": "Digital Humanities: Topics, Techniques, and Technologies", "number": "CMS.833", "description": "Examines theory and practice of using computational methods in the emerging field of digital humanities. Develops an understanding of key digital humanities concepts such as data representation, digital archives, information visualization, and user interaction through the study of contemporary research in conjunction with working on real-world projects for scholarly, educational, and public needs. Students create prototypes, write design papers, and conduct user studies. Some programming and design experience is helpful but not required. Students taking graduate version complete additional assignments."}, "Designing Interactions": {"title": "Designing Interactions", "number": "CMS.834[J]", "description": "Explores the future of mobile interactions and pervasive computing, taking into consideration design, technological, social and business aspects. Discusses theoretical works on human-computer interaction, mobile media and interaction design, and covers research and design methods. Students work in multidisciplinary teams and participate in user-centric design projects aimed to study, imagine and prototype concepts illustrating the future of mobile applications and ubiquitous computing. Students taking graduate version complete additional assignments. Repeatable for credit with permission of instructor. Limited to 12."}, "Current Debates in Media": {"title": "Current Debates in Media", "number": "CMS.901", "description": "Addresses important, current debates in media with in-depth discussion of popular perceptions and policy implications. Students use multiple perspectives to analyze texts emanating from these debates, and present their findings through discussions and reports. Explores emerging topics (e.g., piracy and IP regimes, net neutrality, media effects, social media and social change, and changing literacies) across media forms and from various historical, transcultural, and methodological perspectives. Examines the framing of these issues, their ethical and policy implications, and strategies for repositioning the debate. Students taking graduate version complete additional assignments."}, "Undergraduate Thesis in Comparative Media Studies": {"title": "Undergraduate Thesis in Comparative Media Studies", "number": "CMS.THU", "description": "The CMS Undergraduate Thesis is a substantial research project or comparable exercise. A written thesis ranges in length from 35 to 50 pages. Digital projects are assessed on the quality of research and argumentation, as well as presentation, and must include a substantial written component. Student gives an oral presentation of his/her thesis at the end of the term. Thesis is not required for CMS majors."}, "Media Theories and Methods I": {"title": "Media Theories and Methods I", "number": "CMS.790", "description": "An advanced introduction to core theoretical and methodological issues in comparative media studies. Topics covered typically include the nature of theory, the gathering and evaluation of evidence, the relationship of media to reality, formal approaches to media analysis, the ethnographic documentation of media audiences, cultural hierarchy and taste, modes of production, models of readership and spectatorship."}, "Media Theories and Methods II": {"title": "Media Theories and Methods II", "number": "CMS.791", "description": "An advanced introduction to core theoretical and methodological issues in comparative media studies. Topics covered typically include globalization, propaganda and persuasion, social and political effects of media change, political economy and the institutional analysis of media ownership, online communities, privacy and intellectual property, and the role of news and information within democratic cultures."}, "Major Media Texts": {"title": "Major Media Texts", "number": "CMS.796", "description": "Intensive close study and analysis of historically significant media \"texts\" that have been considered landmarks or have sustained extensive critical and scholarly discussion. Such texts may include oral epic, story cycles, plays, novels, films, opera, television drama and digital works. Emphasizes close reading from a variety of contextual and aesthetic perspectives. Syllabus varies each year, and may be organized around works that have launched new modes and genres, works that reflect upon their own media practices, or on stories that migrate from one medium to another. At least one of the assigned texts is collaboratively taught, and visiting lectures and discussions are a regular feature of the subject."}, "Media in Transition": {"title": "Media in Transition", "number": "CMS.801", "description": "Centers on historical eras in which the form and function of media technologies were radically transformed. Includes consideration of the \"Gutenberg Revolution,\" the rise of modern mass media, and the \"digital revolution,\" among other case studies of media transformation and cultural change. Readings in cultural and social history and historiographic method."}, "Studies in Film": {"title": "Studies in Film", "number": "CMS.830", "description": "Intensive study of films from particular periods, genres, or directors. Instruction and practice in oral and written communication provided. Previous topics include Global Horror Film, Film Remixes, Film Narrative, and Heroic Cinema. Students taking graduate version complete different assignments. Limited to 12."}, "Film, Music, and Social Change: Intersections of Media and Society": {"title": "Film, Music, and Social Change: Intersections of Media and Society", "number": "CMS.837", "description": "Examines films from the 1950s onward that document music subcultures and moments of social upheaval. Combines screening films about free jazz, glam rock, punk, reggae, hip-hop, and other genres with an examination of critical/scholarly writings to illuminate the connections between film, popular music, and processes of social change. Students critique each film in terms of the social, political, and cultural world it documents, and the historical context and effects of the film's reception. Students taking graduate version complete additional assignments. Limited to 18."}, "Playful and Social Interaction Design Exploration": {"title": "Playful and Social Interaction Design Exploration", "number": "CMS.842", "description": "Explores the role of technology in relation to playful and social interaction. Deepens understanding of the potential and limitations of iterative design and rapid prototyping used as research methods. Familiarizes students with the theoretical foundations of interaction design and explorative design research, as well as practice methods applied to working with physical and digital design materials."}, "Exploratory Programming for the Arts and Humanities": {"title": "Exploratory Programming for the Arts and Humanities", "number": "CMS.844", "description": "Introduces programming through \"free projects\" in which students choose (or discover) the direction of their project through exploration. Covers the fundamentals of programming and how to develop a programming practice. Students complete analytical and generative projects, using different media. Examines how to think with computation, how computation and media interact, and how computation can be understood as a part of culture. No background in programming required. Limited to 18."}, "Apocalyptic Storytelling": {"title": "Apocalyptic Storytelling", "number": "CMS.848", "description": "Focuses on the critical making of apocalyptic, post-apocalyptic and dystopian stories across various narrative media. Considers the long history of Western apocalypticism as well as the uses and abuses of apocalypticism across time. Examines a wide variety of influential texts in order to enhance students' creative and theoretical repertoires. Students create their own apocalyptic stories and present on selected texts. Investigates conventions such as plague, zombies, nuclear destruction, robot uprising, alien invasion, environmental collapse, and supernatural calamities. Considers questions of race, gender, sexuality, colonialism, trauma, memory, witness, and genocide. Intended for students with prior creative writing experience. Students taking graduate version complete additional assignments. Limited to 15."}, "Topics and Methods in 21st Century Journalism": {"title": "Topics and Methods in 21st Century Journalism", "number": "CMS.850", "description": "Gives a broad understanding of what it means to produce journalism today. Evaluates the limitations and strengths of specific types of media, ranging from New York Times stories to Twitter feeds. Provides students with tools to effectively communicate their own work and research to non-specialist audiences. Students submit assignments via an online portal, which mimics the style and substance of an online news source. Students taking graduate version complete additional assignments. Limited to 12."}, "Media in Cultural Context": {"title": "Media in Cultural Context", "number": "CMS.871", "description": "Seminar uses case studies to examine specific media or media configurations and the larger social, cultural, economic, political, or technological contexts within which they operate. Organized around recurring themes in media history, as well as specific genres, movements, media, or historical moments. Previously taught topics include Gendered Genres: Horror and Maternal Melodramas; Comics, Cartoons, and Graphic Storytelling; and Exploring Children's Culture. Students taking graduate version complete additional assignments. Approved for credit in Women's and Gender Studies when content meets the requirements for subjects in that program. Limited to 12."}, "Visualizing Japan in the Modern World": {"title": "Visualizing Japan in the Modern World", "number": "CMS.874[J]", "description": "Studies how visual images shape the identity of peoples, cultures, and events in Japan. Uses visuals from major collections in the US and Japan to introduce the conceptual and practical issues involved in \"visualizing cultures.\" Projects look at American and Japanese graphics depicting contacts between Japan and the West in the 19th and early 20th centuries. Taught in English using material and features of edX subject, including videos and online discussion. Enrollment limited."}, "Understanding Television": {"title": "Understanding Television", "number": "CMS.915", "description": "A cultural approach to television's evolution as a technology and system of representation. Considers television as a system of storytelling and mythmaking, and as a cultural practice studied from anthropological, literary, and cinematic perspectives. Focuses on prime-time commercial broadcasting, the medium's technological and economic history, and theoretical perspectives. Considerable television viewing and readings in media theory and cultural interpretation are required. Previously taught topics include American Television: A Cultural History. Students taking graduate version complete additional assignments."}, "Popular Culture and Narrative": {"title": "Popular Culture and Narrative", "number": "CMS.920", "description": "Examines relationships between popular culture and art, focusing on problems of evaluation and audience, and the uses of different media within a broader social context. Typically treats a range of narrative and dramatic works as well as films. Previously taught topics include Elements of Style; Gender, Sexuality and Popular Narrative. Students taking graduate version complete additional assignments. Approved for credit in Women's and Gender Studies when content meets the requirements for subjects in that program. May be repeated for credit with permission of instructor."}, "Film Music": {"title": "Film Music", "number": "CMS.925", "description": "Surveys styles and dramatic functions of music for silent films of the 1910s-20s, and music in sound films from the 1930s to the present. Close attention given to landmark scores by American and European composers, including Korngold, Steiner, Rozsa, Prokofiev, Copland, Herrmann, Rota, Morricone, and Williams. Subsidiary topics include new trends in contemporary film-scoring, pop scores, the impact of electronics, and specialized genres (e.g., animation). Students taking the graduate version complete different assignments. Some background in the study of film and/or music is expected."}}