{"Re-create Experiments from History: Inform the Future from the Past": {"title": "Re-create Experiments from History: Inform the Future from the Past", "number": "EC.090", "description": "Provides perspective for thinking about the future through the study of historical physical science and historically significant experiments. Designed to build awareness of the unexpected through both observation of the sky and lab activities that focus on light, electricity, and motion. Labs are complemented by museum and site visits; readings include accounts by Galileo, Archimedes, and other historical observers. Individual and team assignments provide opportunities to develop skills in observation, exploration, and evaluation. Students must keep an observing notebook and write a reflective paper; students taking the graduate version complete additional assignments."}, "The Start-up Experience at MIT": {"title": "The Start-up Experience at MIT", "number": "EC.074", "description": "Explores some of the critical actions in starting up a technology-based business, including concept generation, searching prior art and patents, protecting intellectual property, founders agreements, forming and building teams, and work-life balance. Students review case studies and complete exercises that develop practicable knowledge in these areas.  Each student keeps an \"idea log book,\" which includes critical assessments of each case study, to be presented at the end of the term. First in a two-part series (seminars do not have to be taken sequentially; see EC.075 in spring term). Preference to undergraduates; open to graduate students with permission of advisor."}, "Starting Up New Technology-Based Business Enterprises at MIT": {"title": "Starting Up New Technology-Based Business Enterprises at MIT", "number": "EC.075", "description": "Seminar participants define and study the development stages of new enterprises at MIT, from the exciting moment a new idea for a tech product or service is realized, through to selling, customer support, and the next new idea. Follows the history of successful MIT spin-off companies with attention to the people (and their ideas) behind the start-up. Students attend MIT technology and science start-up case presentations given by individuals and teams working from zero-stage, and by partners in going concerns of historical relevance to the Institute and the economy.  Second in a two-part series (seminars do not have to be taken sequentially; see EC.074 in fall term)."}, "Introduction to Digital Electronics": {"title": "Introduction to Digital Electronics", "number": "EC.110[J]", "description": "Design your own circuits for times when off-the-shelf solutions are not available. Seminar begins with assembly of a utility board. Weekly labs cover digital logic gates, memory elements, and finite-state machine design. Seminar concludes with a team-based design project. Preference given to freshmen. Maximum of 10 students per term, lottery at the first class session if oversubscribed."}, "Electronics Project Laboratory": {"title": "Electronics Project Laboratory", "number": "EC.120[J]", "description": "Intuition-based introduction to electronics, electronic components and test equipment such as oscilloscopes, meters (voltage, resistance inductance, capacitance, etc.), and signal generators. Emphasizes individual instruction and development of skills, such as soldering, assembly, and troubleshooting. Students design, build, and keep a small electronics project to put their new knowledge into practice. Intended for students with little or no previous background in electronics. Enrollment may be limited."}, "Visualization for Mathematics, Science, and Technology Education": {"title": "Visualization for Mathematics, Science, and Technology Education", "number": "EC.210", "description": "Introduces principles and techniques for visual communication of educational concepts in mathematics, the natural sciences, and engineering. Students complete interactive assignments and class activities in visual arts media, such as photography, illustration, stop-motion and computer animation, and web graphics. A final project in a visual arts medium of the student's choice must meet professional aesthetic standards for visualization; it must also be applicable for teaching and learning concepts in mathematics, science, or engineering in a formal or informal setting. Coursework requires use of production equipment (e.g., photo and video cameras) and software tools (Adobe Creative Suite, Final Cut Studio, and Maya) at the New Media Center. Limited to 18."}, "Digital and Darkroom Imaging": {"title": "Digital and Darkroom Imaging", "number": "EC.305", "description": "Students use both film and digital photography to develop a creative imaging project of their own choice. Develops skills in the use of image editing software to enhance, select, and combine images that the student has taken. Uses the darkroom to develop film for scanning and for chemical enlargement. Discusses topics such as the camera, composition, lighting, modes and formats, image compression, and halftone and dye sublimation printing. Students are expected to produce a duplicate set of black and white and/or color prints, along with a writeup and digital copy as the project output."}, "Creative Imaging": {"title": "Creative Imaging", "number": "EC.310", "description": "Focuses on film and digital photography. Develops skill in the use of chemical darkrooms, scanners, digital printers and cameras to create striking still images capable of evoking strong emotional and intellectual responses from a viewer. Emphasizes the interplay between classical chemical and digital techniques and how they can be used to control the use of lighting, color, depth, and composition in an image. Students present their intermediate assignments to the class for critical discussion; at the end of the term, they submit a substantive project presenting their own creative images for critique and evaluation."}, "D-Lab: Field Study": {"title": "D-Lab: Field Study", "number": "EC.790", "description": "Provides the opportunity to gain direct fieldwork experience in a global context. Subject spans three-four weeks in which students continue work from a prior D-Lab subject. Students work directly with international community partners to find solutions to real world problems, focusing on one or more issues in education, design, or public service. Group presentations and written reflection required."}, "D-Lab: Development": {"title": "D-Lab: Development", "number": "EC.781[J]", "description": "Issues in international development, appropriate technology and project implementation addressed through lectures, case studies, guest speakers and laboratory exercises. Students form project teams to partner with community organizations in developing countries, and formulate plans for an optional IAP site visit. (Previous field sites include Ghana, Brazil, Honduras and India.) Recitation sections focus on specific project implementation, and include cultural, social, political, environmental and economic overviews of the target countries as well as an introduction to the local languages. Enrollment limited by lottery; must attend first class session."}, "Cross-Cultural Investigations: Technology and Development": {"title": "Cross-Cultural Investigations: Technology and Development", "number": "EC.792[J]", "description": "Enhances cross-cultural understanding through discussion of practical, ethical, and epistemological issues in conducting social science and applied research in foreign countries or unfamiliar communities. Includes research practicum to help students develop interviewing, participant-observation, and other qualitative research skills, as well as critical discussion of case studies. Open to all interested students, but intended particularly for those planning to undertake exploratory research or applied work abroad. Students taking graduate version complete additional assignments."}, "Introduction to Energy in Global Development": {"title": "Introduction to Energy in Global Development", "number": "EC.791", "description": "Provides an overview of thermodynamics and heat transfer through an international development context to impart energy literacy and common sense applications. Students survey various alternative energy technologies and strategies for implementation in developing countries. Focuses on compact, robust, low-cost systems for generating electrical power and meeting household-level needs. Labs reinforce lecture material through deconstruction, system assembly, and sensor installation to track performance. Team projects involve activities, such as researching community needs, assessing the suitability of specific technologies, continuing the development of ongoing projects, and assessing the efficacy and impacts of existing projects. Optional summer fieldwork may be available. Students taking graduate version complete additional assignments. Enrollment limited by lottery; must attend first class session."}, "D-Lab: Energy II": {"title": "D-Lab: Energy II", "number": "EC.782", "description": "Engages students in advancing the United Nations' Sustainable Development Goal 7, which seeks to ensure access to affordable, reliable, sustainable, and modern energy systems, through community-based approaches. Teams work on off-grid energy projects that focus on lighting, cooking, indoor heating, agricultural productivity, or other solutions to advance fieldwork with pre-selected community partners. Working at various stages along D-Lab's Off-Grid Energy Roadmap, teams consider needs assessment, technology and business model identification, and implementation strategies. Project work includes combinations of analysis, design, prototyping, and implementation. Optional January site visits may be available to test and implement projects. Students taking graduate version complete additional assignments. Limited to 20."}, "D-Lab Schools: Building Technology Laboratory": {"title": "D-Lab Schools: Building Technology Laboratory", "number": "EC.713[J]", "description": "Focuses on the design, analysis, and application of technologies that support the construction of less expensive and better performing schools in developing countries. Prepares students to design or retrofit school buildings in partnership with local communities and NGOs. Strategies covered include daylighting, passive heating and cooling, improved indoor air quality via natural ventilation, appropriate material selection, and structural design. Investigations are based on application of engineering fundamentals, experiments and simulations. Case studies illustrate the role of technologies in reducing barriers to improved education."}, "D-Lab: Water, Sanitation and Hygiene": {"title": "D-Lab: Water, Sanitation and Hygiene", "number": "EC.715", "description": "Focuses on disseminating Water, Sanitation and Hygiene (WASH) or water/environment innovations in developing countries and underserved communities worldwide. Structured around field-based learning, case studies, lectures and videos in which teams propose an idea and are mentored through the process of bringing that innovation to fruition. Emphasizes core WASH and water/environment principles, culture-specific solutions, tools for start-ups, appropriate and sustainable technologies, behavior change, social marketing, building partnerships, and the theory and practice of innovation diffusion. Term project entails entering the IDEAS or other competition(s) while implementing a WASH innovation in a specific locale. Guest lectures on specific real-world WASH projects which have been disseminated by MIT faculty, students, alumni, and others. Students taking graduate version complete additional assignments. Limited to 30."}, "D-Lab: Waste": {"title": "D-Lab: Waste", "number": "EC.786", "description": "Uses a multi-disciplinary approach to understand global challenges related to waste. Provides a platform for initiatives such as cradle-to-cradle design, upcycling, diminishment of environmental impacts, and enterprise opportunities for marginalized populations. Studies zero-waste strategies worldwide; examines different models of collection, recycling, waste management, and businesses developed in low-income settings; and researches public policy that supports sustainable, integrated waste management systems. Teams engage in development of solutions around waste-related challenges, in partnership with wastepickers, municipal governments, and private sector and community organizations. Includes guest speakers and field trips, as well as opportunities for IAP or summer travel. Students taking graduate version complete additional assignments."}, "D-Lab: Education and Learning": {"title": "D-Lab: Education and Learning", "number": "EC.787", "description": "Provides an overview of pedagogical theories and core teaching skills that allow students to craft their own K-12 curriculum using the design process. Working in groups and collaborating with an international partner, students use the design process to create a final project for a specific audience that emphasizes hands-on, inclusive, project-based learning. Suitable for students with varying levels of teaching experience. Local fieldwork and K-12 classroom visits are required throughout the semester and international fieldwork may be available to students in the summer. Students taking graduate version complete additional assignments. Limited to 10."}, "D-Lab: Gender and Development": {"title": "D-Lab: Gender and Development", "number": "EC.798", "description": "Explores gender roles, illuminates the power dynamics and root causes of inequality, and provides a framework for understanding gender dynamics. Develops skills to conduct a gender analysis and integrate gender-sensitive strategies into large- and small-scale development solutions. Prompts critical discussion about social, economic, and political conditions that shape gender in development. Begins with exploration of international development in the post-colonial era, using a gender lens, then provides students with the tools to integrate gender-sensitive strategies into international development work, with a particular focus on launching, building and scaling women's ventures. Opportunities may be available for international fieldwork over IAP. Students taking graduate version complete additional assignments. Limited to 12; must attend first class session."}, "D-Lab: Water, Climate Change, and Health": {"title": "D-Lab: Water, Climate Change, and Health", "number": "EC.789", "description": "Addresses mitigation and adaptation to climate change as it pertains to water and health. Focuses on regions where water-borne illness, malnutrition, and vector-borne diseases - problems that will worsen with increasing temperatures and urban overcrowding - represent the top three causes of morbidity and mortality. Includes readings, workshops and films that address water, climate change and health challenges and explore solutions. Field trips include coastal watershed restoration, flood protection, carbon sequestration, and zero-carbon sites in the Boston area. Students complete a term project and/or teach a class, setting the stage for a life-long commitment to communicating climate science to a broad public. Students taking graduate version complete additional assignments."}, "D-Lab: Design": {"title": "D-Lab: Design", "number": "EC.720[J]", "description": "Addresses problems faced by underserved communities with a focus on design, experimentation, and prototyping processes. Particular attention placed on constraints faced when designing for developing countries. Multidisciplinary teams work on long-term projects in collaboration with community partners, field practitioners, and experts in relevant fields. Topics covered include design for affordability, manufacture, sustainability, and strategies for working effectively with community partners and customers. Students may continue projects begun in EC.701. Enrollment limited by lottery; must attend first class session."}, "D-Lab: Mobility Technology for, by, and with People with Disabilities": {"title": "D-Lab: Mobility Technology for, by, and with People with Disabilities", "number": "EC.721", "description": "Students improve wheelchair technology in developing countries by applying sound engineering practices to create appropriate devices. Lectures focus on wheelchair usage, social stigmas, and manufacturing constraints. Includes lectures by third-world community partners, US wheelchair organizations, and MIT faculty. Multidisciplinary student teams conduct term-long wheelchair projects relating to hardware design. Funded opportunities available for travel to implement class projects at wheelchair workshops in the field."}, "Prosthetics for the Developing World": {"title": "Prosthetics for the Developing World", "number": "EC.722", "description": "Introduces the fundamentals of human walking. Provides an overview of different types of gait disabilities and the available technologies that address them. Presents patient perspective as well as current areas of research. Topics focus on lower-limb disabilities, such as polio and above- and below-knee amputation. Covers both developed and developing world techniques for overcoming these disabilities. Includes a term project in which teams of 3 to 5 students manufacture a prototype. Teams meet outside of class and work with a TA (project mentor) to research, design, prototype, and test a solution. Projects focus on low-cost orthotic and prosthetic knee designs for the developing world, as specified by partner organizations in India and Guatemala."}, "D-Lab: Smallholder Agriculture": {"title": "D-Lab: Smallholder Agriculture", "number": "EC.784", "description": "Provides an overview of the scientific, social, and economic context of smallholder farmers in developing countries. Covers the scientific basis and environmental impacts of agriculture, the dynamics of smallholder farming, social and business systems, and the experience of farmers themselves. Lectures, guest experts, experiential activities, and semester projects with community partners contribute to learning objectives. Opportunities for summer fieldwork may be available. Students taking graduate version complete additional assignments. Limited to 20."}, "D-Lab: Build-Its": {"title": "D-Lab: Build-Its", "number": "EC.796", "description": "Engages students in the creation of \"build-its,\" hands-on pedagogical tools developed by D-Lab to teach workshop and design skills to a diverse audience around the world. Studies principles of experiential learning and successful examples of teaching in makerspaces and innovation centers. Students develop their own build-it, test and evaluate it with local students, and create instructions for its use. Optional travel opportunities exist over the summer to test the build-it at a D-Lab summit or training abroad. Students taking graduate version complete additional assignments. Limited to 16."}, "D-Lab: Design for Scale": {"title": "D-Lab: Design for Scale", "number": "EC.729[J]", "description": "Focuses on product development of technologies for people in less industrialized markets. Students work in interdisciplinary teams to develop previously established prototypes or technologies towards manufacturing-ready product designs. Topics are presented within the context of the developing world and include technology feasibility and scalability assessment; value chain analysis; product specification; design for affordability, manufacturability, usability, and desirability; and product testing and manufacturing at various scales. Lessons are experiential and case study-based; taught by instructors with field experience and by industry experts from product development consulting firms and the consumer electronics industry."}, "Development Ventures": {"title": "Development Ventures", "number": "EC.731[J]", "description": "Seminar on founding, financing, and building entrepreneurial ventures in developing nations. Challenges students to craft enduring and economically viable solutions to the problems faced by these countries.  Cases illustrate examples of both successful and failed businesses, and the difficulties in deploying and diffusing products and services through entrepreneurial action.  Explores a range of established and emerging business models, as well as new business opportunities enabled by innovations emerging from MIT labs and beyond.  Students develop a business plan executive summary suitable for submission in the MIT $100K Entrepreneurship Competition's Accelerate Contest or MIT IDEAS."}, "D-Lab: Supply Chains": {"title": "D-Lab: Supply Chains", "number": "EC.733[J]", "description": "Introduces concepts of supply chain design and planning with a focus on supply chains for products destined to improve quality of life in developing countries. Topics include demand estimation, process analysis and improvement, facility location and capacity planning, inventory management, and supply chain coordination. Also covers issues specific to emerging markets, such as sustainable supply chains, choice of distribution channels, and how to account for the value-adding role of a supply chain. Students conduct D-Lab-based projects on supply chain design or improvement."}, "D-Lab: Inclusive Economies": {"title": "D-Lab: Inclusive Economies", "number": "EC.740", "description": "Explores how innovations and market mechanisms can benefit humanity by rallying impact investments, engaging participants cooperatively, boosting equity and resilience, and broadening prosperity. Examines the ideas behind, and actions towards, multiple inclusive economic mechanisms and approaches. Students review and analyze the competing worldviews and historical pathways that led to the current dominant economic modalities, and both theoretical and empirical criticisms. Includes case studies developing alternative opportunities, modifications, and/or improvements to crafting circular economies and reinforcing local economies. Team projects focus on the facilitation of inclusive economy models in partnership with communities in Latin America or Africa. Optional project-focused travel may be available over IAP. Limited to 12."}, "Design for Complex Environmental Issues: Building Solutions and Communicating Ideas": {"title": "Design for Complex Environmental Issues: Building Solutions and Communicating Ideas", "number": "EC.746[J]", "description": "Students work in small groups, under the guidance of researchers from MIT, to pursue specific aspects of the  year's Terrascope problem. Teams design and build prototypes, graphic displays and other tools to communicate their findings and display them in a Bazaar of Ideas open to the MIT community.  Some teams develop particular solutions, others work to provide deeper understanding of the issues, and others focus on ways to communicate these ideas with the general public. Students' work is evaluated by independent experts. Offers students an opportunity to develop ideas from the fall semester and to work in labs across MIT. Limited to first-year students."}, "Humanitarian Innovation: Design for Relief, Rebuilding, and Recovery": {"title": "Humanitarian Innovation: Design for Relief, Rebuilding, and Recovery", "number": "EC.785", "description": "Explores the role innovation can and does play in how humanitarian aid is provided, and how it can impact people, products, and processes. Provides a fundamental background in the history and practice of humanitarian aid. Considers the various ways that design can be used to enhance aid, such as product and system design for affected populations, co-creation with affected populations, and capacity building to promote design by refugees and the displaced. Case studies and projects examine protracted displacement as well as recovery and resettlement, including efforts in Colombia, Lebanon, Nepal, Sudan, and Uganda. Potential for students to travel over the summer to partner communities."}, "D-Lab: Independent Project": {"title": "D-Lab: Independent Project", "number": "EC.780", "description": "Opportunity for independent study under regular supervision by a staff member. Projects require prior approval, as well as a written proposal and final report. Students work with international community partners to continue developing projects, focusing on one or more issues in education, design, or public service. Final presentations and written reflection required. May be repeated for credit for a maximum of 12 units."}, "D-Lab: Field Research": {"title": "D-Lab: Field Research", "number": "EC.788", "description": "Combines hands-on methods for conducting field research with exploration of questions that continue to challenge practitioners, donors, policymakers and researchers in international development. Designed for students preparing to conduct field-based research for theses, product design project, or development ventures. Practices key research skills particularly applicable to conducting research involving people and communities in the context of development. Limited to 16."}, "Undergraduate Research": {"title": "Undergraduate Research", "number": "EC.URG", "description": "Provides perspective for thinking about the future through the study of historical physical science and historically significant experiments. Designed to build awareness of the unexpected through both observation of the sky and lab activities that focus on light, electricity, and motion. Labs are complemented by museum and site visits; readings include accounts by Galileo, Archimedes, and other historical observers. Individual and team assignments provide opportunities to develop skills in observation, exploration, and evaluation. Students must keep an observing notebook and write a reflective paper; students taking the graduate version complete additional assignments."}, "Special Subject at the Edgerton Center": {"title": "Special Subject at the Edgerton Center", "number": "EC.S13", "description": "Seminar combining lectures and lab run by students and academic staff at the Edgerton Center. Students explore specialized electronics, robotics, or mechanical design and fabrication topics not offered in the regular curriculum; classes range from beginner level to more advanced. Some offerings may be taught in an intensive fashion (meeting for up to several times a week for four weeks). Up to three sequential seminars may be offered per semester, covering a different topic each time. Students can take one or all of the seminars."}}