{"Foundations of System Design and Management": {"title": "Foundations of System Design and Management", "number": "EM.411", "description": "Presents the foundations of systems architecture, systems engineering and project management in an integrated format, through a synchronized combination of in-class discussion, industrial guest speakers, team projects, and individual assignments. Topics include stakeholder analysis, project planning and monitoring, requirements definition, concept generation and selection, complexity management, system integration, verification and validation, cost modeling, systems safety, organizational design and effective teamwork, risk management, and leadership styles. Restricted to students in the SDM program."}, "Foundations of System Design and Management II": {"title": "Foundations of System Design and Management II", "number": "EM.412", "description": "Deepens the foundations of systems architecture, systems engineering and project management introduced in ESD.411 though a synchronized combination of lectures, recitations, opportunity sets, guest speakers, and team projects. Topics emphasize the transition from early conceptual design to detailed design and system integration. Features a technology showcase and project forum where students, faculty and company sponsors meet to discuss and select projects for ESD.413. Includes team-based exercises and design challenges. Restricted to students in the SDM program."}, "Foundations of System Design and Management III": {"title": "Foundations of System Design and Management III", "number": "EM.413", "description": "Presents advanced concepts in systems architecture, systems engineering and project management in an integrated manner through lectures, recitations, opportunity sets, guest lectures, and a semester-long team project. Topics emphasize complexity management, systems integration, verification, validation, and lifecycle management. Specific lifecycle properties addressed include quality, safety, robustness, resilience, flexibility and evolvability of systems over time. Additional topics include monitoring and control, the rework cycle, managing portfolios and programs of projects in a multi-cultural and global context, and managing product families and platforms. Restricted to students in the SDM program."}, "SDM Certificate Capstone": {"title": "SDM Certificate Capstone", "number": "EM.421", "description": "Practical application of systems management problems within a real company. Teams of 1-4 students are matched with a company to work on a project in which they identify systems challenges and devise methods for solving problems utilizing the system architecture, systems engineering and project management methodology covered in the EM core sequence. Mentors and sponsors are identified for each team. Restricted to System Design and Management Certificate students."}, "Integrated Design Lab I": {"title": "Integrated Design Lab I", "number": "EM.441", "description": "Presents fundamentals of the integrated design and product development process. Covers methods relevant at each stage of the process; students apply them in a series of design projects. Topics include stakeholder identification, customer engagement and ethnographic methods, concept generation and selection, project planning, manufacturing methods, supply systems, cost modeling, sustainability, and safety. Restricted to Integrated Design and Management (IDM) students."}, "Integrated Design Lab II": {"title": "Integrated Design Lab II", "number": "EM.442", "description": "Presents advanced topics in integrated design and product development. Students pursue a product development project as a case study for understanding how teams work together to define and test a new product. Provides exposure to the state-of-the-art in product definition, product architectures, market testing, competitive analysis, product planning strategy, business case construction, and life cycle design. Students apply their previously acquired product development knowledge and engage in ongoing reflection in an action-oriented setting. Restricted to Integrated Design and Management (IDM) students."}, "Internship Experience": {"title": "Internship Experience", "number": "EM.451", "description": "Provides insight into the challenges of an organization that develops products or systems. Before enrolling each student must have a department approved internship opportunity. At the end of the internship, students deliver a report, for evaluation by the sponsoring faculty member, documenting ways that the organization addresses product or system development issues and applies the methods taught in the SDM or IDM core. Intended for students who have completed the SDM or IDM core course sequence."}}