{"Production of Educational Videos:  Skills for Communicating Academic and Professional Content": {"title": "Production of Educational Videos:  Skills for Communicating Academic and Professional Content", "number": "ES.333[J]", "description": "Develops communication and media skills through the production of educational videos. Students conceive, plan, script, shoot and edit video content to teach elements of MIT's curriculum. Each student creates a series of short videos that concisely explains and contextualizes specific problems of importance to disciplines at MIT, especially physics, math, chemistry, biology, or the humanities. The resulting videos present these problems through compelling use of illustrations, demonstrations, animations, and commentary, all from the student's perspective. Empowers students specifically to communicate their MIT expertise to communities of learners and generally to reach broad audiences with quality, accessible online content. Limited to 12; preference to students in ESG."}, "Engineering Communication in Context": {"title": "Engineering Communication in Context", "number": "ES.729[J]", "description": "Introduces writing, graphics, meetings, reading, oral presentation, collaboration, and design as tools for product development. Students work in teams to conceive, design, prototype, and evaluate energy-related mechanical engineering products. Instruction focuses on communication tasks that are integral to the design process, including design notebooks, email, informal and formal presentations, meeting etiquette, literature searches, white papers, proposals, and reports. Other assignments address the cultural situation of engineers and engineering in the world at large. Limited to 18; preference to ESG students."}, "Philosophy of Love": {"title": "Philosophy of Love", "number": "ES.112", "description": "Explores the nature of love through works of philosophy, literature, film, poetry, and individual experience. Investigates the distinction among eros (desiring or appreciative love), philia (mutuality), and agape (love as pure giving). Students discuss ideas of love as a feeling, an action, a species of 'knowing someone,' or a way to give or take. Authors include Plato, Kant, Buber, D. H. Lawrence, Rumi, and Aristotle. Preference to students in ESG and Concourse."}, "Ancient Greek Philosophy and Mathematics": {"title": "Ancient Greek Philosophy and Mathematics", "number": "ES.113", "description": "Explores the relationship between ancient Greek philosophy and mathematics. Investigates how ideas of definition, reason, argument and proof, rationality/irrationality, number, quality and quantity, truth, and even the idea of an idea were shaped by the interplay of philosophic and mathematical inquiry. Examines how discovery of the incommensurability of magnitudes challenged the Greek presumption that the cosmos is fully understandable. Explores the influence of mathematics on ancient Greek ethical theories. Authors: Euclid, Plato, Aristotle, Nicomachus, Theon of Smyrna, Bacon, Descartes, Dedekind, and Newton. Preference to students in Concourse and ESG."}, "Non-violence as a Way of Life": {"title": "Non-violence as a Way of Life", "number": "ES.114", "description": "Addresses the philosophical question of what a non-violent life entails. Investigates its ethical dimensions and challenges, and considers whether we can derive a comprehensive moral theory from the principle of non-violence. Discusses the issues of lying, the duty to forgive, non-violent communication, the ethics of our relationship to anger, the possibility of loving enemies, and the ethics of punishment and rehabilitation.  Includes readings from primary exponents of non-violence, such as Tolstoy, Gandhi and King."}, "Philosophy of Love - MIT Prison Initiative": {"title": "Philosophy of Love - MIT Prison Initiative", "number": "ES.9112", "description": "Explores the nature of love through works of philosophy, literature, film, poetry, and individual experience. Investigates the distinction among eros (desiring or appreciative love), philia (mutuality), and agape (love as pure giving). Students discuss ideas of love as a feeling, an action, a species of 'knowing someone,' or a way to give or take. Authors include Plato, Kant, Buber, D. H. Lawrence, Rumi, and Aristotle. Taught inside a secure Massachusetts correctional facility with a mix of MIT students and incarcerated students. Limited to 10."}, "Non-violence as a Way of Life - MIT Prison Initiative": {"title": "Non-violence as a Way of Life - MIT Prison Initiative", "number": "ES.9114", "description": "Addresses the philosophical question of what a non-violent life entails. Investigates its ethical dimensions and challenges, and considers whether we can derive a comprehensive moral theory from the principle of non-violence. Discusses the issues of lying, the duty to forgive, non-violent communication, the ethics of our relationship to anger, the possibility of loving enemies, and the ethics of punishment and rehabilitation.  Includes readings from primary exponents of non-violence, such as Tolstoy, Gandhi and King. Taught inside a secure Massachusetts correctional facility with a mix of MIT students and incarcerated students. Limited to 10."}, "Chemistry of Sports: Understanding How Exercise Affects Your Body": {"title": "Chemistry of Sports: Understanding How Exercise Affects Your Body", "number": "ES.010", "description": "Students apply chemistry knowledge to physical fitness through the study of three sports: swimming, cycling, and running. Classroom component focuses on nutrition, exercise, anatomy, physiology, and the chemistry of supplements and sports equipment. Laboratory component focuses on training for and completion of triathlon competition. Students may earn up to 2 PE points during the term by attending supervised triathlon training workouts. Preference to students in ESG."}, "ESG Undergraduate Teaching": {"title": "ESG Undergraduate Teaching", "number": "ES.200", "description": "An opportunity to assist in the teaching of subjects in ESG in biology, chemistry, humanities and social sciences, mathematics, and physics. Student instructors may be involved in grading, running problemsolving sessions, or teaching classes depending on experience and interest. Qualified students may also develop and teach undergraduate seminars under the supervision of an appropriate faculty or staff member. Student instructors meet weekly with staff to discuss their teaching and cover a variety of topics related to effective teaching techniques. Limited to students in ESG."}}