{"Human Functional Anatomy": {"title": "Human Functional Anatomy", "number": "HST.011", "description": "Lectures, detailed laboratory dissections, and prosections provide a thorough exploration of the gross structure and function of the human body. Fundamental principles of bioengineering are employed to promote analytical approaches to understanding the body's design. The embryology of major organ systems is presented, together with certain references to phylogenetic development, as a basis for comprehending anatomical complexity. Correlation clinics stress both normal and abnormal functions of the body and present evolving knowledge of genes responsible for normal and abnormal anatomy. Lecturers focus on current problems in organ system research. Only HST students may register under HST.010, graded P/D/F. Lab fee. Enrollment restricted to graduate students."}, "MATLAB for Medicine": {"title": "MATLAB for Medicine", "number": "HST.015", "description": "Practical introduction to use of quantitative methods in medicine and health research. Each session covers a different topic in quantitative techniques, provides an application to medicine, and includes a modeling activity using MATLAB. Students also complete problem sets. Restricted to first year HST MD students."}, "Medical Decision Analysis and Probabilistic Medical Inference": {"title": "Medical Decision Analysis and Probabilistic Medical Inference", "number": "HST.192", "description": "Teaches the essentials of quantitative diagnostic reasoning and medical decision analysis. Guides participants through the process of choosing an appropriate contemporary medical problem in which risk-benefit tradeoffs play a prominent role, conducting a decision analysis, and ultimately publishing the results in a medical journal.  Topics include decision trees, influence diagrams, Markov decision models and Monte Carlo simulation, methods for quantifying patient values, Bayesian inference, decision thresholds, and the cognitive science of medical decision making. HST.191 recommended. Limited to 8; preference to HST students."}, "Introduction to Clinical Medicine": {"title": "Introduction to Clinical Medicine", "number": "HST.200", "description": "Intensive preparation for clinical clerkships that introduces the basic skills involved in examination of the patient in addition to history taking and the patient interview. Provides exposure to clinical problems in medicine, surgery, and pediatrics. Students report their findings through history taking and oral presentations. Restricted to MD program students."}, "Introduction to Clinical Medicine and Medical Engineering I": {"title": "Introduction to Clinical Medicine and Medical Engineering I", "number": "HST.201", "description": "Develop skills in patient interviewing and physical examination; become proficient at organizing and communicating clinical information in both written and oral forms; begin integrating history, physical, and laboratory data with pathophysiologic principles; and become familiar with the clinical decision-making process and broad economic, ethical, and sociological issues involved in patient care. There are two sections: one at Mount Auburn Hospital and one at West Roxbury VA Hospital, subsequent registration into HST.202 must be continued at the same hospital as HST.201. Restricted to MEMP students."}, "Introduction to Clinical Medicine and Medical Engineering II": {"title": "Introduction to Clinical Medicine and Medical Engineering II", "number": "HST.202", "description": "Strengthens the skills developed in HST.201 through a six-week clerkship in medicine at a Harvard-affiliated teaching hospital. Students serve as full-time members of a ward team and participate in longitudinal patient care. In addition, students participate in regularly scheduled teaching conferences focused on principles of patient management. Restricted to MEMP students."}, "Biomedical Inventions: Clinical Introduction": {"title": "Biomedical Inventions: Clinical Introduction", "number": "HST.211", "description": "Provides students with an understanding of modern biomedicine. Explores the clinical areas where medical practice and biomedical enterprise intersect. Hear and interact with academic physicians engaged in care and treatment of patients, in the wards, ICUs, ORs and outpatient areas, and develop the knowledge base needed to obtain elective clinical experiences. Learn to interact with patients and clinicians. Focus is on the various needs of medical specialties, both device, IT and pharma to better treat common medical diseases."}, "Biomedical Inventions: Clinical Experience and Selected Success Analysis": {"title": "Biomedical Inventions: Clinical Experience and Selected Success Analysis", "number": "HST.212", "description": "Provides students with a survey of key biomedical research needs by lecture-discussions and facilitating interaction with academic-clinicians and scientists active in medical care/research. Both drug and technology development in the various medical and surgical specialties are examined. Students develop the knowledge base needed to obtain elective clinical experiences. Unsolved clinical problems are sought by each student in a biomedical area of their interest and presented to the class. Interactions with academic physicians who have successfully developed technologies and drugs that are approved by the FDA and in widespread clinical use. How, where, when and why biomedical enterprise and medical practice can successfully intersect is explored. Students can interact with academic physicians engaged in the development of novel technology and drugs, analyze successes and autopsy failed biomedical enterprises."}, "Introduction to the Care of Patients": {"title": "Introduction to the Care of Patients", "number": "HST.220", "description": "Elective subject for HST/MD candidates only. Provides an introduction to the care of patients through opportunities to observe and participate in doctor-patient interaction in an outpatient, office-based environment, and through patient-oriented seminars. Students are exposed to some of the practical realities of providing patient care. Topics include basic interviewing, issues of ethics and confidentiality, and other aspects of the doctor-patient relationship. Requirements include regular attendance, and a short paper on patient care. Limited to 15."}, "Translational Medicine Preceptorship": {"title": "Translational Medicine Preceptorship", "number": "HST.240", "description": "Individually designed preceptorship joins together scientific research and clinical medicine. Students devote approximately half of their time to clinical experiences, and the remaining part to scholarly work in basic or clinical science. The two might run concomitantly or in series. Follow a clinical preceptor's daily activity, including aspects of patient care, attending rounds, conferences, and seminars. Research involves formal investigation of a focused and directed issue related to selected clinical area. Final paper required. Limited to students in the GEMS Program."}, "Principles and Practice of Assistive Technology": {"title": "Principles and Practice of Assistive Technology", "number": "HST.420[J]", "description": "Students work closely with people with disabilities to develop assistive and adaptive technologies that help them live more independently. Covers design methods and problem-solving strategies; human factors; human-machine interfaces; community perspectives; social and ethical aspects; and assistive technology for motor, cognitive, perceptual, and age-related impairments. Prior knowledge of one or more of the following areas useful: software; electronics; human-computer interaction; cognitive science; mechanical engineering; control; or MIT hobby shop, MIT PSC, or other relevant independent project experience."}, "Maker Lab: Creating Technologies to Re-invent Health Care": {"title": "Maker Lab: Creating Technologies to Re-invent Health Care", "number": "HST.426", "description": "Students work in teams to design and fabricate do-it-yourself medical technologies, creative biosensors, and health construction kits to create accessible, patient-centered solutions.  Also explores the societal policy implications of democratizing healthcare design. Students acquire skills in prototyping and design strategies for application in both the American healthcare system and in low-resource settings. Labs address paper diagnostics, microcontroller applications, wearable sensors, mobile health application design, and health kit architectures. Local experts lead discussions on ethical management of patient generated data and the benefits of transparent medical device designs. Grading based on completing several design-based projects as well as on communication skills. Preference to undergraduates; open to graduate students with permission of instructor."}, "Infections and Inequalities: Interdisciplinary Perspectives on Global Health": {"title": "Infections and Inequalities: Interdisciplinary Perspectives on Global Health", "number": "HST.431[J]", "description": "Examines case studies in infectious disease outbreaks to demonstrate how human health is a product of multiple determinants, such as biology, sociocultural and historical factors, politics, economic processes, and the environment. Analyzes how structural inequalities render certain populations vulnerable to illness and explores the moral and ethical dimensions of public health and clinical interventions to promote health. Limited to 25."}, "Evolution of an Epidemic (Study Abroad)": {"title": "Evolution of an Epidemic (Study Abroad)", "number": "HST.434", "description": "Examines the medical, scientific, public health and policy responses to a new disease by focusing on the evolution of the AIDS epidemic. Begins with a review of how the disease was first detected in the US, followed by the scientific basis as to how HIV causes profound dysfunction of the body's immune defense mechanisms, the rational development of drugs, the challenge of an HIV vaccine, and how public health and policy decisions have influenced the course of the global epidemic. Conducted in Durban, South Africa. Open to all majors. Application required. Limited to 20; preference to MIT sophomores, juniors, and seniors."}, "Biological Physics": {"title": "Biological Physics", "number": "HST.450[J]", "description": "Designed to provide seniors and first-year graduate students with a quantitative, analytical understanding of selected biological phenomena. Topics include experimental and theoretical basis for the phase boundaries and equation of state of concentrated protein solutions, with application to diseases such as sickle cell anemia and cataract. Protein-ligand binding and linkage and the theory of allosteric regulation of protein function, with application to proteins as stores as transporters in respiration, enzymes in metabolic pathways, membrane receptors, regulators of gene expression, and self-assembling scaffolds. The physics of locomotion and chemoreception in bacteria and the biophysics of vision, including the theory of transparency of the eye, molecular basis of photo reception, and the detection of light as a signal-to-noise discrimination."}, "Statistical Physics in Biology": {"title": "Statistical Physics in Biology", "number": "HST.452[J]", "description": "A survey of problems at the interface of statistical physics and modern biology: bioinformatic methods for extracting information content of DNA; gene finding, sequence comparison, phylogenetic trees. Physical interactions responsible for structure of biopolymers; DNA double helix, secondary structure of RNA, elements of protein folding. Considerations of force, motion, and packaging; protein motors, membranes. Collective behavior of biological elements; cellular networks, neural networks, and evolution."}, "Statistics for Neuroscience Research": {"title": "Statistics for Neuroscience Research", "number": "HST.460[J]", "description": "A survey of statistical methods for neuroscience research. Core topics include introductions to the theory of point processes, the generalized linear model, Monte Carlo methods, Bayesian methods, multivariate methods, time-series analysis, spectral analysis and state-space modeling. Emphasis on developing a firm conceptual understanding of the statistical paradigm and statistical methods primarily through analyses of actual experimental data."}, "Biomedical Signal and Image Processing": {"title": "Biomedical Signal and Image Processing", "number": "HST.582[J]", "description": "Fundamentals of digital signal processing with emphasis on problems in biomedical research and clinical medicine. Basic principles and algorithms for processing both deterministic and random signals. Topics include data acquisition, imaging, filtering, coding, feature extraction, and modeling. Lab projects, performed in MATLAB, provide practical experience in processing physiological data, with examples from cardiology, speech processing, and medical imaging. Lectures cover signal processing topics relevant to the lab exercises, as well as background on the biological signals processed in the labs. Students taking graduate version complete additional assignments."}, "Frontiers in (Bio)Medical Engineering and Physics": {"title": "Frontiers in (Bio)Medical Engineering and Physics", "number": "HST.500", "description": "Provides a framework for mapping research topics at the intersection of medicine and engineering/physics in the Harvard-MIT community and covers the different research areas in MEMP (for example, regenerative biomedical technologies, biomedical imaging and biooptics). Lectures provide fundamental concepts and consider what's hot, and why, in each area. Training in scientific proposal writing (thesis proposals, fellowship applications, or research grant applications) through writing workshops.  Topics include how to structure a novel research project, how to position research within the scientific community, how to present preliminary data effectively, and how to give and respond to peer reviews."}, "Topics in Computational Molecular Biology": {"title": "Topics in Computational Molecular Biology", "number": "HST.504[J]", "description": "Covers current research topics in computational molecular biology. Recent research papers presented from leading conferences such as the International Conference on Computational Molecular Biology (RECOMB) and the Conference on Intelligent Systems for Molecular Biology (ISMB). Topics include original research (both theoretical and experimental) in comparative genomics, sequence and structure analysis, molecular evolution, proteomics, gene expression, transcriptional regulation, biological networks, drug discovery, and privacy. Recent research by course participants also covered. Participants will be expected to present individual projects to the class."}, "Computational Systems Biology": {"title": "Computational Systems Biology", "number": "HST.506[J]", "description": "Presents advanced machine learning and algorithmic approaches for contemporary problems in biology drawing upon recent advances in the literature.   Topics include biological discovery in heterogeneous cellular populations; single cell data analysis; regulatory factor binding; motif discovery; gene expression analysis; regulatory networks (discovery, validation, data integration, protein-protein interactions, signaling, chromatin accessibility analysis); predicting phenotype from genotype; and experimental design (model validation, interpretation of interventions).  Computational methods presented include deep learning, dimensionality reduction, clustering, directed and undirected graphical models, significance testing, Dirichlet processes, and topic models. Multidisciplinary team-oriented final research project."}, "Evolutionary Genomics": {"title": "Evolutionary Genomics", "number": "HST.508", "description": "Develops deep quantitative understanding of basic forces of evolution, molecular evolution, genetic variations and their dynamics in populations, genetics of complex phenotypes, and genome-wide association studies. Applies these foundational concepts to cutting-edge studies in epigenetics, gene regulation and chromatin; cancer genomics and microbiomes.  Modules consist of lectures, journal club discussions of high-impact publications, and guest lectures that provide clinical correlates. Homework assignments and final projects develop practical experience and understanding of genomic data from evolutionary principles."}, "Sensory-Neural Systems: Spatial Orientation from End Organs to Behavior and Adaptation": {"title": "Sensory-Neural Systems: Spatial Orientation from End Organs to Behavior and Adaptation", "number": "HST.514[J]", "description": "Introduces sensory systems,and multi-sensory fusion using the vestibular and spatial orientation systems as a model. Topics range from end organ dynamics to neural responses, to sensory integration, to behavior, and adaptation, with particular application to balance, posture and locomotion under normal gravity and space conditions. Depending upon the background and interests of the students, advanced term project topics might include motion sickness, astronaut adaptation, artificial gravity, lunar surface locomotion, vestibulo-cardiovascular responses, vestibular neural prostheses, or other topics of interest. Background in neuroscience or systems engineering preferred."}, "Aerospace Biomedical and Life Support Engineering": {"title": "Aerospace Biomedical and Life Support Engineering", "number": "HST.515[J]", "description": "Fundamentals of human performance, physiology, and life support impacting engineering design and aerospace systems. Topics include effects of gravity on the muscle, skeletal, cardiovascular, and neurovestibular systems; human/pilot modeling and human/machine design; flight experiment design; and life support engineering for extravehicular activity (EVA). Case studies of current research are presented. Assignments include a design project, quantitative homework sets, and quizzes emphasizing engineering and systems aspects."}, "Sleep and Circadian Clocks: from Biology to Public Health": {"title": "Sleep and Circadian Clocks: from Biology to Public Health", "number": "HST.516", "description": "Explores the neurobiology of the brain's circadian clock that regulates the timing and structure of sleep, its interaction with the periodic environment, and the consequences of circadian disruption (in our 24/7 society) on health, performance, and safety. Students must possess an understanding of biological sciences. Follows Harvard FAS calendar."}, "Human Systems Engineering": {"title": "Human Systems Engineering", "number": "HST.518[J]", "description": "Provides a fundamental understanding of human factors that must be taken into account in the design and engineering of complex aviation, space, and medical systems. Focuses primarily on derivation of human engineering design criteria from sensory, motor, and cognitive sources.  Includes principles of displays, controls and ergonomics, manual control, the nature of human error, basic experimental design, and human-computer interaction in supervisory control settings. Students taking graduate version complete a research project with a final written report and oral presentation."}, "Biomaterials: Tissue Interactions": {"title": "Biomaterials: Tissue Interactions", "number": "HST.522[J]", "description": "Principles of materials science and cell biology underlying the development and implementation of biomaterials for the fabrication of medical devices/implants, including artificial organs and matrices for tissue engineering and regenerative medicine. Employs a conceptual model, the \"unit cell process for analysis of the mechanisms underlying wound healing and tissue remodeling following implantation of biomaterials/devices in various organs, including matrix synthesis, degradation, and contraction. Methodology of tissue and organ regeneration. Discusses methods for biomaterials surface characterization and analysis of protein adsorption on biomaterials. Design of implants and prostheses based on control of biomaterials-tissue interactions. Comparative analysis of intact, biodegradable, and bioreplaceable implants by reference to case studies. Criteria for restoration of physiological function for tissues and organs."}, "Cell-Matrix Mechanics": {"title": "Cell-Matrix Mechanics", "number": "HST.523[J]", "description": "Mechanical forces play a decisive role during development of tissues and organs, during remodeling following injury as well as in normal function. A stress field influences cell function primarily through deformation of the extracellular matrix to which cells are attached. Deformed cells express different biosynthetic activity relative to undeformed cells. The unit cell process paradigm combined with topics in connective tissue mechanics form the basis for discussions of several topics from cell biology, physiology, and medicine."}, "Design of Medical Devices and Implants": {"title": "Design of Medical Devices and Implants", "number": "HST.524[J]", "description": "Solution of clinical problems by use of implants and other medical devices. Systematic use of cell-matrix control volumes. The role of stress analysis in the design process. Anatomic fit: shape and size of implants. Selection of biomaterials. Instrumentation for surgical implantation procedures. Preclinical testing for safety and efficacy: risk/benefit ratio assessment. Evaluation of clinical performance: design of clinical trials. Project materials drawn from orthopedic devices, soft tissue implants, artificial organs, and dental implants."}, "Tumor Microenvironment and Transport Phenomena: A Systems Biology Approach": {"title": "Tumor Microenvironment and Transport Phenomena: A Systems Biology Approach", "number": "HST.525[J]", "description": "Studies the critical role tumor microenvironment plays in the growth, invasion, metastasis and treatment of solid tumors. Applies principles of transport phenomena to develop a systems-level, quantitative understanding of angiogenesis, blood flow, extracellular matrix, stromal cells, local and transiting immune cells, transport and binding of small and large molecules, movement of cancer and immune cells, metastatic process, and response to conventional and emerging therapies, including immunotherapy."}, "Future Medicine: Drug Delivery, Therapeutics, and Diagnostics": {"title": "Future Medicine: Drug Delivery, Therapeutics, and Diagnostics", "number": "HST.526[J]", "description": "Aims to describe the direction and future of medical technology. Introduces pharmaceutics, pharmacology, and conventional medical devices, then transitions to drug delivery systems, mechanical/electric-based and biological/cell-based therapies, and sensors. Covers nano- and micro drug delivery systems, including polymer-drug conjugates, protein therapeutics, liposomes and polymer nanoparticles, viral and non-viral genetic therapy, and tissue engineering. Previous coursework in cell biology and organic chemistry recommended. Students taking graduate version complete additional assignments. Limited to 40."}, "Blood Vessels and Endothelial Phenotypes in Health and Disease": {"title": "Blood Vessels and Endothelial Phenotypes in Health and Disease", "number": "HST.527", "description": "Overview of the endothelium as a model system for understanding biological complexity in health and disease. Emphasis placed on: mechanisms of endothelial cell heterogeneity, including genetic and microenvironmental determinants; the role of endothelial cell trafficking, hemostasis, barrier function, antigen presentation and vasomotor tone; and the role of endothelial cell dysfunction in disease, including tumors, sickle cell disease, pulmonary hypertension, veno-occlusive disease of the liver, thrombotic microangiopathies and xenotransplanation. Additional topics covered include novel proteomic and genomic strategies for mapping endothelial cell phenotypes, evolutionary (Darwinian) principles, and complexity theory. Knowledge of introductory biology or physiology, and biochemistry or molecular biology required."}, "Medical Physics of Proton Radiation Therapy": {"title": "Medical Physics of Proton Radiation Therapy", "number": "HST.531", "description": "Acceleration of protons for radiation therapy; introduction into advanced techniques such as laser acceleration and dielectric wall acceleration. Topics include the interactions of protons with the patient, Monte Carlo simulation, and dose calculation methods; biological aspects of proton therapy, relative biological effectiveness (RBE), and the role of contaminating neutrons; treatment planning and treatment optimization methods, and intensity-modulated proton therapy (IMPT); the effect of organ motion and its compensation by use of image-guided treatment techniques; general dosimetry and advanced"}, "Medical Imaging in Radiation Therapy": {"title": "Medical Imaging in Radiation Therapy", "number": "HST.533", "description": "Introduces imaging concepts and applications used throughout radiation therapy workflows, including magnetic resonance imaging (MRI), positron emission tomography (PET), and computed tomography (CT). Advanced topics include proton imaging modalities, such as prompt gamma imaging and proton radiography/CT. Includes lectures regarding image reconstruction and image registration. Introduces students to open-source medical image computing software (3D Slicer, RTK, and Plastimatch). Includes imaging demonstrations at Massachusetts General Hospital."}, "Tissue Engineering and Regenerative Medicine": {"title": "Tissue Engineering and Regenerative Medicine", "number": "HST.535[J]", "description": "Engineering and clinical leaders present the principles and practice of tissue engineering (TE) and regenerative medicine (RM). Topics include factors that prevent the spontaneous regeneration of tissues/organs in the adult (following traumatic injury, surgical excision, disease, and aging), and molecular and cell-biological mechanisms that can be harnessed for induced regeneration. Presents the principles underlying strategies for employing select biomaterial scaffolds, exogenous cells, soluble regulators, and physical stimuli, for the formation of tissue in vitro (TE) and regeneration of tissues/organs in vivo (RM). Describes the methodologies for producing biomaterial scaffolds and for incorporating cells and regulatory molecules into workable devices. Examples of clinical successes and failures of regenerative devices are analyzed as case studies."}, "Fluids and Diseases": {"title": "Fluids and Diseases", "number": "HST.537[J]", "description": "Designed for students in engineering and the quantitative sciences who want to explore applications of mathematics, physics and fluid dynamics to infectious diseases and health; and for students in epidemiology, environmental health, ecology, medicine, and systems modeling seeking to understand physical and spatial modeling, and the role of fluid dynamics and physical constraints on infectious diseases and pathologies. The first part of the class reviews modeling in epidemiology and data collection, and highlights concepts of spatial modeling and heterogeneity. The remainder highlights multi-scale dynamics, the role of fluids and fluid dynamics in physiology, and pathology in a range of infectious diseases. The laboratory portion entails activities aimed at integrating applied learning with theoretical concepts discussed in lectures and covered in problem sets. Students taking graduate version complete additional assignments."}, "Frontiers of Interdisciplinary Science in Human Health and Disease": {"title": "Frontiers of Interdisciplinary Science in Human Health and Disease", "number": "HST.539[J]", "description": "Introduces major principles, concepts, and clinical applications of biophysics, biophysical chemistry, and systems biology. Emphasizes biological macromolecular interactions, biochemical reaction dynamics, and genomics. Discusses current technological frontiers and areas of active research at the interface of basic and clinical science. Provides integrated, interdisciplinary training and core experimental and computational methods in molecular biochemistry and genomics."}, "Human Physiology": {"title": "Human Physiology", "number": "HST.540[J]", "description": "Comprehensive exploration of human physiology, emphasizing the molecular basis and applied aspects of organ function and regulation in health and disease. Includes a review of cell structure and function, as well as the mechanisms by which the endocrine and nervous systems integrate cellular metabolism. Special emphasis on examining the cardiovascular, pulmonary, gastrointestinal, and renal systems, as well as liver function, drug metabolism, and pharmacogenetics."}, "Cellular Neurophysiology and Computing": {"title": "Cellular Neurophysiology and Computing", "number": "HST.541[J]", "description": "Integrated overview of the biophysics of cells from prokaryotes to neurons, with a focus on mass transport and electrical signal generation across cell membrane. First third of course focuses on mass transport through membranes: diffusion, osmosis, chemically mediated, and active transport. Second third focuses on electrical properties of cells: ion transport to action potential generation and propagation in electrically excitable cells. Synaptic transmission. Electrical properties interpreted via kinetic and molecular properties of single voltage-gated ion channels. Final third focuses on biophysics of synaptic transmission and introduction to neural computing. Laboratory and computer exercises illustrate the concepts. Students taking graduate version complete different assignments."}, "Quantitative Systems Physiology": {"title": "Quantitative Systems Physiology", "number": "HST.542[J]", "description": "Application of the principles of energy and mass flow to major human organ systems. Anatomical, physiological and clinical features of the cardiovascular, respiratory and renal systems. Mechanisms of regulation and homeostasis. Systems, features and devices that are most illuminated by the methods of physical sciences and engineering models. Required laboratory work includes animal studies. Students taking graduate version complete additional assignments."}, "Medical Device Design": {"title": "Medical Device Design", "number": "HST.552[J]", "description": "Provides an intense project-based learning experience around the design of medical devices with foci ranging from mechanical to electro mechanical to electronics.  Projects motivated by real-world clinical challenges provided by sponsors and clinicians who also help mentor teams. Covers the design process, project management, and fundamentals of mechanical and electrical circuit and sensor design. Students work in small teams to execute a substantial term project, with emphasis placed upon developing creative designs - via a deterministic design process - that are developed and optimized using analytical techniques. Instruction and practice in written and oral communication provided. Students taking graduate version complete additional assignments. Enrollment limited."}, "Radiation Biophysics": {"title": "Radiation Biophysics", "number": "HST.560[J]", "description": "Provides a background in sources of radiation with an emphasis on terrestrial and space environments and on industrial production. Discusses experimental approaches to evaluating biological effects resulting from irradiation regimes differing in radiation type, dose and dose-rate.  Effects at the molecular, cellular, organism, and population level are examined.  Literature is reviewed identifying gaps in our understanding of the health effects of radiation, and responses of regulatory bodies to these gaps is discussed. Students taking graduate version complete additional assignments."}, "Pioneering Technologies for Interrogating Complex Biological Systems": {"title": "Pioneering Technologies for Interrogating Complex Biological Systems", "number": "HST.562[J]", "description": "Introduces pioneering technologies in biology and medicine and discusses their underlying biological/molecular/engineering principles. Topics include emerging sample processing technologies, advanced optical imaging modalities, and next-gen molecular phenotyping techniques. Provides practical experience with optical microscopy and 3D phenotyping techniques. Limited to 15."}, "Imaging Biophysics and Clinical Applications": {"title": "Imaging Biophysics and Clinical Applications", "number": "HST.563", "description": "Introduction to the connections and distinctions among  various imaging modalities (x-ray, optical, ultrasound, MRI, PET, SPECT, EEG), common goals of biomedical imaging, broadly defined target of biomedical imaging, and the current practical and economic landscape of biomedical imaging research. Emphasis on applications of imaging research.  Final project consists of student groups writing mock grant applications for  biomedical imaging research project, modeled after an exploratory National Institutes of Health (NIH) grant application."}, "Medical Imaging Sciences and Applications": {"title": "Medical Imaging Sciences and Applications", "number": "HST.565", "description": "Covers the biophysical, biomedical, mathematical and instrumentation basics of positron emission tomography (PET), x-ray and computed tomography (CT), magnetic resonance imaging (MRI), single photon emission tomography (SPECT), optical Imaging and ultrasound. Topics include particles and photon interactions, nuclear counting statistics, gamma cameras, and computed tomography as it pertains to SPECT and PET (including PET-CT, PET-MR, time-of-flight PET), MR physics and various sequences, Optical and Ultrasound physics foundations for imaging. Discusses the clinical applications of PET and MR in molecular imaging of the brain, the heart, and cancer. Includes medical demonstration lectures of SPECT, PET-CT and PET-MR imaging at the Massachusetts General Hospital. Considers the ways in which imaging techniques are rooted in physics, engineering, and mathematics as well as their respective role in anatomic and physiologic/molecular imaging."}, "Topics in Neural Signal Processing": {"title": "Topics in Neural Signal Processing", "number": "HST.576[J]", "description": "Presents signal processing and statistical methods used to study neural systems and analyze neurophysiological data. Topics include state-space modeling formulated using the Bayesian Chapman-Kolmogorov system, theory of point processes, EM algorithm, Bayesian and sequential Monte Carlo methods. Applications include dynamic analyses of neural encoding, neural spike train decoding, studies of neural receptive field plasticity, algorithms for neural prosthetic control, EEG and MEG source localization. Students should know introductory probability theory and statistics."}, "Data Acquisition and Image Reconstruction in MRI": {"title": "Data Acquisition and Image Reconstruction in MRI", "number": "HST.580[J]", "description": "Applies analysis of signals and noise in linear systems, sampling, and Fourier properties to magnetic resonance (MR) imaging acquisition and reconstruction. Provides adequate foundation for MR physics to enable study of RF excitation design, efficient Fourier sampling, parallel encoding, reconstruction of non-uniformly sampled data, and the impact of hardware imperfections on reconstruction performance. Surveys active areas of MR research. Assignments include Matlab-based work with real data. Includes visit to a scan site for human MR studies."}, "Functional Magnetic Resonance Imaging: Data Acquisition and Analysis": {"title": "Functional Magnetic Resonance Imaging: Data Acquisition and Analysis", "number": "HST.583[J]", "description": "Provides background necessary for designing, conducting, and interpreting fMRI studies in the human brain. Covers in depth the physics of image encoding, mechanisms of anatomical and functional contrasts, the physiological basis of fMRI signals, cerebral hemodynamics, and neurovascular coupling. Also covers design methods for stimulus-, task-driven and resting-state experiments, as well as workflows for model-based and data-driven analysis methods for data. Instruction in brain structure analysis and surface- and region-based analyses. Laboratory sessions include data acquisition sessions at the 3 Tesla MRI scanner at MIT and the Connectom and 7 Tesla scanners at the MGH/HST Martinos Center, as well as hands-on data analysis workshops. Introductory or college-level neurobiology, physics, and signal processing are helpful."}, "Magnetic Resonance Analytic, Biochemical, and Imaging Techniques": {"title": "Magnetic Resonance Analytic, Biochemical, and Imaging Techniques", "number": "HST.584[J]", "description": "Introduction to basic NMR theory. Examples of biochemical data obtained using NMR summarized along with other related experiments. Detailed study of NMR imaging techniques includes discussions of basic cross-sectional image reconstruction, image contrast, flow and real-time imaging, and hardware design considerations. Exposure to laboratory NMR spectroscopic and imaging equipment included."}, "Biomedical Engineering Seminar Series": {"title": "Biomedical Engineering Seminar Series", "number": "HST.590", "description": "Seminars focused on the development of professional skills. Each term focuses on a different topic, resulting in a repeating cycle that covers medical ethics, responsible conduct of research, written and oral technical communication, and translational issues. Includes guest lectures, case studies, interactive small group discussions, and role-playing simulations."}, "Laboratory on the Physiology, Acoustics, and Perception of Speech": {"title": "Laboratory on the Physiology, Acoustics, and Perception of Speech", "number": "HST.712[J]", "description": "Experimental investigations of speech processes. Topics include computer-aided waveform analysis and spectral analysis of speech; synthesis of speech; perception and discrimination of speech-like sounds; speech prosody; models of speech recognition; speech development; analysis of atypical speech; and others. Recommended prerequisite: 6.002, 18.03, or 24.900."}, "Acoustics, Production and Perception of Speech": {"title": "Acoustics, Production and Perception of Speech", "number": "HST.714[J]", "description": "Reviews the physical processes involved in the production and propagation of sound, and acoustics related to hearing.  Particular attention to how the acoustics and mechanics of the speech and auditory system define what sounds we are capable of producing and how we sense sound. Introduces acoustic theory of speech production, digital speech processing, and neural mechanisms of speech production and perception. Exposes students to applications around acoustics, recognition, and speech disorders. Also introduces analysis of various types of sounds. Includes take-home laboratory assignments and discussions of classic papers."}, "Signal Processing by the Auditory System: Perception": {"title": "Signal Processing by the Auditory System: Perception", "number": "HST.716[J]", "description": "Studies information processing performance of the human auditory system in relation to current physiological knowledge. Examines mathematical models for the quantification of auditory-based behavior and the relation between behavior and peripheral physiology, reflecting the tono-topic organization and stochastic responses of the auditory system. Mathematical models of psychophysical relations, incorporating quantitative knowledge of physiological transformations by the peripheral auditory system."}, "Anatomy of Speech and Hearing": {"title": "Anatomy of Speech and Hearing", "number": "HST.718", "description": "Studies the anatomy of the human head and neck, focusing on structures involved in speech and hearing. Covers general organization of the nervous system and control of the peripheral structures. Involves dissection of a human cadaver, examination of brain specimens, and analysis of cross-sectional radiographic images. Limited to 12; undergraduates admitted based on seniority."}, "Music Perception and Cognition": {"title": "Music Perception and Cognition", "number": "HST.725", "description": "Survey of perceptual and cognitive aspects of the psychology of music, with special emphasis on underlying neurocomputational representations and mechanisms. Systematically explores basic dimensions of hearing (pitch, timbre, consonance, loudness) and the time sense (duration, temporal pattern) that form our perception of tonal quality, melody, harmony, meter, and rhythm in music. Examines mechanisms responsible for separation of multiple voices/instruments (polyphony), and for melodic and rhythmic grouping of events (musical phrase structure). Special topics include comparative, evolutionary, and developmental psychology of music; biological vs. cultural influences; Gestaltist, associationist, and schema-based theories; music vs. speech perception; music vs. language cognition; music and cortical function, music therapy, and neural basis of music performance."}, "Automatic Speech Recognition": {"title": "Automatic Speech Recognition", "number": "HST.728[J]", "description": "Introduces the rapidly developing fields of automatic speech recognition and spoken language processing. Topics include acoustic theory of speech production, acoustic-phonetics, signal representation, acoustic and language modeling, search, hidden Markov modeling, neural networks models, adaptation, and other related speech processing topics. Lecture material intersperses theory with practice.  Includes problem sets, laboratory exercises, and opened-ended term project."}, "Frontiers in Therapeutics and Drug Delivery": {"title": "Frontiers in Therapeutics and Drug Delivery", "number": "HST.914[J]", "description": "Provides an introduction to pharmaceutics and conventional oral, injected, transdermal and inhaled drug delivery systems. Includes studies of drug delivery devices and systems, e.g., stents, pumps, depo systems, responsive drug delivery systems, and biological/cell based therapies. Covers nano- and micro drug delivery systems, including polymer-drug conjugates, modified proteins, liposomes and polymer nanoparticles, viral and non-viral genetic therapy, and microencapsulated vaccines. Discusses reviews and current technology. Students taking graduate version complete additional assignments. Limited to 40."}, "Case Studies and Strategies in Drug Discovery and Development": {"title": "Case Studies and Strategies in Drug Discovery and Development", "number": "HST.916[J]", "description": "Aims to develop appreciation for the stages of drug discovery and development, from target identification, to the submission of preclinical and clinical data to regulatory authorities for marketing approval. Following introductory lectures on the process of drug development, students working in small teams analyze how one of four new drugs or drug candidates traversed the discovery/development landscape. For each case, an outside expert from the sponsoring drug company or pivotal clinical trial principal investigator provides guidance and critiques the teams' presentations to the class."}, "Economics of Health Care Industries": {"title": "Economics of Health Care Industries", "number": "HST.918[J]", "description": "Considers health economics issues from a business perspective, including differences between health care and other industries, the role of health insurance, regulatory issues and incentives for innovation, data analytics to measure value, strategic issues in pricing and marketing, use of e-commerce and information technology, personalized/stratified medicines, and formation and management of various alliances. Explores US and global health institutions. Visiting speakers from academia, government, NGOs, and industry."}, "Principles and Practice of Drug Development": {"title": "Principles and Practice of Drug Development", "number": "HST.920[J]", "description": "Description and critical assessment of the major issues and stages of developing a pharmaceutical or biopharmaceutical. Drug discovery, preclinical development, clinical investigation, manufacturing and regulatory issues considered for small and large molecules. Economic and financial considerations of the drug development process. Multidisciplinary perspective from faculty in clinical; life; and management sciences; as well as industry guests."}, "Engineering Health: Understanding and Designing Affordable Health Diagnostics": {"title": "Engineering Health: Understanding and Designing Affordable Health Diagnostics", "number": "HST.928[J]", "description": "Designing and building novel health diagnostics and sensors while learning the fundamentals of rapid prototyping, applied optics, signals processing, imaging and other advanced sensing modalities. Students work in teams with a physician and technical mentor to design and construct a cutting edge health diagnostic or device. The best projects may be continued in the Spring semester through a clinical trials and ventures program reaching early trials by the end of the school year."}, "Engineering Health: Designing and Deploying Affordable Health Diagnostics and Therapeutics": {"title": "Engineering Health: Designing and Deploying Affordable Health Diagnostics and Therapeutics", "number": "HST.929[J]", "description": "Students design and construct a cutting-edge health diagnostic or device and explore opportunities to test and deploy it. Through structured interactions with physicians, and technical rounds at local hospitals, students incorporate user-centric design into their devices and engage with the health community towards implementation.  Provides exposure to clinical trials, the FDA, user experience, intellectual property, and entrepreneurship."}, "Global Health Informatics to Improve Quality of Care": {"title": "Global Health Informatics to Improve Quality of Care", "number": "HST.938", "description": "Addresses issues related to how health information systems can improve the quality of care in resource poor settings. Discusses key challenges and real problems; design paradigms and approaches; and system evaluation and the challenges of measuring impact. Weekly lectures led by internationally recognized experts in the field. Students taking HST.936, HST.937 and HST.938 attend common lectures; assignments and laboratory time differ.  HST.936 has no laboratory."}, "Bioinformatics: Principles, Methods and Applications": {"title": "Bioinformatics: Principles, Methods and Applications", "number": "HST.940[J]", "description": "Introduction to bioinformatics, the collection of principles and computational methods used to upgrade the information content of biological data generated by genome sequencing, proteomics, and cell-wide physiological measurements of gene expression and metabolic fluxes. Fundamentals from systems theory presented to define modeling philosophies and simulation methodologies for the integration of genomic and physiological data in the analysis of complex biological processes. Various computational methods address a broad spectrum of problems in functional genomics and cell physiology. Application of bioinformatics to metabolic engineering, drug design, and biotechnology also discussed."}, "Biomedical Computing": {"title": "Biomedical Computing", "number": "HST.950[J]", "description": "Analyzes computational needs of clinical medicine, reviews systems and approaches that have been used to support those needs, and the relationship between clinical data and gene and protein measurements to support precision medicine. Topics include the nature of clinical data, architecture and design of healthcare information systems, privacy and security issues, medical expert systems, predictive models and machine learning from big data in healthcare, and an introduction to bioinformatics. Case studies and guest lectures describe contemporary institutions, systems, and research projects. Term project using large clinical and genomic data sets integrates classroom topics."}, "Collaborative Data Science in Medicine": {"title": "Collaborative Data Science in Medicine", "number": "HST.953", "description": "A guide for data scientists, engineers, and clinicians who are interested in performing retrospective research using data from electronic health records.  Instruction provided in clinical decision-making and secondary use of clinical data, using the Medical Information Mart for Intensive Care (MIMIC) database and the eICU Collaborative Research Database. Covers steps in parsing a clinical question into a study design and methodology for data analysis and interpretation.  Activities include review of case studies using the MIMIC and the eICU Collaborative Research Database and a team project. Student teams choose a question and clinician to work with for their project. Teams meet weekly with clinicians at the hospitals at arranged time."}, "Machine Learning for Healthcare": {"title": "Machine Learning for Healthcare", "number": "HST.956", "description": "Introduces students to machine learning in healthcare, including the nature of clinical data and the use of machine learning for risk stratification, disease progression modeling, precision medicine, diagnosis, subtype discovery, and improving clinical workflows. Topics include causality, interpretability, algorithmic fairness, time-series analysis, graphical models, deep learning and transfer learning. Guest lectures by clinicians from the Boston area, and projects with real clinical data, emphasize subtleties of working with clinical data and translating machine learning into clinical practice. Limited to 55."}, "Medical Product Development and Translational Biomedical Research": {"title": "Medical Product Development and Translational Biomedical Research", "number": "HST.962", "description": "Explores the translation of basic biomedical science into therapies. Topics span pharmaceutical, medical device, and diagnostics development. Exposes students to strategic assessment of clinical areas, product comparison, regulatory risk assessment by indication, and rational safety program design. Develops quantitative understanding of statistics and trial design."}, "Strategic Decision Making in the Life Sciences": {"title": "Strategic Decision Making in the Life Sciences", "number": "HST.971[J]", "description": "Surveys key strategic decisions faced by managers, investors and scientists at each stage in the value chain of the life science industry. Aims to develop students' ability to understand and effectively assess these strategic challenges. Focuses on the biotech sector, with additional examples from the pharmaceutical and medical device sectors. Includes case studies, analytical models, and detailed quantitative analysis. Intended for students interested in building a life science company or working in the sector as a manager, consultant, analyst, or investor. Provides analytical background to the industry for biological and biomedical scientists, engineers and physicians with an interest in understanding the commercial dynamics of the life sciences or the commercial potential of their research."}, "Medicine for Managers and Entrepreneurs Proseminar": {"title": "Medicine for Managers and Entrepreneurs Proseminar", "number": "HST.972[J]", "description": "Provides students with basic business-oriented clinical and technological knowledge related to health, healthcare and medicine through engagements with clinical and industry experts. Each session focuses on a specific field of medicine. Speakers include a basic science and/or clinical expert and a CEO or other senior executive involved in cutting-edge innovation in each area."}, "Evaluating a Biomedical Business Concept": {"title": "Evaluating a Biomedical Business Concept", "number": "HST.973[J]", "description": "Involves critical analysis of new biomedical business ideas. Inventors or principals of early stage companies present their ideas and provide background material including scientific papers and patents. Student teams interact with the companies, potential customers, other stakeholders and experts to develop a series of analyses concerning the critical issues. Company and student presentations supplemented by topic-specific lectures and presentations by biomedical entrepreneurs. Enrollment limited."}, "Healthcare Ventures": {"title": "Healthcare Ventures", "number": "HST.978[J]", "description": "Addresses healthcare entrepreneurship with an emphasis on startups bridging care re-design, digital health, medical devices, and high-tech. Includes prominent speakers and experts from key domains across medicine, pharma, med devices, regulatory, insurance, software, design thinking, entrepreneurship, and investing. Provides practical experiences in venture validation/creation through team-based work around themes. Illustrates best practices in identifying and validating health venture opportunities amid challenges of navigating healthcare complexity, team dynamics, and venture capital raising process. Intended for students from engineering, medicine, public health, and MBA programs. Video conference facilities provided to facilitate remote participation by Executive MBA and traveling students."}, "Emerging Problems in Infectious Diseases": {"title": "Emerging Problems in Infectious Diseases", "number": "HST.980", "description": "Introduces contemporary challenges in preventing, detecting, diagnosing and treating emerging and newly emerging pathogens. Provides students with team-based opportunities to brainstorm, propose and present innovative solutions to such challenges. Expert lecturers discuss emerging problems in infectious diseases. Includes brainstorming sessions in which student teams identify problems in infectious diseases and propose innovative solutions. The teams then prepare and deliver short presentations, outlining identified problems and solutions."}, "Undergraduate Research in Health Sciences and Technology": {"title": "Undergraduate Research in Health Sciences and Technology", "number": "HST.UR", "description": "Extended participation in the work of a faculty member or research group. Research is arranged by mutual agreement between the student and a member of the faculty of the Harvard-MIT Program Health Sciences and Technology, and may continue over several terms. Registration requires submission of a written proposal to the MIT UROP, signed by the faculty supervisor and approved by the department. A summary report must be submitted at the end of each term."}, "Special Graduate Subject: Health Sciences and Technology": {"title": "Special Graduate Subject: Health Sciences and Technology", "number": "HST.S19", "description": "Opportunity for group study of advanced subjects related to Health Sciences and Technology not otherwise included in the curriculum. Offerings are initiated by IMES/HST faculty on an ad hoc basis subject to program approval. Prerequisites may vary by topic; consult faculty at time of offering."}, "Special Graduate Subject: Medical Engineering and Medical Physics": {"title": "Special Graduate Subject: Medical Engineering and Medical Physics", "number": "HST.S59", "description": "Opportunity for group study of advanced subjects related to the Medical Engineering and Medical Physics Program not otherwise included in the curriculum. Offerings are initiated by IMES/HST faculty on an ad hoc basis subject to program approval. Prerequisites may vary by topic; consult faculty at time of offering."}, "Special Subject: Medical Engineering and Medical Physics": {"title": "Special Subject: Medical Engineering and Medical Physics", "number": "HST.S58", "description": "Opportunity for group study of advanced subjects related to the Medical Engineering and Medical Physics Program not otherwise included in the curriculum. Offerings are initiated by HST faculty on an ad hoc basis subject to program approval. Prerequisites may vary by topic; consult faculty at time of offering."}, "Special Subject: Speech and Hearing Sciences": {"title": "Special Subject: Speech and Hearing Sciences", "number": "HST.S78", "description": "Opportunity for group study of advanced subjects related to the Speech and Hearing Sciences not otherwise included in the curriculum. Offerings initiated by members of the SHS faculty on an ad hoc basis subject to program approval. Prerequisites may vary by topic; consult faculty at time of offering."}, "Special Graduate Subject: Biomedical Entrepreneurship": {"title": "Special Graduate Subject: Biomedical Entrepreneurship", "number": "HST.S99", "description": "Opportunity for group study of advanced subjects relating to biomedical entrepreneurship not otherwise included in the curriculum. Offerings are initiated by HST faculty on an ad hoc basis subject to program approval. Prerequisites may vary by topic. Consult faculty at time of offering."}}