{"Analytical Methods for Supply Chain Management": {"title": "Analytical Methods for Supply Chain Management", "number": "SCM.250", "description": "Covers the primary methods of analysis required for supply chain management planning. The class solves various practical problems using simulation, linear programming, integer programming, regression, and other techniques. The work is primarily team based with a final exam. Restricted to SCM students."}, "Supply Chain Financial Analysis": {"title": "Supply Chain Financial Analysis", "number": "SCM.251", "description": "Explores the linkages between supply chain management and corporate finance. Emphasizes how the supply chain creates value for both the shareholders of the company and for the stakeholders affected by the company's operations. Sessions combine lectures and data-rich cases from the manufacturer, distributor, and retailer perspective. Topics include accounting fundamentals, financial analysis, activity-based costing, working capital management, cash flow projections, capital budgeting, and sustainability. SCM students are  required to also register for SCM.253 when offered."}, "Supply Chain Software": {"title": "Supply Chain Software", "number": "SCM.252", "description": "Provides an overview of the main types of supply chain software including ERP, WMS, and TMS systems. Describes their main functionality, how they work, how they are used, their architecture, data flows, and how they are organized into modules. Also describes the software selection process and how software upgrade and implementation projects should be organized and managed. Restricted to SCM students."}, "Case Studies in Supply Chain Financial Analysis": {"title": "Case Studies in Supply Chain Financial Analysis", "number": "SCM.253", "description": "Students explore and discuss case studies that focus on financial analysis in real supply chains. Cases provide the opportunity for students to apply the theory and quantitative methods that they have studied in addressing actual supply chain challenges. These include decision making around sourcing, capital investments, inventory strategy, and new product introduction. Students present and defend their solutions to their peers."}, "Introduction to Programming and Data Analysis in Python": {"title": "Introduction to Programming and Data Analysis in Python", "number": "SCM.254", "description": "Introduction to Python programming and data analysis for supply chain management.  Students develop skills to program and analyze data to solve supply chain and logistics problems. Topics include data structures, Python structures and functions, Pandas, and other analysis tools. Restricted to SCM students."}, "Machine Learning Applications for Supply Chain Management": {"title": "Machine Learning Applications for Supply Chain Management", "number": "SCM.255", "description": "Introduces principles, algorithms, and applications of machine learning to the field of supply chain management. Covers the use of machine learning techniques in modeling and prediction, formulation of learning problems, representation, over-fitting, generalization, classification, regression, neural networks, and methods such as linear classifiers, feed-forward, unsupervised learning, and recurrent networks. Applies teaching examples to logistics, transportation, and supply chain problems. Enrollment limited."}, "Written Communication Topics for Supply Chain Management": {"title": "Written Communication Topics for Supply Chain Management", "number": "SCM.258", "description": "Reviews the structure of and expectations for the master's capstone project and thesis. Discusses the concepts of genre and audience and their importance in writing the capstone/thesis. Explores techniques for developing and organizing ideas (such as freewriting, mapping, outlining) and for writing fluid, concise prose. Students also write a blog entry for the SCM student blog. Restricted to SCM students."}, "Business Writing for Supply Chain Management": {"title": "Business Writing for Supply Chain Management", "number": "SCM.259", "description": "Focuses on analyzing and tailoring content for specific audiences, developing argumentation and persuasion skills, and writing clear, concise and well-structured documents (business letters, memos, executive summaries, and briefings). Covers business writing techniques and strategies through lectures and exercises, individual writing assignments, and peer review workshops. Restricted to SCM students."}, "Logistics Systems": {"title": "Logistics Systems", "number": "SCM.260[J]", "description": "Provides an introduction to supply chain management from both analytical and practical perspectives. Taking a unified approach, students develop a framework for making intelligent decisions within the supply chain. Covers key logistics functions, such as demand planning, procurement, inventory theory and control, transportation planning and execution, reverse logistics, and flexible contracting. Explores concepts such as postponement, portfolio management, and dual sourcing. Emphasizes skills necessary to recognize and manage risk, analyze various tradeoffs, and model logistics systems."}, "Leading Global Teams": {"title": "Leading Global Teams", "number": "SCM.262", "description": "Reinforces supply chain concepts and develops management and teamwork skills. Focuses on practical, rather than theoretical tools, methodologies, and approaches that students will use throughout their supply chain career. Includes guest lectures, a case competition, and several large-scale, team-based simulation learning games. Restricted to SCM students."}, "Advanced Writing Workshop for SCM": {"title": "Advanced Writing Workshop for SCM", "number": "SCM.263", "description": "Focuses on helping students write and present their ideas in cogent, persuasive arguments and other analytical frameworks. Designed to improve students' ability to communicate research information. Covers the basics of working with sources, including summarizing and paraphrasing, and synthesizing source materials. Workshops along with small team coaching sessions help students apply these lessons in the writing of their capstone project or thesis project. Restricted to SCM students."}, "Databases and Data Analysis for Supply Chain Management": {"title": "Databases and Data Analysis for Supply Chain Management", "number": "SCM.264", "description": "Introduces databases, data analysis, and machine learning topics. Covers data modeling, relational databases, SQL queries, data mining, non-relational databases, and data warehouses. Introduces data analysis tools for visualization, regression, supervised and unsupervised techniques including principal component analysis and clustering. Term project includes implementation of data model, database, visualization and data analysis."}, "Global Supply Chain Management": {"title": "Global Supply Chain Management", "number": "SCM.265[J]", "description": "Focuses on the planning, processes, and activities of supply chain management for companies involved in international commerce. Students examine the end-to-end processes and operational challenges in managing global supply chains, such as the basics of global trade, international transportation, duty, taxes, trade finance and hedging, currency issues, outsourcing, cultural differences, risks and security, and green supply chains issues. Highly interactive format features student-led discussions, staged debates, and a mock trial. Includes assignments on case studies and sourcing analysis, as well as projects and a final exam."}, "Freight Transportation": {"title": "Freight Transportation", "number": "SCM.266", "description": "Provides an in-depth introduction to the fundamental concepts and techniques related to the design, procurement, and management of freight transportation. Examines freight transportation as a bridging function for a firm, considering the physical flow of raw materials and finished goods as well as connections to suppliers and customers. Also covers how freight transportation insulates a firm's core operations from external disruptions and variability of supply and demand."}, "Data Science for Supply Chain Management": {"title": "Data Science for Supply Chain Management", "number": "SCM.268", "description": "Introduces data science topics through programming, including connections to databases and data warehouses, data filtering and manipulation, and data structures. Software packages for data analysis, statistical and numerical calculations, and machine learning will be covered. Includes coverage of source control, system architecture, cloud computing frameworks and modules, security, emerging financial technologies, and software process."}, "Current Challenges in Supply Chain Management": {"title": "Current Challenges in Supply Chain Management", "number": "SCM.270", "description": "Each week students study and then discuss a case and/or article(s) related to a current challenge in supply chain management. Led by faculty and researchers in the MIT Center for Transportation and Logistics (CTL) along with invited guest speakers from industry. Topics highlight the current areas of research at CTL as well as other challenging issues from industry. Includes several required case write-ups or research papers. Restricted to SCM students."}, "Supply Chain Communications Workshop": {"title": "Supply Chain Communications Workshop", "number": "SCM.280", "description": "Introduces topics of communication and methods to improve communication skills.  Provides students with tools needed to become clear speakers and effective leaders. Includes assessment of communication styles, tactics for effective negotiation, interview strategies, and presenting one's self.  Restricted to SCM students."}, "Supply Chain Public Speaking Workshop": {"title": "Supply Chain Public Speaking Workshop", "number": "SCM.281", "description": "Further develop and refine public speaking skills through engaging interactive workshops.  Techniques learned will help students become dynamic and authentic speakers. Includes impromptu speaking preparation, facilitating meetings, selling to the board room, and crafting presentations, always in relation to concepts and fundamentals of supply chain management. Restricted to SCM students."}, "Supply Chain Leadership Workshop": {"title": "Supply Chain Leadership Workshop", "number": "SCM.282", "description": "Designed to enhance your ability to manage and lead in challenging times through a series of self assessment instruments, case studies, and workshops. The objectives are to increase awareness of your strengths and weaknesses as a leader, provide a battery of instruments and surveys to help one understand the way one operates in an organizational setting, and offer strategies and tips on how to leverage one's strengths and work on areas in need of development. Restricted to SCM students."}, "Humanitarian Logistics": {"title": "Humanitarian Logistics", "number": "SCM.283", "description": "Explores how logistics management principles apply in dynamic, resource-constrained contexts, ranging from humanitarian crisis response to international development. Class sessions combine interactive presentations, practical exercises, case discussions, and guest speakers from humanitarian organizations. Provides an introduction to supply chain concepts and the humanitarian context to accommodate students from various backgrounds."}, "Humanitarian Logistics with Project": {"title": "Humanitarian Logistics with Project", "number": "SCM.284", "description": "Explores how logistics management principles apply in dynamic, resource-constrained contexts, ranging from humanitarian crisis response to international development. Combines interactive presentations, practical exercises, case discussions, and guest speakers from humanitarian organizations. Provides an introduction to supply chain concepts and the humanitarian context to accommodate students from various backgrounds. Team projects utilize data and information from the UN, NGOs, government agencies, and the private sector. Meets with SCM.283 first half of term."}, "Sustainable Supply Chain Management": {"title": "Sustainable Supply Chain Management", "number": "SCM.290", "description": "Introduces operational aspects of sustainable supply chains. Focuses on analyzing the implications of environmental considerations in logistics decisions. Topics include carbon footprint, sustainable logistics, closed-loop supply chains, reverse logistics, and sustainable supply chain strategy. Includes a team project that evaluates the sustainable supply chain strategy of an industry or a publicly-traded company."}, "Procurement Fundamentals": {"title": "Procurement Fundamentals", "number": "SCM.291", "description": "Introduces strategic procurement fundamentals to enhance both competitive advantage and resilience to supply chains. Covers frameworks and tools that managers use to elevate purchasing from an operational function to a strategic one. Includes both classic resilience- and cost-based portfolios, as well as modern perspectives, which consider sustainability and power. Combines theoretical and applied perspectives and is designed for students with or without previous procurement experience. Assessment based on case analysis and a final project."}, "Urban Last-Mile Logistics": {"title": "Urban Last-Mile Logistics", "number": "SCM.293[J]", "description": "Explores specific challenges of urban last-mile B2C and B2B distribution in both industrialized and emerging economies. Develops an in-depth understanding of the perspectives, roles, and decisions of all relevant stakeholder groups, from consumers, to private sector decision makers, to public policy makers. Discussion of the most relevant traditional and the most promising innovating operating models for urban last-mile distribution. Introduces application of the essential quantitative methods for the strategic design and tactical planning of urban last-mile distribution systems. Covers basic facility location problems, deterministic and stochastic network design problems, single- and multi-echelon vehicle routing problems, as well as associated approximation techniques."}, "Studies in Supply Chain Management": {"title": "Studies in Supply Chain Management", "number": "SCM.500", "description": "Introduction to supply chain management in a series of online subjects followed by a comprehensive examination. Analytics: analysis and modeling, statistics, regression, optimization and probability.  Fundamentals: concepts for logistics, demand forecasting, inventory planning, control, transportation planning, and execution.  Design: network design, finance, supplier management, demand planning, and organization design.  Dynamics: global supply chain management, system dynamics, risk management, case studies and simulations. Technology and systems: IT concepts, core systems, and data analysis. Restricted to students who successfully receive the MicroMasters Credential in Supply Chain Management and enroll in the SCM blended master?s program."}, "Capstone Project in Supply Chain Management": {"title": "Capstone Project in Supply Chain Management", "number": "SCM.800", "description": "Provides an opportunity for students to synthesize their coursework and professional experience in supply chain management. Students conduct research on a real-world problem of interest to supply chain practitioners. Projects may include site visits, in-person interviews and quantitative analysis of data provided by a sponsoring company, agency, or NGO. Students present their research results in both a report and to an audience of sponsors and supply chain executives. Restricted to SCM students."}}